
{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Robert S. Mueller III is said to be trying to determine whether the president had criminal intent when he fired James B. Comey, the F.B.I. director.",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "8_L",
  "text": "WASHINGTON — Robert S. Mueller III, the special counsel investigating Russia's election interference, has at least four dozen questions on an exhaustive array of subjects he wants to ask President Trump to learn more about his ties to Russia and determine whether he obstructed the inquiry itself, according to a list of the questions obtained by The New York Times. \nThe open-ended queries appear to be an attempt to penetrate the president's thinking, to get at the motivation behind some of his most combative Twitter posts and to examine his relationships with his family and his closest advisers. They deal chiefly with the president's high-profile firings of the F.B.I. director and his first national security adviser, his treatment of Attorney General Jeff Sessions and a 2016 Trump Tower meeting between campaign officials and Russians offering dirt on Hillary Clinton. \nBut they also touch on the president's businesses; any discussions with his longtime personal lawyer, Michael D. Cohen, about a Moscow real estate deal; whether the president knew of any attempt by Mr. Trump's son-in-law, Jared Kushner, to set up a back channel to Russia during the transition; any contacts he had with Roger J. Stone Jr., a longtime adviser who claimed to have inside information about Democratic email hackings; and what happened during Mr. Trump's 2013 trip to Moscow for the Miss Universe pageant. \nMr. Trump said on Twitter on Tuesday that it was \"disgraceful\" that questions the special counsel would like to ask him were publicly disclosed, and he incorrectly noted that there were no questions about collusion. The president also said collusion was a \"phony\" crime. \nThe questions provide the most detailed look yet inside Mr. Mueller's investigation, which has been shrouded in secrecy since he was appointed nearly a year ago. The majority relate to possible obstruction of justice, demonstrating how an investigation into Russia's election meddling grew to include an examination of the president's conduct in office. Among them are queries on any discussions Mr. Trump had about his attempts to fire Mr. Mueller himself and what the president knew about possible pardon offers to Michael T. Flynn, the former national security adviser. \n\"What efforts were made to reach out to Mr. Flynn about seeking immunity or possible pardon?\" Mr. Mueller planned to ask, according to questions read by the special counsel investigators to the president's lawyers, who compiled them into a list. That document was provided to The Times by a person outside Mr. Trump's legal team. \nA few questions reveal that Mr. Mueller is still investigating possible coordination between the Trump campaign and Russia. In one of the more tantalizing inquiries, Mr. Mueller asks what Mr. Trump knew about campaign aides, including the former chairman Paul Manafort, seeking assistance from Moscow: \"What knowledge did you have of any outreach by your campaign, including by Paul Manafort, to Russia about potential assistance to the campaign?\" No such outreach has been revealed publicly. \nJay Sekulow, a lawyer for Mr. Trump, declined to comment. A spokesman for the special counsel's office did not respond to a request for comment. \nThe questions serve as a reminder of the chaotic first 15 months of the Trump presidency and the transition and campaign before that. Mr. Mueller wanted to inquire about public threats the president made, conflicting statements from Mr. Trump and White House aides, the president's private admissions to Russian officials, a secret meeting at an island resort, WikiLeaks, salacious accusations and dramatic congressional testimony. \nThe special counsel also sought information from the president about his relationship with Russia. Mr. Mueller would like to ask Mr. Trump whether he had any discussions during the campaign about any meetings with President Vladimir V. Putin of Russia and whether he spoke to others about either American sanctions against Russia or meeting with Mr. Putin. \nThrough his questions, Mr. Mueller also tries to tease out Mr. Trump's views on law enforcement officials and whether he sees them as independent investigators or people who should loyally protect him. \nFor example, when the F.B.I. director, James B. Comey, was fired, the White House said he broke with Justice Department policy and spoke publicly about the investigation into Mrs. Clinton's email server. Mr. Mueller's questions put that statement to the test. He wants to ask why, time and again, Mr. Trump expressed no concerns with whether Mr. Comey had abided by policy. Rather, in statements in private and on national television, Mr. Trump suggested that Mr. Comey was fired because of the Russia investigation. \nMany of the questions surround Mr. Trump's relationship with Mr. Sessions, including the attorney general's decision to recuse himself from the Russia investigation and whether Mr. Trump told Mr. Sessions he needed him in place for protection. \nMr. Mueller appears to be investigating how Mr. Trump took steps last year to fire Mr. Mueller himself. The president relented after the White House counsel, Donald F. McGahn II, threatened to resign, an episode that the special counsel wants to ask about. \n\"What consideration and discussions did you have regarding terminating the special counsel in June of 2017?\" Mr. Mueller planned to ask, according to the list of questions. \"What did you think and do in reaction to Jan. 25, 2018, story about the termination of the special counsel and Don McGahn backing you off the termination?\" he planned to ask, referring to the Times article that broke the news of the confrontation. \nMr. Mueller has sought for months to question the president, who has in turn expressed a desire, at times, to be interviewed, viewing it as an avenue to end the inquiry more quickly. His lawyers have been negotiating terms of an interview out of concern that their client — whose exaggerations, half-truths and outright falsehoods are well documented — could provide false statements or easily become distracted. Four people, including Mr. Flynn, have pleaded guilty to lying to investigators in the Russia inquiry. \nThe list of questions grew out of those negotiations. In January, Mr. Trump's lawyers gave Mr. Mueller several pages of written explanations about the president's role in the matters the special counsel is investigating. Concerned about putting the president in legal jeopardy, his lead lawyer, John Dowd, was trying to convince Mr. Mueller he did not need to interview Mr. Trump, according to people briefed on the matter. \nMr. Mueller was apparently unsatisfied. He told Mr. Dowd in early March that he needed to question the president directly to determine whether he had criminal intent when he fired Mr. Comey, the people said. \nBut Mr. Dowd held firm, and investigators for Mr. Mueller agreed days later to share during a meeting with Mr. Dowd the questions they wanted to ask Mr. Trump. \nWhen Mr. Mueller's team relayed the questions, their tone and detailed nature cemented Mr. Dowd's view that the president should not sit for an interview. Despite Mr. Dowd's misgivings, Mr. Trump remained firm in his insistence that he meet with Mr. Mueller. About a week and a half after receiving the questions, Mr. Dowd resigned, concluding that his client was ignoring his advice. \nMr. Trump's new lawyer in the investigation and his longtime confidant, Rudolph W. Giuliani, met with Mr. Mueller last week and said he was trying to determine whether the special counsel and his staff were going to be \"truly objective.\" \nMr. Mueller's endgame remains a mystery, even if he determines the president broke the law. A longstanding Justice Department legal finding says presidents cannot be charged with a crime while they are in office. The special counsel told Mr. Dowd in March that though the president's conduct is under scrutiny, he is not a target of the investigation, meaning Mr. Mueller does not expect to charge him. \nThe prospect of pardons is also among Mr. Mueller's inquiries, and whether Mr. Trump offered them to a pair of former top aides to influence their decisions about whether to cooperate with the special counsel investigation. \nMr. Dowd broached the idea with lawyers for both of the advisers, Mr. Flynn and Mr. Manafort, according to people with knowledge of the discussions. Mr. Manafort has pleaded not guilty on charges of money laundering and other financial crimes related to his work for the pro-Russia former president of Ukraine. \nMr. Flynn, a retired Army lieutenant general who was ousted from the White House in February 2017 amid revelations about contacts with the Russian ambassador to the United States, ultimately pleaded guilty last December to lying to federal authorities and agreed to cooperate with the special counsel. \n\"After General Flynn resigned, what calls or efforts were made by people associated with you to reach out to General Flynn or to discuss Flynn seeking immunity or possible pardon?\" Mr. Mueller planned to ask.",
  "title": "Mueller has dozens of inquiries for Trump in broad quest on Russia ties and obstruction",
  "title_page": null,
  "title_rss": null,
  "url": null
}
