{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "8_LL",
  "text": "The New York Times obtained a list of possible questions for the president. \nSpecial counsel Robert Mueller hopes to ask President Donald Trump dozens of open-ended questions as part of his inquiry into Russian meddling in the 2016 election. \nMany of those questions, which were published by The New York Times on Monday, focus on determining if Trump obstructed justice through his firings of FBI Director James Comey and national security adviser Michael Flynn, or his attempts to fire Mueller himself, among other events. \n\"What efforts were made to reach out to Mr. Flynn about seeking immunity or possible pardon?\" reads one of the queries supplied to the Times by an unnamed official separate from the president's legal team. \"What consideration and discussions did you have regarding terminating the special counsel in June of 2017?\" another asks. \nThe questions shed light on what's been a tight-lipped investigation and show Mueller is homing in on the president's behavior in office. Some of the inquiries hope to shed light on Trump's interactions, if there are any, with Russian officials or those connected to the Kremlin during the campaign. \nTrump himself has publicly said he'd be willing to talk with Mueller and has vehemently denied there was any collusion with the Russians during the campaign. He said in January he was \"looking forward\" to speaking with the special counsel. \nIn response to the Times report, Trump on Tuesday lashed out at the investigation. \nThe president's lawyers have cautioned against the interview and have sought to strictly limit the terms of any sit-down, worried that Trump could go off-script and end up making false statements. The Times noted that four people in the president's orbit have already pleaded guilty to lying to federal investigators. \nThe questions obtained by the Times are said to be the result of months of negotiations between the special counsel and Trump's squadron of lawyers. The Times noted that the back and forth led to Mueller providing his ideal list to Trump's former lead lawyer in the Russia inquiry, John Dowd, in March. \nDowd, who had urged Trump to reject any request for an interview in the investigation, was reportedly even more wary about a meeting after seeing the list. But the lawyer resigned later in March amid reports that his relationship with the president had frayed and that Trump planned to ignore his advice. \nDowd was replaced last week by former New York City Mayor Rudy Giuliani. \nTrump has ramped up his criticism of the special counsel's office in recent weeks following FBI raids at the home and offices of his longtime personal attorney Michael Cohen. \"It's a total witch-hunt. I've been saying it for a long time,\" Trump said at the time. \nThe president, however, has since moved to distance himself from Cohen, saying on \"Fox & Friends\" last week that the lawyer handled only a \"tiny, tiny little fraction\" of his overall legal work. \nMueller's list of questions also includes some involving Cohen's business deals in Moscow, according to the Times.",
  "title": "What Robert Mueller reportedly wants to ask Donald Trump",
  "title_page": null,
  "title_rss": null,
  "url": null
}
