{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "In an interview with USA TODAY, James Comey warned that should the president fire special counsel Robert Mueller, it would be \"an attack on the rule of law that we have not seen in our lifetime.\" ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "8_M",
  "text": "WASHINGTON – Special counsel Robert Mueller has given a list of almost four dozen questions to lawyers for President Trump as part of his investigation into Russian meddling in the 2016 election and whether Trump obstructed justice, according to a report published in The New York Times. \nThe Times obtained a list of the questions, which range from Trump's motivations for firing FBI Director James Comey a year ago to contacts Trump's campaign had with Russians. \nAlthough Mueller's team has indicated to Trump's lawyers that he's not considered a target, investigators remain interested in whether the president's actions constitute obstruction of justice and want to interview him about several episodes in office. The lawyers want to resolve the investigation as quickly as possible, but there's no agreement on how to do that. \nMany of the questions obtained by the Times center on the obstruction issue, including his reaction to Attorney General Jeff Sessions' recusal from the Russia investigation, a decision Trump has angrily criticized. \nTrump lawyer Jay Sekulow declined to comment to The Associated Press on Monday night, as did White House lawyer Ty Cobb. The questions also touch on the Russian meddling and whether the Trump campaign coordinated with the Kremlin in any way. In one question obtained by the Times, Mueller asks what Trump knew about campaign staff, including his former campaign chairman Paul Manafort, reaching out to Moscow. \nMueller has brought several charges against Manafort, but none are for any crimes related to Russian election interference during the 2016 campaign. And he has denied having anything to do with such an effort. \nThe queries also touch on Trump's businesses and his discussions with his personal lawyer, Michael Cohen, about a possible Moscow real estate deal. Cohen's business dealings are part of a separate FBI investigation. One question asks what discussions Trump may have had regarding \"any meeting with Mr. Putin,\" referring to Russian President Vladimir Putin. Another question asks what the president may have known about a possible attempt by his son-in-law, Jared Kushner, to set up a back channel with Russia before Trump's inauguration. \nAdditional questions center on Michael Flynn, Trump's former national security adviser, who has pleaded guilty to lying to the FBI about his discussions on sanctions against Russia with Russian Ambassador Sergey Kislyak during the presidential transition. Flynn is now cooperating with Mueller's investigators. \n\"What did you know about phone calls that Mr. Flynn made with the Russian ambassador, Sergey I. Kislyak, in late December 2016?\" reads one question. Another asks if there were any efforts to reach out to Flynn \"about seeking immunity or possible pardon.\" \nFlynn was fired Feb. 13, 2017, after White House officials said he had misled them about his Russian contacts during the transition period by saying that he had not discussed sanctions. \nThe following day, according to memos written by Comey, Trump cleared the Oval Office of other officials and encouraged Comey to drop the investigation into Flynn. ",
  "title": "Robert Mueller provides list of questions to Trump's lawyers, 'NYT' reports. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
