{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "8_R",
  "text": "The investigation into Russian involvement in the 2016 presidential election continues – with Special Counsel Robert Mueller at its helm. \nMueller, 73, took over the federal government's probe into alleged collusion between President Trump's campaign and Russian officials in May 2017. Already, his investigation has led to charges for four Trump campaign associates, though none of the charges are directly related to any misconduct by the president's campaign. \nTrump has in the past expressed willingness to testify under oath as part of Mueller's investigations and has repeatedly denied any \"collusion\" with Russians. \nWhy is Mueller overseeing the Russia investigation? \nThe Department of Justice announced the appointment of Mueller to oversee the federal investigation into Russia's alleged meddling in the 2016 election in May 2017. \nThe appointment came after a growing cry – mostly from Democrats – for someone outside the Justice Department to handle the probe. Attorney General Jeff Sessions had already recused himself from the investigation. \nMueller led the FBI through the Sept. 11, 2001, terrorist attacks and served under presidential administrations of both parties. \nFor the inquiry into the 2016 election, Mueller has the authority to prosecute any crimes uncovered during this investigation, and he was given wide authority to investigate whether Trump or his associates colluded with the Kremlin to win the White House. \nHas anyone been charged? \nIn his leading role, Mueller took over an ongoing investigation into Paul Manafort's financial dealings in Ukraine. \nManafort, Trump's former campaign chairman, and Richard Gates were indicted on Oct. 27 on multiple counts, including: conspiracy against the U.S., conspiracy to launder money, false statements and failure to file reports of foreign bank and financial accounts. Manafort and Gates initially pleaded not guilty to the charges. \nNearly four months later, on Feb. 22, the pair was hit with additional tax evasion and bank fraud charges and the amount of money Manafort was accused of laundering through offshore accounts increased to $30 million. \nGates pleaded guilty to federal conspiracy and false-statements charges on Feb. 23. After the plea, Mueller moved to drop the 22 bank and tax fraud charges against Gates, possibly suggesting that the former Trump campaign official is cooperating and providing good information to Mueller's team. \nMueller also accused Manafort of secretly paying former European politicians to lobby on behalf of Ukraine. Manafort has continued to maintain his innocence, pleading not guilty to the charges in federal court on March 8. \nMichael Flynn, the administration's short-lived national security adviser, was charged in December with lying to the FBI about certain conversations he had with a Russian ambassador. He pleaded guilty. \nAdditionally, George Papadopoulos pleaded guilty in 2017 to one count of making false statements to investigating FBI agents, according to court documents. Papadopoulos was a foreign policy adviser for Trump's campaign. \nAlex van der Zwaan, an attorney, pleaded guilty to lying to investigators about Gates in the Russia inquiry. In April 2018, he was sentenced to 30 days in prison, making him the first to be sentenced in the investigation. \nRichard Pinedo, a California man who sold bank accounts to Russians meddling in the election, pleaded guilty in February 2018 to using stolen identities to set up the accounts. The U.S. government said Pinedo was not aware he was dealing with Russians when he sold the accounts, however. \nThree Russian entities and 13 Russian nationals were indicted by a federal grand jury on Feb. 16 for allegedly interfering in the election. Mueller's case alleged those involved had a sophisticated plot to wage \"information warfare\" on the U.S. \nHowever, the Justice Department did not say the actions had an impact on the outcome of the election. Deputy Attorney Gen. Rod Rosenstein said, \"There is no allegation in this indictment that any American was a knowing participant in this illegal activity.\" \nHas Trump been questioned? \nThe president has not been questioned by Mueller or his team yet. \nHowever, The New York Times has obtained questions Mueller has provided to Trump's lawyers that he wants the president to answer. The questions include information related to Flynn, Sessions, fired FBI Director James Comey, former deputy FBI director Andrew McCabe and his campaign's connections to Russia, including the now-infamous Trump Tower meeting with Manafort, Donald Trump, Jr., the president's oldest son and Russian lawyer Natalia Veselnitskaya. \n\"So disgraceful that the questions concerning the Russian Witch Hunt were ‘leaked' to the media. No questions on Collusion,\" Trump said in a tweet. \"Oh, I see … you have a made up, phony crime, Collusion, that never existed, and an investigation begun with illegally leaked classified information. Nice!\" \nWhat's this we keep hearing about a controversy with Mueller's staff? \nThe Trump administration has sharply criticized Mueller's investigation, as several of his attorneys on staff donated to Democratic campaigns, including to Trump's 2016 rival, Hillary Clinton. \nAdditionally, two FBI officials – Peter Strzok and Lisa Page – are under fire for the anti-Trump text messages they exchanged during the election. Strzok was part of Mueller's team but was removed after the text messages were revealed. \nWhat has Trump said about Mueller's investigation? \nTrump has oftentimes dismissed the allegations that he colluded with Russia during the election. He said he is \"looking forward\" to eventually  being questioned under oath by Mueller. \nHe's said the allegations are a \"fake story that is demeaning to all of us and most of all demeaning to our country and demeaning to our Constitution.\" \n\"I just hope the final determination is a truly honest one, which is what the millions of people who gave us our big win in November deserve and what all Americans who want a better future want and deserve,\" Trump said at a rally in West Virginia last year. \nThe president also warned Mueller to stay within certain boundaries as he investigates. \nTrump and Mueller have sent messages \"back and forth,\" according to Trump's outside counsel. A spokesman for Mueller told Fox News that the messages have been \"very professional.\"",
  "title": "Mueller's Russia investigation: What to know",
  "title_page": null,
  "title_rss": null,
  "url": null
}
