{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "8_RR",
  "text": "Washington (AFP) – Special Counsel Robert Mueller has submitted questions to the White House that indicate a focus on whether President Donald Trump tried to obstruct a probe into Russian interference, The New York Times reported Monday. \nThe questions also show Mueller wants to find out what Trump knew about links between members of his presidential campaign and Russia, including a June 2016 meeting at Trump Tower with a Russian lawyer offering damaging information on election rival Hillary Clinton, the Times said. \nAnd they indicate that Mueller wants to know if Trump offered a pardon to his former national security advisor, Michael Flynn, who has already been charged by Mueller with lying and is believed to be cooperating with the investigation. \nThe questions are the clearest signal yet that Mueller has enough circumstantial evidence to suspect the president of obstruction, and also has reason to believe Trump might have known of the Russia links. \nBut there is no indication whether Trump is now an official suspect of the year-old probe, or that Mueller has found evidence of active collusion with the Russians, which Trump vehemently denies. \nThe Times obtained a list of questions it said Mueller's team read over the telephone to Trump's legal team, which compiled them into a list. \nThe Times said it obtained the list from someone outside Trump's legal team. \nMueller's office did not immediately respond to requests for comment. \nSince at least early this year, Mueller has discussed the possibility of interviewing Trump for the investigation, according to the president's attorneys. \nBut they appear to have been divided on how and how much Trump should cooperate. \nTwo weeks ago, Trump recruited to his legal team former New York mayor Rudy Giuliani, who said he would try to reach a deal with Mueller on how the president would cooperate with the probe. \nMost of the questions reported by the Times ask what Trump knew of certain events, like the June 2016 meeting with the Russian lawyer, or what was he thinking when he did or said something, like firing former FBI director James Comey. \n\"When did you become aware of the Trump Tower meeting?\" one question asks. \n\"What efforts were made to reach out to Mr Flynn about seeking immunity or possible pardon?\" goes another. \nMueller also wants to know if Trump discussed with any campaign staff arranging a meeting with Russian President Vladimir Putin. \nWhile none of the questions are accusatory, they could carry the risk of Trump being trapped in a lie if any of several former campaign staff already indicted by Mueller have provided evidence to the contrary.",
  "title": "Mueller hints at obstruction in Trump questions: report",
  "title_page": null,
  "title_rss": null,
  "url": null
}
