{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Date Published : Tuesday, November 15, 2011", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "41_4ecbplus", "text": " On Thursday, November 10th at approximately 3 : 00 pm, the Yida Refugee Camp in South Sudan was bombed.  Nonviolent Peaceforce's Yida protection team lives and works in the camp, providing protection monitoring and support to nearly 23, 000 Nuban refugees who have fled to South Sudan to escape the escalating violent conflict across the border in Sudan's South Kordofan.  Four bombs were dropped within just a few moments - two landed inside the camp itself, while the other two bombs were dropped near the airstrip where a UN helicopter was delivering much needed food aid.  Of the bombs that landed inside the camp, one detonated about a quarter mile from the NP compound.  The other landed next to the school building where 300 students were attending class, but it did not explode.  Tiffany Ornelas, NP's Yida Team Leader, reported that \"people were terrified ; they were running and screaming in all directions\".  However, there have been no casualties or fatalities confirmed as a result of this bombing.  In the days following the bombing, NP's team has been working with the refugee and host communities to verify the damage to the camp, account for children who fled during the bombing, set up a safety perimeter around the unexploded bomb to prevent curious children from approaching it, and explore options to further improve the safety and security of the refugees living at the camp.  NP's protection team arrived in Yida one month ago to respond to the direct protection needs of the camp and host populations.  NP's team of 3 international and 3 local protection officers are working to facilitate secure relations between both communities and to provide specialized support for the most vulnerable civilians, including more than 1200 unaccompanied children.", "title": " Bombing At Yida Refugee Camp, South Sudan.", "title_page": null, "title_rss": null, "url": " http : / / www. nonviolentpeaceforce.org / bombing - yida - refugee - camp - south - sudan"}