{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "A photograph released by North Korea's state news agency shows the North's leader, Kim Jong-un, center, at a ruling party meeting in the capital, Pyongyang, on Friday. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "2_L",
  "text": "SEOUL, South Korea — North Korea's leader, Kim Jong-un, announced early Saturday that his country no longer needed to test nuclear weapons or long-range missiles and would close a nuclear test site. \n\"The nuclear test site has done its job,\" Mr. Kim said in a statement carried by North Korea's state media. \nMr. Kim's announcement came just days before a scheduled summit meeting with President Moon Jae-in of South Korea; Mr. Kim is also planning to meet with President Trump soon. It was the second time in two days that he made what appeared to be a significant concession to the United States but in reality cemented the status quo. North Korea already had stopped testing its weapons.\nMr. Kim made no mention in his latest remarks of dismantling the nuclear weapons and long-range missiles North Korea has already built. On the contrary, he suggested he was going to keep them. \nStill, Mr. Trump welcomed what Mr. Kim said. \"North Korea has agreed to suspend all Nuclear Tests and close up a major test site,\" the president said in a Twitter message. \"This is very good news for North Korea and the World — big progress! Look forward to our Summit.\" \nMr. Moon's office also praised the announcement. \"We view the North's decision as a significant step toward the denuclearization of the Korean Peninsula the world has wished for,\" said Yoon Young-chan, a spokesman for Mr. Moon. \nDespite the enthusiasm, American officials have watched Mr. Kim with a mix of satisfaction and wariness. \nThe North Korean leader's move could be tactical — putting the United States on the defensive in advance of talks on its nuclear arsenal. By extending an olive branch, American officials said, North Korea is putting pressure on the United States to accept a deal before Mr. Kim agrees to give up North Korea's nuclear weapons. \nMr. Kim could also be trying to drive a wedge between the United States and South Korea, since President Moon has put great emphasis on ending more than six decades of conflict on the Korean Peninsula. \nOn Thursday, Mr. Moon said Mr. Kim had made a similar gesture, saying the North no longer insisted on the withdrawal of American troops from the Korean Peninsula. But White House officials privately dismissed the remarks, saying removal of the troops was never on the table. \nCaution toward Mr. Kim's peace overtures also punctuated the reaction of officials from Japan, which North Korea has long threatened with missile strikes. The defense minister, Itsunori Onodera, who was visiting Washington when Mr. Kim announced the suspension of nuclear and missile tests, said the move was \"not sufficient\" because it did not clearly state whether the suspension included the short and midrange missiles that could hit Japan. \nMr. Onodera also emphasized that a suspension was far short of denuclearization. \"What the international community expects is that North Korea abandon all weapons of mass destruction and ballistic missiles in a complete verifiable and irreversible manner,\" he said. \"It is not a time to relax pressure by the international community, but we must keep applying pressure with an aim that they abandon their nuclear weapons and missiles.\" \nIn a statement after a meeting of the Central Committee of his ruling Workers' Party, Mr. Kim said his country required no further nuclear and long-range missile tests because it had already achieved a nuclear deterrent. It was now time to focus on rebuilding the economy, he said. \n\"From April 21, North Korea will stop nuclear tests and launches of intercontinental ballistic missiles,\" the Korean Central News Agency said, quoting Mr. Kim. \nAn arms announcement from North Korea came one day after North and South Korea installed what officials said was the first-ever hotline between their top leaders. \nIt also said the North would \"shut down a nuclear test site in the country's northern side to guarantee transparency in suspending nuclear tests.\" \nTo officials and analysts in South Korea, Mr. Kim's decision to shut down his country's only known nuclear test site, in Punggye-ri in northeastern North Korea, and his moratorium on long-range missile tests, are some of the \"trust-building steps\" that they have hoped Mr. Kim would take to help improve the mood for dialogue in Washington. \nMr. Kim spent last year conducting a series of nuclear and intercontinental ballistic missile tests, raising tensions and a risk of war with the United States. But he has initiated a dramatic about-face since January with a sequence of diplomatic maneuvers, including a summit meeting with President Xi Jinping of China in Beijing last month in his first trip abroad as leader, and his invitations to Mr. Moon and Mr. Trump for summit talks. \nAnalysts in the region are deeply divided over Mr. Kim's motives. Some argue that Mr. Kim just wanted to use negotiations to buy time and ease international sanctions, never intending to abandon his nuclear weapons. But others say that Mr. Kim would eventually give up his nuclear arsenal if he were provided with the right incentives, such as security guarantees, like a peace treaty and normalized ties with Washington, and the economic aid he needs to rebuild his economy. \nHis latest announcement came one day after North and South Korea installed what officials said was the first-ever hotline between their top leaders, another sign of improving relations on the divided Korean Peninsula. \nMr. Moon was expected to use the hotline, which was installed in his office, to talk with Mr. Kim before the two leaders hold their summit meeting on the Korean border next Friday. But no date has been set for their first call. \nThe two Koreas have run a telephone hotline at the so-called truce village of Panmunjom — the site for the inter-Korean meeting — for years. Duty officers from both sides man their telephones at Panmunjom daily in case one side calls the other. The line has been cut off at times when bilateral relations have soured, but communications there have been restored. \nBut the two countries have never run a direct hotline linking their top leaders' offices, officials said. \nThe hotline telephones were installed on Mr. Moon's desk in Seoul, the South's capital, and in the State Affairs Commission in Pyongyang, the North's capital. \nWhen Mr. Moon's special envoys met with Mr. Kim in Pyongyang last month, the two Koreas agreed to install the hotline and arrange for Mr. Kim and Mr. Moon to use the phone before their summit meeting. In the same meeting, Mr. Kim said he was willing to negotiate with the United States on abandoning his country's nuclear weapons. \nPresident Trump recently dispatched the C.I.A. director, Mike Pompeo, to meet with Mr. Kim to lay the groundwork for their meeting, which will be the first-ever summit meeting between the two nations. \nSouth Korean officials hope the hotline will improve communications between the top leaders and pave the way for improved ties between the two Koreas. The hotline could also be used to avert unintended armed clashes between the sides, they said. \n\"Now, if working-level talks are deadlocked and if our officials act like arrogant blockheads, President Moon can just call me directly and the problem will be promptly solved,\" Mr. Kim was quoted as telling the visiting South Korean envoys last month. \nOn Friday, aides to Mr. Moon and Mr. Kim officially opened the line and checked the connection for about four minutes, said Youn Kun-young, director for the government situation room at Mr. Moon's presidential Blue House. \nDuring the line check, a South Korean and a North Korean caller briefly discussed the weather, according to Mr. Moon's office. \n\"The connection was very good,\" Mr. Youn said. \"It was as if talking to a neighbor right next door.\" \nMark Landler contributed reporting from Washington, Motoko Rich from Tokyo and Rick Gladstone from New York.",
  "title": "‘We No Longer Need' Nuclear or Missile Tests, North Korean Leader Says. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
