{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "2_LL",
  "text": "Pyongyang also said it plans to close down a former test site. \nNorth Korean dictator Kim Jong Un said the country \"will join international efforts\" to halt \"the nuclear test altogether.\" \nNorth Korean dictator Kim Jong Un said the country \"will join international efforts\" to halt \"the nuclear test altogether.\" \nNorth Korea will suspend its nuclear and missile tests, North Korean state media reported Saturday morning local time. \nThe Korean Central News Agency said that the country was halting nuclear tests and intercontinental ballistic missile launches as of that day, according to The Associated Press. It also plans to close down a nuclear test site in the country's northern region. \nIn a statement published by the state-run Korean Central News Agency, North Korean dictator Kim Jong Un promised to \"never use nuclear weapons\" unless there is a nuclear \"threat or provocation\" to the country. \n\"North Korea's nuclear test center will be discarded in order to ensure the transparency of the suspension of the nuclear test,\" the statement said. \n\"The suspension of nuclear testing is an important process for global nuclear disarmament, and the DPRK will join international efforts and efforts to halt the nuclear test altogether.\" \nPresident Donald Trump commended North Korea's suspension of the tests in a tweet about 7 p.m. Friday EDT, calling it \"very good news.\" \n\"North Korea has agreed to suspend all Nuclear Tests and close up a major test site,\" Trump wrote. \nThe decision comes months after tensions between the Trump administration and North Korea reached historic heights. Trump and Kim taunted each other in an exchange of tweets and official statements as North Korea test-launched several intercontinental ballistic missiles (ICBM). Last year, Trump continually referred to Kim as \"Rocket Man,\" while the dictator described Trump as a \"mentally deranged U.S. dotard.\" \nIn August, North Korea vowed to retaliate against the U.S. \"thousands of times over\" after the United Nations Security Council imposed new sanctions against the country. Shortly after, Trump promised North Korea \"fire and fury like the world has never seen,\" pushing North Korea to threaten Guam, where the U.S. has a major military presence, as a potential target. \nThe threats continued into this year as Trump and Kim argued over which country's nuclear weapons were more powerful. \nTensions between North Korea and the U.S. have eased in recent months, beginning with the Winter Olympics hosted by South Korea in Pyeongchang. North Korean and South Korean athletes marched together holding a unified flag during the Opening Ceremony at the Games. Both countries, engaged in a war for over 60 years, used the event as an opportunity to re-establish dialogue. \nNow Kim is scheduled to meet with South Korean President Moon Jae-in at a summit in the Demilitarized Zone next Friday. This summit would be only the third meeting of its kind between leaders of the two Koreas, according to The Guardian. \nTrump is also expected to meet with Kim in May or early June. He has said that he hoped to discuss denuclearizing North Korea with Kim but warned he would \"respectfully\" walk out of the meeting if they did not. \n\"There's a bright path available to North Korea when it achieves denuclearization in a complete and verifiable and irreversible way,\" Trump said Wednesday. \"It will be a great day for them. It will be a great day for the world.\" \nPyongyang has made significant advancements in its nuclear and missile development programs since Trump took office last year. In July, North Korea test-launched its first ICBM, then tested a second one more than three weeks later. In total, the country fired 23 missiles during 16 tests between February and December 2017, according to a CNN count. \nSome experts believe that the entire continental U.S. is now within those ICBM's striking range. \nAfter meeting with North Korea in March, South Korean officials said that Kim was willing to hold talks with the U.S. about denuclearization and would suspend testing throughout negotiations. \nOn Thursday, President Moon said North Korea has agreed to drop its long-held demand that the U.S. withdraw 28,500 U.S. troops stationed in South Korea as a condition for denuclearization.",
  "title": "North Korea suspends nuclear and missile tests: state media. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
