{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "North Korea's Kim suspends nuclear, missile test AP. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "2_M",
  "text": "North Korean leader Kim Jong Un announced he will suspend nuclear and long-range missile tests and plans to close a nuclear test site. \nThe Korean Central News Agency, which is North Korea's state media agency, made the announcement as the nation's reclusive leader is in ongoing peace talks with South Korean President Moon Jae-in. Kim is also in negotiations to meet with President Trump. \n\"As the weaponisation of nuclear weapons has been verified, it is not necessary for us to conduct any more nuclear tests,\" Kim said at a meeting of the Worker's Party of Korea, adding \"the northern nuclear test site has completed its mission.\" \nSouth and North Korea are discussing plans to announce an official end to the military conflict between the two countries that are still technically at war, the Munhwa Ilbo newspaper reported, citing an unidentified South Korean official.  \nThe Korean Central News Agency said the nation would freeze its nuclear tests and long-range missiles, specifically intercontinental ballistic missiles on April 21. \nThe agency added, \"the North will shut down a nuclear test site in the country's northern side to prove the vow to suspend nuclear test.\" \nAfter the announcement, President Trump posted on Twitter that the move was \"very good news.\" \n\"North Korea has agreed to suspend all Nuclear Tests and close up a major test site,\" he said. \"This is very good news for North Korea and the World - big progress! Look forward to our Summit.\" \nJust days earlier, President Trump expressed a caution about the planned meeting with Kim, explaining he would \"leave the meeting\" if it's not \"fruitful.\" \nWhile exuding confidence about North Korea on Wednesday, Trump also raised the possibility that the yet-to-be scheduled summit might be called off because of a lack of agreement over an agenda — or that it might not be successful. \n\"Hopefully, that meeting will be a great success,\" Trump said. \nFor months, North Korea's missile tests have raised concerns around the world and helped escalate a dangerous slinging of insults between Kim and Trump. \nFriday's announcement of a freeze on tests and the shutdown of a facility is sure to be a step in the right direction but Trump has said he will seek an agreement in which North Korea gives up its nuclear weapons, a goal that many analysts believe will be challenging. \nIt's also unclear whether strings might be attached to the freeze of tests or how long this suspension might really last. \nNorth Korea previously pledged on two occasions that it would abandon its nuclear programs. Both times it backtracked. \nTom Karako, director of the Missile Defense Project at the Center for Strategic and International Studies, told USA TODAY the North likely has a list of demands, some of which might be hard for the U.S. to meet. \nThe North is likely to want the U.S. to curtail joint exercises with South Korea, and to withdraw both its advanced missile defense system and nuclear equipment – including bombers and submarines – from the area, he said. \nCurrently, there are 28,500 U.S. troops in South Korea, a move that followed 1950-53 Korean War that ended with an armistice and not a peace treaty.",
  "title": "North Korea to suspend nuclear missile tests and will close nuke test site. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
