{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "2_RR",
  "text": "Various reports in American and South Korean state media Friday evening indicated that North Korean dictator Kim Jong-un announced the halt of nuclear and missile tests in his country. The reports did not specify whether the tests would conclude permanently. \nThe South Korean newswire service Yonhap reports that the Korean Central News Agency (KCNA) published the announcement from Kim, which read, \"from April 21, North Korea will stop nuclear tests and launches of intercontinental ballistic missiles.\" \n\"The North will shut down a nuclear test site in the country's northern side to prove the vow to suspend nuclear test,\" the announcement concluded.\nNK News, a website focusing on updates from the communist country, reported that Kim told a Workers' Party of Korea (WPK) meeting that there was \"no need\" for such a nuclear program anymore. \nReuters also confirmed the KCNA report. Sputnik, a Russian state site, added the detail North Korea will \"join international efforts to halt nuclear tests altogether,\" according to Kim. \nAt press time, the report does not appear on the aggregator of North Korean media content KCNA Watch (KCNA's website has long ceased to be available in the United States). \nThe announcement follows the debut of a historic direct hotline between Kim and South Korean President Moon Jae-in, who will meet Kim next Friday in the border town of Panmunjom, Kim's first visit to South Korea. The two nations agreed to a live broadcast of the summit, which reports have indicated would focus on the possibility of ending the Korean War – technically still ongoing, despite being at a stalemate – and the \"denuclearization of the Korean peninsula,\" a phrase that some have speculated North Korea will interpret to mean a diminished U.S. presence on the site. Kim reportedly told South Korean officials in a March meeting that denuclearization was father Kim Jong-il's \"dying wish.\" \nNorth Korea remains the world's most prolific human rights abuser, strictly punishing citizens – with death or extended labor camp sentences for attempting to access Western media. Christian North Koreans, or those caught within the vicinity of Bibles, are routinely imprisoned and tortured. North Koreans are forced into a strict caste system known as songbun, in which multiple generations of families can be punished with poverty should any one member be suspected of opposing the Kim regime. \nPresident Donald Trump is preparing to meet Kim in person at a summit in May or early June, according to the White House. No meeting between a U.S. leader and a Kim dynasty dictator has occurred since Kim Il-Sung founded the communist state in 1948.",
  "title": "Reports: North Korean state media announced nuclear program shutdown. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
