{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Polygamist prophet Warren Jeffs charged againJuly 23, 2008. 4 : 49 pm", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "36_10ecbplus", "text": " Among them is FLDS prophet Warren Jeffs, who has already been convicted in Utah on two counts of being an accomplice to the rape of a 14 - year - old girl and is now awaiting trial on similar charges in Arizona.  The FLDS also has followers living in Bountiful, B.C. Bountiful has been the object of scrutiny by the RCMP and the B.C. attorney general since 2004.  A special prosecutor, Terry Robertson, was appointed in June to determine whether charges should be laid.  The Texas grand jury heard evidence collected during the April raid on the Eldorado compound that resulted in more than 400 women and children being taken into protective custody.  They were later allowed to return to the compound after a Texas appeal court ruled that the child protection officials had overstepped their legal boundaries.  The grand jury also heard testimony from at least four FLDS women including prophet Warren Jeffs's 16 - year - old daughter who her father placed into a religious marriage to an older man when she was just 15.  The Texas charge against Jeffs is a first - degree felony count of sexually assaulting an under - aged girl.  The other men - none of whom have yet been named - face charges related to sexual assault of under - aged girls and bigamy.  Jeffs will not be tried in Texas until he goes to court in Arizona.  Matt Smith, the county attorney in Mohave County, Az. said in a press release Wednesday that he had heard about the charges, but \"the indictments in Texas do not affect the Arizona case at all.\"  The Americans have taken a very different approach to the FLDS.  In Utah, Arizona and Texas, the main thrust of the investigation has been the sexual abuse of under - aged girls.  In British Columbia, Attorney - General Wally Oppal has focused his attention mainly on the Criminal Code offence of polygamy.", "title": " Seven indictments, nine charges and six leaders of the Fundamentalist Church of Jesus Christ of Latter Day Saints now face trial in Texas.", "title_page": null, "title_rss": null, "url": " http : / / blogs. vancouversun.com / 2008 / 07 / 23 / polygamist - prophet - warren - jeffs - charged - again /"}