{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Published : Tuesday, Aug. 2 2011 7 : 08 p. m. MDT", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "36_4ecbplus", "text": " Prosecutors Tuesday put on the most shocking evidence yet in the trial of Warren Jeffs, who is charged with sexually assaulting underage girls.  Prosecutors played two audio recordings of Jeffs instructing his 14 - year - old \"spiritual wife\"and several other young women on how to please him sexually, and thus win favor with God.  Jeffs seemed determined to halt the trial, and the judge repeatedly warned him to stop talking and sit down - even threatened to kick him out of his own trial.  Once the jury had headphones and started listening to a recording, Jeffs repeatedly objected, interrupting the recording many times.  On the tape, Jeffs' voice drones on for well over two hours, using Biblical language and sometimes speaking in the voice of God, counseling a number of his plural wives to perform what he calls the \"ordinance of heavenly comfort.\"  He promises they will feel the all - consuming fire of heaven, and by giving comfort to their husband, they will be touching God.  The recordings were part of the mountain of documents seized in a law enforcement raid in 2008.  On the recording, there are many long minutes in which it's hard to make out exactly what's happening.  But it seems to include sounds of fumbling with clothing, sobbing, flushing of toilets.  At one point Jeffs tells the girls or women, \"You have to know how to be excited sexually.  You have to be able to assist each other.\"  It all ends with prayers and supposed revelations from God, and Jeffs himself singing a hymn.  Jeffs, 55, is head of the Utah - based Fundamentalist LDS Church, which believes polygamy brings exaltation in heaven.  He is accused of sexually assaulting two girls, ages 12 and 15, he took as brides in what his church calls \"spiritual marriages.\"  A forensic analyst testified Monday that Jeffs was the father of the 15 - year - old's child.  On Tuesday, prosecutors also played a tape of Jeffs talking to the girl when she was 14, after Texas Ranger Nick Hanna testified about documents and electronic files seized during a 2008 police raid at the church's remote compound in West Texas.  Among the materials recovered during the raid was a record of Jeffs' marriage \"for time and all eternity\"with the 14 - year - old in January 2004.  An excerpt from hundreds of pages of Jeffs' personal journals said the child was \"pure and innocent and willing to obey\"and that he summoned her parents and \"informed them of their girl belonging to me.\"  Followers see Jeffs as a prophet who is God's spokesman on earth.  Hanna read from Jeffs' journals, which said he took the 14 - year - old the night after their wedding with him and another of his new wives on a car ride for \"training.\"  There, he instructed them on their responsibilities as his wives and had the session taped.  The recording was transcribed and placed in church records later seized by police.  Lead prosecutor Eric Nichols played the tape for jurors, who followed along using transcripts.  \"A good wife is trained for her husband and follows the spirit of peace,\" Jeffs is heard saying.  He also makes reference to \"drawing close\"or \"being close,\" which is how church members refer to sex.  Two female voices say \"OK.\"  In describing the session in his journal later, Jeffs said he told his wives they were \"honorable vessels, property of your husband's kingdom and the Kingdom of God on Earth.\"  Jeffs has represented himself since firing his high - powered attorneys last week.  Later, Nichols played a 58 - minute clip of another so - called training session from December 2004, this one involving what he described as 12 \"young\"ladies, including the one from the first recording.  Jeffs stood up and talked over it, rambling about how a holy trust was being broken.  \"I am but a mortal man seeking peace,\" he said.  \"I am not a threat to anyone.  My faith is my only weapon.\"  Prosecutors have promised to play still another recording - this one of Jeffs having sex with the 12 - year - old girl - before resting their case.  Nichols told Walther they would do so at the end of a court session that stretched late into Tuesday night.  Before the recordings, Hanna read excerpts of Jeffs' journal where he described the Lord ordering him to visit Eldorado, Texas, about 45 miles south of San Angelo, and the church purchasing 1, 700 acres of land outside the town for $1. 2 million in 2003.  \"This will only be a place of refuge if it is kept sacred and secret,\" Jeffs wrote, adding that his followers should populate the area and let \"a community grow here more in hiding before the neighbors find out.\"  He told the faithful they could build anything they wanted, thanks to Texas' lax zoning laws, and construction teams working around - the - clock erected more than a dozen buildings, including a sprawling, white - limestone temple.  Texas authorities raided the compound in April 2008 after receiving a call to an abuse hotline that turned out to be a hoax.  More than 400 FLDS children who were placed in protective custody were eventually returned to their families.  But police saw underage girls who were clearly pregnant and found Jeffs' journals and the other documents in a vault at the end of a secret passageway in the temple.  Another vault in an annex building provided still more records and files.  Jeffs and 11 other FLDS men were charged with crimes including sexual assault and bigamy.  So far, all seven who have been prosecuted have been convicted, receiving prison sentences of between six and 75 years.", "title": " Texas jury hears Warren Jeffs sex tapes despite FLDS leader's objections.", "title_page": null, "title_rss": null, "url": " http : / / www. deseretnews.com / article / 700167816 / Texas - jury - hears - Warren - Jeffs - sex - tapes - despite - FLDS - leaders - objections. html? pg=all"}