{"authors": [], "date_download": null, "date_modify": null, "date_publish": " August 9, 2011", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "36_5ecbplus", "text": " Warren Jeffs, leader of the polygamist FLDS religious sect, was sentenced to life in prison in Texas, convicted of sexually assaulting two girls, aged 15 and 12, that he claimed as his 'brides.'  Polygamist sect leader Warren Jeffs was sentenced to life in a Texas prison on Tuesday following his conviction on charges that he sexually assaulted two young girls he claimed as \"brides.\"  The sentencing at state district court in San Angelo brings to a conclusion an often bizarre trial that pitted a self - proclaimed religious prophet against state prosecutors seeking to expose Mr. Jeffs as a pedophile.  After the sentence was announced, Prosecutor Eric Nichols said Jeffs had \"corrupted and perverted\"his position of authority and the religious convictions of his own community to victimize women and children \"to satisfy his own appetites and desires.\"  Prosecutors charged that the 55 - year - old sect leader sexually assaulted two girls, ages 12 and 15, by arranging illegal marriages under the guise of his religious beliefs.  They presented a DNA report that showed that Jeffs had fathered a child with the 15 year old.  Prosecutors also played an audio recording of Jeffs allegedly engaging in sexual intercourse with the 12 - year - old.  The recording was seized when Jeffs was arrested in 2006.  Jeffs is the leader of the Fundamentalist Church of Jesus Christ of Latter - day Saints (FLDS).  The sect is unaffiliated with the mainstream Church of Jesus Christ of Latter - day Saints, also known as the Mormon church.  An estimated 10, 000 FLDS followers live in communities in Utah, Arizona, and Texas.  They believe polygamy is a means to gain divine acceptance.  Jeffs is believed to have 78 wives, 24 of them under age 17, according to prosecutors.  Rather than focus on Jeffs's multiple marriages, prosecutors with the Texas Attorney General's Office presented a case based on alleged violations of the laws of consent in Texas.  Twelve - and 15 - year - old girls are not old enough to consent to engage in sexual activities.  Under Texas law, any sexual activity between an adult and an under - 17 - year - old is a sexual assault even if the minor is a willing participant.  The same activity with an under - 14 - year - old is aggravated sexual assault punishable by up to life in prison.  During the penalty phase of the case, prosecutors played an audio tape of Jeffs allegedly preparing five other young girls to have sex with him.  He encouraged his \"child brides\"to set aside all their inhibitions.  Prosecutors also showed jurors a page from one of Jeffs's personal journals.  The 2005 entry says : \"If the world knew what I was doing, they would hang me from the highest tree.\"  Jeffs became leader of the FLDS upon the death of his father in 2002.  Jeffs claimed the prosecution was a form of persecution targeting his religious beliefs.  Prior to the trial he fired seven lawyers, and ultimately tried to represent himself.  Trial observers said he often paused for long periods of silence before resuming.  At one point, rather than present a closing statement, he stood motionless and silent before the jury.  Jeffs boycotted most of the penalty phase of his trial.  He was represented by stand - by counsel, appointed by Judge Barbara Walther.  The case against Jeffs stemmed from documents recovered in an April 2008 raid on the FDLS compound near Eldorado, Texas.  Prosecutors also introduced evidence seized from a vehicle when Jeffs was arrested as a fugitive in 2006.  At one point he was listed on the FBI's Top Ten Wanted list.  After his arrest, Jeffs stood trial and was convicted in Utah for his role in allegedly arranging marriages among his followers.  He was found guilty, but the conviction was overturned on appeal.  Jeffs was sentenced to life in prison for his assault on the 12 - year - old.  He received a 20 - year sentence for the assault on the 15 - year - old.  The two sentences are to be served consecutively.  In addition to Jeffs, seven other elder members of the FLDS sect have been convicted in Texas trials or pleaded guilty.  They have received sentences ranging from six to 75 years.  Four more FLDS members are awaiting trial.", "title": " Prophet to pedophile : Polygamist Warren Jeffs sentenced to life in prison.", "title_page": null, "title_rss": null, "url": " http : / / www. csmonitor.com / USA / Justice / 2011 / 0809 / Prophet - to - pedophile - Polygamist - Warren - Jeffs - sentenced - to - life - in - prison"}