{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Updated 12 / 2 / 2010 1 : 31 AM  That conviction was overturned in 2007.", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "36_9ecbplus", "text": " Polygamist sect leader Warren Jeffs was quietly extradited from Utah to Texas, where he was arraigned Wednesday to face trial on bigamy and sexual assault charges.  Jeffs, who was indicted more than two years ago, appeared during a brief hearing in San Angelo wearing glasses, orange jail pants and a gray sweat shirt, Texas Attorney General's Office spokesman Jerry Strickland said.  The 54 - year - old Jeffs was not asked to enter a plea and spoke only to tell he judge that he needed more time to find a lawyer, Strickland said.  Texas authorities have charged the ecclesiastical head of the Fundamentalist Church of Jesus Christ of Latter Day Saints with felony bigamy, aggravated sexual assault and assault.  Prosecutors plan to try the charges separately, with the first trial scheduled to begin Jan. 24.  The charges stem from the 2008 raid of the Yearning For Zion Ranch in Eldorado, where authorities seized more than 400 children and placed them in state custody on suspicion that the girls were being sexually abused and the boys were being raised to be sexual predators.  Most of the children were eventually returned to their families, but several men in the sect who see Jeffs as their spiritual leader were charged with child sexual assault and abuse.  On Wednesday, Jeffs was in the same courtroom where several members of his church were convicted.  He was brought to Texas a day earlier from Utah, where he was convicted in a case stemming from the marriage of an underage girl to her cousin.  A phone message left with Jeffs' attorneys in Utah was not returned Wednesday.  Willie Jessop, a spokesman for the church, declined immediate comment.  Jeffs is being held without bond at a jail outside San Angelo in West Texas.  During the hearing, District Judge Barbara Walther read Jeffs the indictment and asked if he understood the charges.  He declined to sign a scheduling order that laid out the dates of his court appearances, Strickland said.  Strickland called the jail choice an issue of \"security.\"  He did not elaborate, but noted that prosecutors were not approaching the case differently because of Jeffs' high profile.  \"When you have sexual assault of a child, it doesn't matter who you are,\" Strickland said.  Utah Department of Corrections spokesman Steve Gehrke said Wednesday that prison officials transported Jeffs to the Salt Lake City airport Tuesday and turned him over to Texas law enforcement.  A Texas Ranger and an officer from the Attorney General's Office went to Utah to pick up Jeffs and flew with him back to Texas, Strickland said.  Jeffs' defense attorneys in Utah had opposed the extradition, arguing that sending Jeffs to Texas before a long - running criminal case in Utah was resolved would deny him the right to a speedy trial.  But the Utah Supreme Court ruled Nov. 23 that it would not block the transfer.  Jeffs had been held at the Utah State Prison since his arrest, and eventual conviction, on two charges of rape as an accomplice for his role in the 2001 marriage of an underage follower - then 14 - to her 19 - year - old cousin.  In July, the Utah Supreme overturned the 2007 convictions.  Prosecutors there have yet to decide whether they'll retry Jeffs.", "title": " Warren Jeffs arraigned in Texas on sex charges.", "title_page": null, "title_rss": null, "url": " http : / / usatoday30. usatoday.com / news / nation / 2010 - 12 - 01 - warren - jeffs - arraigned _ N. htm"}