{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Tom Perez, the chairman of the Democratic Party, during the party's winter meeting in Atlanta last February. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "3_L",
  "text": "The Democratic National Committee opened a surprise legal assault on President Trump on Friday, filing a lawsuit in federal court alleging that the organization was the victim of a conspiracy by Russian officials, the Trump campaign and WikiLeaks to damage Hillary Clinton's presidential run. \nThe 66-page complaint, filed in federal court in New York, uses the publicly known facts of the investigation into Russia's election meddling to accuse Mr. Trump's associates of illegally working with Russian intelligence agents to interfere with the outcome of the election. In the document, the committee accuses Republicans and the Russians of \"an act of previously unimaginable treachery.\" \nThe sweeping lawsuit startled Republicans in Washington as well as Democratic leaders, who were only briefed at the last minute about the D.N.C.'s plans to pursue civil litigation. Tom Perez, the chairman of the Democratic Party, said the committee had alerted Senate Minority Leader Chuck Schumer and House Minority Leader Nancy Pelosi, the top Democrats in Congress, \"when we were about to file.\" \nMr. Trump, in a tweet Friday evening, chided \"obstructionist Democrats\" for filing the complaint and suggested it could backfire if Republicans got access in court to the D.N.C.'s hacked email servers. \nBrad Parscale, the campaign manager for Mr. Trump's 2020 re-election bid, called the D.N.C. allegations a \"sham lawsuit about a bogus Russian collusion claim filed by a desperate, dysfunctional and nearly insolvent Democratic Party.\" \nIn a statement, Mr. Parscale accused Democrats of filing the lawsuit to drum up donations for the party. \"They've sunk to a new low to raise money,\" Mr. Parscale said. \nDenying any financial motivation, Mr. Perez said in an interview that the lawsuit had been taking shape for months, and recalled facing demands as early as the winter of 2017 to file suit against Mr. Trump for allegedly abetting foreign interference in an American election. He said he had instructed the committee to investigate that possibility, eventually engaging a plaintiffs' law firm, Cohen Milstein, to assemble the complaint filed on Friday. \nWhile there are multiple ongoing investigations of Mr. Trump and his campaign, most significantly by the special counsel, Robert S. Mueller III, Mr. Perez said the D.N.C. decided to move ahead with a civil suit because the committee believed there was an ongoing threat of foreign interference in American elections, and it was unclear when Mr. Mueller's investigation might conclude. And certain claims in the lawsuit, he said, face statutory expiration dates. \n\"I don't know when Mueller will finish,\" Mr. Perez said. \"I'm very concerned about the run-up to the midterm elections.\" \nMr. Perez firmly denied that the lawsuit had a political purpose, but he appeared to allude at points to the possibility that civil litigation might bring to light damaging information about Mr. Trump and his associates. \nThe complaint is largely based on information that has been disclosed in news reports and subsequent court proceedings. But if the lawsuit proceeds, the president and his campaign aides could be forced to disclose documents and submit to depositions that require them to answer questions under oath. \nTo reach the discovery stage, lawsuits have to survive any motion to dismiss the litigation by the defendants. \nMr. Perez suggested, for instance, that Mr. Trump's tax returns would reveal \"shady conduct\" if they were ever made public. Asked if part of the lawsuit's aim was to force such disclosures, Mr. Perez demurred: \"I haven't given that any thought.\" \nIn his statement deriding the suit, Mr. Parscale said that if the litigation proceeds, the Trump campaign would use discovery to seek out embarrassing information about Democrats, including Mr. Perez, and their handling of the 2016 presidential election. \n \"There is a great deal the American public wants to know about the corruption of the Democrats,\" Mr. Parscale said. \nWhite House officials and a number of other defendants did not immediately comment on the lawsuit. Roger J. Stone Jr., a former campaign adviser to Mr. Trump who is named as a defendant in the suit, dismissed it in an email as \"a left-wing conspiracy theory dressed up as a lawsuit.\" \nIn a statement forwarded by Mr. Stone, Rob Buschel, Mr. Stone's lawyer, said he had not yet been served with the D.N.C. suit and described it as a \"regurgitation\" of a complaint filed last year by Democrats alleging their privacy was invaded during the campaign. That litigation is still in progress. \nThe Democrats' legal maneuver comes amid a swirl of intensifying scrutiny of Mr. Trump, his associates and their interactions with Russia. The president, who has long denied allegations of collusion, has repeatedly attacked the special counsel investigation this week and has vented angrily about renewed claims by James B. Comey, the former F.B.I. director, that Mr. Trump sought to influence the bureau's review of the election. \nMr. Trump added Rudolph W. Giuliani, the former New York City mayor, and two other lawyers to his legal team this week. And on Thursday night, Mr. Trump thundered on social media that there was \"NO COLLUSION and NO OBSTRUCTION,\" and again branded the whole Russia investigation as a \"witch hunt.\" \nThe D.N.C. complaint is broad in its claims and stark in its language, naming a long list of defendants that includes Mr. Trump; his son, Donald Jr., and son-in-law, Jared Kushner; the Russian government and its intelligence service; and a group of former campaign aides including Mr. Stone, Paul Manafort, Rick Gates and George Papadopoulos. \nThere is substantial overlap between the targets of the D.N.C. lawsuit and the group of people known to be under investigation by Mr. Mueller. Mr. Manafort has been indicted by the special counsel, while Mr. Gates and Mr. Papadopoulos have both pleaded guilty to different charges. \nThe Democrats accused Mr. Trump's campaign of being \"a racketeering enterprise\" that worked with the Russians and WikiLeaks in a conspiracy that included hacking email servers at the D.N.C. and leaking damaging information to the public. The Trump campaign had extensive warnings of the Russians' activities and intentions, the Democrats allege, embraced the meddling of a foreign power. \nThe lawsuit demands monetary damages and a declaration that the defendants conspired to alter the course of the election. \nMr. Perez said that the party had not worked on the lawsuit with Democratic leaders on the intelligence committees in the House and Senate, who are investigating contacts between the Trump campaign and Russia through legislative investigations. \nThe lawsuit is not the first attempt by Democrats to use civil litigation in an effort to open another path toward investigating what happened in 2016 that could be carried out under the oversight of a judge — even if President Trump were to shut down the special counsel's criminal investigation and the congressional oversight probes, run by Republicans, were to fall short. \nLast July, two Democratic donors and a former staffer member filed an invasion of privacy lawsuit against Mr. Trump's campaign and Mr. Stone. It also accused them of conspiring in the release of hacked Democratic emails and files that exposed their personal information to the public. \nThe timing of that earlier filing came just before a one-year statute of limitations for privacy invasion lawsuits was about to expire; WikiLeaks published the first archives of stolen Democratic National Committee emails on July 22, 2016. \nThe privacy invasion case was organized by Protect Democracy, a government watchdog group run by former Obama administration lawyers. \nIn a statement, Protect Democracy on Friday noted that the new D.N.C. lawsuit draws on the same set of underlying facts as the earlier privacy-invasion litigation it brought on behalf of \"three Americans whose personal information was exposed through a conspiracy involving the Trump campaign and Roger Stone.\" It said it only learned about the existence of the D.N.C. lawsuit from press reports on Friday. \nThe nine-month-old privacy invasion lawsuit is much further developed than the D.N.C. case. The judge overseeing it, Ellen S. Huvelle of the Federal District Court for the District of Columbia, an appointee of President Bill Clinton, has scheduled a May 17 hearing on the defendants' motions to dismiss.",
  "title": "Democratic Party alleges Trump-Russia conspiracy in new lawsuit. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
