{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "The party alleged that top officials in Trump's campaign conspired with Russia to hurt Hillary Clinton. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "3_LL",
  "text": "WASHINGTON (Reuters) - The Democratic Party sued the Russian government, U.S. President Donald Trump's campaign and WikiLeaks on Friday, charging that they carried out a wide-ranging conspiracy to influence the 2016 U.S. presidential election. \nIn its federal lawsuit in Manhattan, the Democratic National Committee said that top officials in Trump's campaign conspired with the Russian government and its military spy agency to hurt Democratic presidential nominee Hillary Clinton and tilt the election to Trump by hacking Democratic Party computers. \nThe lawsuit alleged that Trump's campaign \"gleefully welcomed Russia's help\" in the 2016 election and accuses it of being a \"racketeering enterprise\" that worked in tandem with Moscow. \n\"During the 2016 presidential campaign, Russia launched an all-out assault on our democracy and it found a willing and active partner in Donald Trump's campaign,\" said Tom Perez, chair of the DNC. \"This constituted an act of unprecedented treachery.\" \nThe suit prompted Trump to send a Friday evening tweet that called the Democrats \"obstructionist\" and promised a counterattack based on his longstanding assertion that Clinton committed a crime with her personal email server. \n \"This can be good news in that we will now counter for the DNC Server that they refused to give to the FBI, the Wendy Wasserman Schultz Servers and Documents held by the Pakistani mystery man and Clinton Emails,\" Trump, a Republican, wrote. \nTrump appeared to refer to Representative Debbie Wasserman Schultz, who chaired the DNC during the election when its servers were hacked, and a Pakistan-born information technology worker found by the House of Representatives inspector general to have inappropriately accessed congressional data. \nThe campaign operation Trump has already set up ahead of the 2020 president election called the lawsuit frivolous and characterized it as a fundraising effort. \n\"This is a sham lawsuit about a bogus Russian collusion claim filed by a desperate, dysfunctional, and nearly insolvent Democratic Party,\" the campaign's manager, Brad Parscale, said in a statement. \nDefendants in the lawsuit include three people who have been indicted as a result of Special Counsel Robert Mueller's investigation of Russian meddling: former campaign chairman Paul Manafort, Manafort associate Rick Gates and former campaign aide George Papadopoulos. \nAlso named as defendants were Donald Trump Jr., Trump associate Roger Stone and Trump's son-in-law, Jared Kushner. \nTrump has repeatedly denied his campaign colluded with Russia and Moscow has denied meddling in the election. \nFour U.S. intelligence agencies reported last year that Russia sponsored the hacking of Democratic Party groups and other actions during the 2016 campaign. Part of the effort was to benefit Trump over Clinton, the agencies said. \nThe DNC blames Russia for breaches of its computer systems in 2015 and the first half of 2016. \nHackers disseminated internal communications of party officials as the Democratic nominating convention began and WikiLeaks released thousands of emails, some of which were embarrassing for the Clinton campaign and were intended to stoke conflicts among the party's supporters. \nMost of the accusations appeared to be based on news reports and publicly available legal documents and offered little new information about alleged collusion with Moscow. \nDemocrats are keen to remind voters of the issue of Russia and the 2016 election ahead of November's midterm congressional elections. Early polls show Republicans run some risk of losing control of Congress. \n\"The suit gives Democrats a useful and perhaps compelling narrative to counter the president's and Republicans' mantra of ‘no collusion,'\" said Leonard Williams, a political science professor at Manchester University. \"From that partisan standpoint, it is exactly what their candidates and spokespeople need.\" \nWikiLeaks, and attorneys for Trump Jr., Manafort, Gates and Papadopoulos also did not immediately respond to requests for comment. \nStone said the lawsuit was based on \"a left-wing conspiracy theory.\" \n\"NO proof or evidence,\" he wrote in an email to Reuters.\n The lawsuit, should it go forward, seems likely to help keep the spotlight on the issue of Russian election interference and possible collusion by the Trump campaign. Both are being investigated by Mueller, whose office declined to comment on the Democratic lawsuit. \nThrough the process of legal discovery, lawyers for the Democratic Party could force the defendants to produce documents they say relate to the collusion issue. \nThe lawsuit \"might not have any journalistic, judicial, or political staying power,\" Williams said. \n\"Whether it amounts to more than a story to tell remains to be seen,\" he said. \"It might lead to additional discovery of events and relationships that we don't yet know about.\"",
  "title": "Democrats sue Russia and Trump campaign, alleging conspiracy in 2016 election. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
