{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "A major lawsuit from the Democratic National Committee, targeting the Russians, the Trump campaign and Wikileaks for conspiring to help the President win the 2016 election. Veuer's Nick Cardona has that story. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "3_M",
  "text": "WASHINGTON — The Democratic National Committee filed a lawsuit Friday against the Russian government, the Trump campaign and WikiLeaks, alleging they conspired to influence the 2016 election in favor of President Trump. \nThe lawsuit alleges that Russia found a \"willing and active partner\" in the Trump campaign, which shared the goals of hurting the Democratic Party and electing Donald Trump. It says representatives of the three groups remained in contact with each other as the cyberattack was being carried out. \n\"This constituted an act of unprecedented treachery: the campaign of a nominee for President of the United States in league with a hostile foreign power to bolster its own chance to win the presidency,\" DNC Chair Tom Perez said in a statement Friday. \nSeveral U.S. intelligence agencies concluded in a January 2017 report that Russian agents hacked the DNC's computers as part of a broader influence campaign aimed at hurting the campaign of the Democratic presidential nominee, Hillary Clinton. \nThe cyberattack on the DNC's computers was a \"major component of the Russian interference campaign,\" according to the DNC.  In 2015 and 2016, Russian intelligence agents hacked into DNC computer systems, stole DNC documents and emails, and used WikiLeaks and fake personas operated by Russian intelligence to disseminate the stolen materials to voters, the DNC alleges. \n\"They successfully hacked the Democratic Party in 2016 and they will be back,\" Perez said. \"We must prevent future attacks on our democracy, and that's exactly what we're doing today.\" \nTrump's campaign manager Brad Parscale called the lawsuit \"frivolous\" and said the campaign will fight back aggressively, potentially using the discovery process to explore DNC records. That includes funding the DNC reportedly contributed to research the \"dossier\" alleging ties between Trump and Russia, he said. \n“This is a sham lawsuit about a bogus Russian collusion claim filed by a desperate, dysfunctional, and nearly insolvent Democratic Party,” Parscale said in a statement. \"While this lawsuit is frivolous and will be dismissed, if the case goes forward, the DNC has created an opportunity for us to take aggressive discovery into their claims of ‘damages' and uncover their acts of corruption for the American people.\" \nTrump tweeted Friday evening that the lawsuit \"can be good\" because the Trump campaign can now counter sue for more information from the DNC and from former DNC chairwoman Debbie Wasserman Schultz of Florida, whom he incorrectly referred to as \"Wendy Wasserman Schultz.\" There is an American playwright named Wendy Wasserstein. \nResponding on Twitter, Wikileaks said the DNC was seeking publicity with its lawsuit and defended its release of the committee's emails, saying it helped expose the \"DNC rigged its primaries on behalf of Hillary Clinton.\" \nFriday's lawsuit opens another legal challenge to Trump and his allies, who already are contending with special counsel Robert Mueller's investigation of Russian interference in the 2016 presidential election. \nTrump has repeatedly said his campaign did not collude with the Russian government, and he has called investigations into the matter a \"witch hunt.\" \nThe DNC says its lawsuit is based on \"facts, admissions of defendants in multiple criminal proceedings, including their own words, records that have been released in legal filings, the conclusions of the U.S. intelligence community and widely confirmed news reports.\" \nThe cyberattack created chaos throughout the campaign for Democrats, deepening divisions within the party. Supporters of Sen. Bernie Sanders, a Vermont independent who ran in the Democratic presidential primary, were furious over emails that suggested DNC officials were hostile toward his campaign and favored Clinton. The scandal forced the DNC's chairwoman at the time, Rep. Debbie Wasserman Schultz of Florida, to step down from her post. \nThe lawsuit alleges the Russian government notified the Trump campaign in advance that it had stolen Democratic emails and other information about the Democratic Party that it was seeking to use in support of Trump's candidacy. \nRather than report Russia's intentions to interfere with elections, “the Trump campaign and its agents gleefully welcomed Russia's help,” the lawsuit states. \nRussian agents transmitted data to WikiLeaks, which disseminated the information at key moments to boost the Trump campaign, the lawsuit alleges. \nTrump's closest political adviser, Roger Stone, who is named as a defendant, also appeared to have advance knowledge of specific plans by WikiLeaks to disseminate some of this information, the lawsuit alleges. Throughout the campaign, Trump associates remained in contact with individuals closely connected to the Kremlin and Russian intelligence agencies, according to the lawsuit. \nThe lawsuit also names Trump's son, Donald Trump Jr., and his son-in-law, Jared Kushner, as defendants. Other individual defendants include Trump's former campaign manager Paul Manafort, Jr., former campaign adviser George Papadopoulos, and Manafort's business partner, Richard Gates, who have all been charged in Mueller's investigation. \nPapadopoulous and Gates pleaded guilty to making a false statement to a federal agent, and Gates also pleaded guilty to a count of conspiracy against the United States. Manafort has pleaded not guilty. \nThe lawsuit refers to the Trump campaign as a \"racketeering enterprise\" that sought to exploit the DNC's \"trade secrets.\" The lawsuit also cites a federal computer fraud law that allows victims of hacking to pursue damages in civil court. \nNick Ackerman, a former Watergate prosecutor and an expert on computer security issues, said the DNC's move could pose significant legal risks for Trump's allies because it could allow the party to begin “taking depositions and getting documents” to prove their allegations. It also provides another avenue to probe Russian interference in the 2016 election beyond Mueller's investigation. \n“If Mueller were fired, they could continue with this,” Ackerman said of the Democratic Party. “Trump can't pardon anybody in a civil case. He can't stop the civil case.” \n\"It really does give the Democratic National Committee a means to go after people hard and heavy here,\" he added. \nTrump's campaign already is battling another civil lawsuit over hacked emails. In that case, two Democratic donors and a former DNC staffer have argued the release of DNC emails violated their privacy. That case was brought by Protect Democracy, a watchdog group run by a former Obama administration lawyer. \nThe Trump campaign is seeking to dismiss that case, arguing in court filings that it is a “disruptive, politically motivated lawsuit” that threatens to interfere with Trump's presidential duties and with Mueller's ongoing criminal investigation. A hearing on the Trump campaign's motion to toss out the Protect Democracy lawsuit is set for next month.",
  "title": "Democratic Party sues Russia, the Trump campaign and WikiLeaks, alleging conspiracy to influence the 2016 election. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
