{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "DNC files lawsuit over election interference. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "3_R",
  "text": "The Democratic Party on Friday filed a multimillion-dollar federal lawsuit against Trump campaign officials, the Russian government and WikiLeaks alleging a widespread conspiracy to tilt the 2016 election in Donald Trump's favor. \nCalling it an \"all-out assault on our democracy,\" the Democratic National Committee filed the civil suit in federal district court in Manhattan. The suit amounts to another legal broadside related to the 2016 race, on top of the special counsel's ongoing Russia probe and the FBI raid on Trump's personal attorney last week. \n\"The conspiracy constituted an act of previously unimaginable treachery: the campaign of the presidential nominee of a major party in league with a hostile foreign power to bolster its own chance to win the Presidency,\" the suit states. \nPresident Trump fired back hours later via Twitter, calling the suit \"good news.\" \n\"Just heard the Campaign was sued by the Obstructionist Democrats,\" he tweeted. \"This can be good news in that we will now counter for the DNC Server that they refused to give to the FBI, the Debbie Wasserman Schultz Servers and Documents held by the Pakistani mystery man and Clinton Emails.\" \n'During the 2016 presidential campaign, Russia launched an all-out assault on our democracy, and it found a willing and active partner in Donald Trump's campaign.'\nThe new suit claims that Trump campaign officials worked in tandem with the Russian government and its military spy agency to bring down Hillary Clinton by hacking into the computer networks of the DNC and spreading stolen material. \n\"During the 2016 presidential campaign, Russia launched an all-out assault on our democracy, and it found a willing and active partner in Donald Trump's campaign,\" said DNC Chairman Tom Perez in a statement, calling the alleged collusion \"an act of unprecedented treachery.\" \nThe suit names several Trump campaign aides who met with Russian nationals during the campaign, including son-in-law Jared Kushner, campaign chair Paul Manafort and campaign deputy Rick Gates. \n\"In the Trump campaign, Russia found a willing and active partner,\" the suit claims. \"In 2016, individuals tied to the Kremlin notified the Trump campaign that Russia intended to interfere with our democracy. Through multiple meetings, emails, and other communications, these Russian agents made clear that their government supported Trump and was prepared to use stolen emails and other information to damage his opponent and the Democratic Party.\" \nGates and Manafort have both been charged in special counsel Robert Mueller's investigation into Russian interference in the 2016 election. \nThe suit also claims Wikileaks founder Julian Assange \"shared the defendants' common goal of damaging the Democratic Party in advance of the election.\" The suit states Russia, using WikiLeaks, would disseminate information stolen from the DNC \"at times when it would best suit the Trump campaign.\" \nBrad Parscale, campaign manager of Donald J. Trump for President, Inc., slammed the suit as \"frivolous\" and predicted it would eventually be dismissed. \n\"This is a sham lawsuit about a bogus Russian collusion claim filed by a desperate, dysfunctional, and nearly insolvent Democratic Party,\" Parscale said in a written statement. \"With the Democrats' conspiracy theories against the President's campaign evaporating as quickly as the failing DNC's fundraising, they've sunk to a new low to raise money, especially among small donors who have abandoned them.\" \nTrump has strongly – and repeatedly – denied colluding with the Russians. \nWhile the FBI recently raided Trump's personal attorney Michael Cohen's home, office and hotel room to seize a collection of documents, a source said Deputy Attorney General Rod Rosenstein assured that Trump was not a target of that probe. \nTrump's legal team, meanwhile, is expanding with the addition of former federal prosecutor and New York mayor Rudy Giuliani, who is vowing to seek a swift resolution to the special counsel probe. \nAs for the latest court action, suing a foreign country could be difficult for Democrats because typically, other nations have immunity from most U.S. lawsuits. However, the suit argues that Russia shouldn't be entitled to sovereign immunity because the \"DNC claims arise out of Russia's trespass on to the DNC's private servers … in order to steal trade secrets and commit economic espionage.\" \nThe Democratic Party used a similar tactic during the Watergate scandal in 1972. The DNC sued former President Richard Nixon's reelection committee for $1 million in damages for the bungled burglary at the Democratic headquarters in the Watergate building.\nFormer DNC chair Lawrence O'Brien reached a $750,000 settlement from the Nixon campaign on the day Nixon left office.",
  "title": "Democratic Party files suit alleging conspiracy by Trump campaign, Russia, WikiLeaks to sway 2016 election. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
