{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "3_RR",
  "text": "The Democratic National Committee is suing the Russian government, the Trump campaign, and WikiLeaks for allegedly disrupting the 2016 campaign, in what appears to be a desperate attempt to keep a collusion narrative going ahead of November mid-term elections. \nThe multi-million dollar lawsuit comes just one week after Deputy Attorney General Rod Rosenstein reportedly told President Trump he is not the target of either the special counsel's Russian meddling and collusion probe, or the target of the investigation into his personal attorney Michael D. Cohen. \nAccording to the Washington Post, who first reported the DNC's lawsuit, it does not name Trump as a defendant, but alleges that various Russian contacts with the campaign amounted to collusion — a theory pushed by Rep. Adam Schiff (D-CA) for months. \nIn addition, former FBI Director James Comey's new book — which was highly anticipated in light of allegations of obstruction of justice — has not yielded the smoking gun Trump critics had hoped for. \n\"I have one perspective on the behavior I saw, which while disturbing and violating basic norms of ethical leadership, may fall short of being illegal,\" Comey wrote in his book. \nHowever, the DNC could be hoping that the lawsuit will invigorate the Russian collusion theory, helping to raise funds ahead of the election. Democrats for months have been soliciting donations based off of the Mueller probe. \nThe DNC is alleging, in a complaint filed in federal district court in Manhattan, that top Trump campaign officials \"conspired\" with the Russian government and its military spy agency to hurt Hillary Clinton and help Trump, but hacking the email servers of the Democratic National Committee and disseminating them, according to the Post. \nDNC Chairman Tom Perez said in a statement: \"During the 2016 presidential campaign, Russia launched an all-out assault on our democracy, and it found a willing and active partner in Donald Trump's campaign.\" \n\"This constituted an act of unprecedented treachery: the campaign of a nominee for President of the United States in league with a hostile foreign power to bolster its own chance to win the presidency,\" he said. \nThe DNC argues that the cyberattack undermined its ability to communicate with voters, collect donations and operate effectively as its employees faced personal harassment and death threats. \nThe Post noted that suing Russia presents legal challenges, since other nations have immunity from most U.S. lawsuits. The suit reportedly seeks an acknowledgment from the defendants that they conspired to infiltrate Democrats' computers, steal information, and disseminate it to influence the 2016 election — essentially, the Democrats' core collusion claims. \nThe lawsuit is targeting president's son, Donald Trump Jr., son-in-law Jared Kushner, his campaign chairman Paul Manafort and Manafort's deputy, Rick Gates, Trump confidant Roger Stone, former Trump campaign volunteer George Papadopoulos.",
  "title": "DESPERATION: DNC files multi-million dollar lawsuit against Russia, Trump campaign for collusion. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
