{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "0_L",
  "text": "WEST PALM BEACH, Fla. — President Trump dispatched the C.I.A. director Mike Pompeo to North Korea to meet with its leader, Kim Jong-un, in recent weeks to lay the groundwork for a summit meeting between Mr. Kim and Mr. Trump, two people briefed on the secret trip said on Tuesday. \nMr. Trump alluded to Mr. Pompeo's mission when he said on Tuesday afternoon that the United States was in direct talks with North Korea at \"extremely high levels,\" and that the White House was looking at five sites for a potential meeting of the two leaders. \nThe White House has used intelligence, rather than diplomatic channels, to communicate with North Korea, ever since last month, when Mr. Trump unexpectedly accepted Mr. Kim's invitation to meet. \nMr. Pompeo, who is awaiting confirmation as secretary of state, has been dealing with North Korean representatives through a channel that runs between the C.I.A. and its North Korean counterpart, the Reconnaissance General Bureau, according to other officials. And he has been in close touch with the director of South Korea's National Intelligence Service, Suh Hoon, who American officials said brokered Mr. Kim's invitation to Mr. Trump. \nOn Tuesday, Mr. Trump also said he would give his blessing to North and South Korea to \"discuss the end of the war\" when the leaders of those countries meet this month, opening the door to a peace treaty that would replace the armistice that halted the Korean War in 1953. \nHis statements, which came as he welcomed Prime Minister Shinzo Abe of Japan to his oceanfront estate here, were fresh evidence of a diplomatic thaw underway on the Korean Peninsula, and made a once-unthinkable encounter between him and Mr. Kim far more likely. \nThe president did not specify who in his administration was talking to North Korea, nor did he give any hint of the sites under consideration — adding to the aura of mystery that has enveloped this potential meeting. The Washington Post first reported Mr. Pompeo's trip, which took place over Easter. \nBut his comments could raise other thorny issues. A peace treaty with North Korea would greatly increase pressure to ease economic sanctions on the North and to withdraw American troops from the Korean Peninsula. It would also complicate the already tangled diplomacy in East Asia. \nIn his meeting with Mr. Abe, however, Mr. Trump projected optimism. He described North Korea in language worlds away from the speech he gave in November in Seoul, when he called it cruel and barbaric, \"the results of a tragic experiment in a laboratory of history.\" \n\"I really believe there's a lot of good will,\" Mr. Trump said. \"They do respect us. We are respectful of them.\" \nHe even suggested that the North and the South might announce some kind of deal before he met Mr. Kim. \nOn Tuesday, a South Korean newspaper, Munhwa Ilbo, reported that the two countries were negotiating an announcement \"to ease military tensions and end a military confrontation,\" as part of the summit meeting planned between Mr. Kim and President Moon Jae-in of South Korea. \nThat could involve pulling troops out of the Demilitarized Zone, making it a genuinely \"Demilitarized Zone.\" A South Korean government official later played down the report, saying it was too soon to tell what a joint statement by Mr. Moon and Mr. Kim would contain, other than broad and \"abstract\" statements about the need for North Korea to \"denuclearize.\" \nBut analysts said South Korea was aiming for a comprehensive deal, in which the North agreed to give up its weapons in return for a security guarantee, including a peace treaty. Mr. Trump's comments suggested he backed that effort. \n\"They do have my blessing to discuss the end of the war,\" he said. \"People don't realize that the Korean War has not ended. It's going on right now. And they are discussing an end to war. Subject to a deal, they have my blessing.\" \nWhile Mr. Abe lavished praise on Mr. Trump for the sanctions campaign, which he said had brought North Korea to the table, he did not repeat the president's words about an end to the Korean War. \n\"Donald,\" he said, \"you've demonstrated your unwavering determination in addressing the challenge of North Korea.\" \nMr. Abe said only that he hoped that the talks with Mr. Kim would force the North to address the threats posed by its nuclear and missile programs, as well as its abduction of Japanese citizens — a politically resonant issue in Japan that Mr. Trump promised to raise with Mr. Kim. \n\"Abe put on a surprisingly brave face,\" said Michael J. Green, a senior vice president at the Center for Strategic and International Studies who advised President George W. Bush on North Korea. \"The president of the United States just endorsed a peace treaty with North Korea, a declared nuclear weapons state, and they offered nothing in return.\" \nChina, which is a signer to the 1953 armistice, has long favored a peace treaty. But Japan, which did not sign it, is suspicious of one — as are some foreign policy experts in the United States, who point out that the North has yet to take any tangible steps to give up its nuclear arsenal. \nThe idea of a peace treaty is not new. The United States and North Korea discussed it in the 1990s and again in 2005. But it has never gone anywhere, largely because North Korea has reneged on pledges to give up its nuclear program. \nMost scholars and officials agree that North and South Korea cannot themselves announce an end to the Korean War. It has to involve the United States and China as well, since both were signers to the armistice. \nIn welcoming Mr. Abe to his estate, Mar-a-Lago, for two days of meetings, Mr. Trump clearly hoped to change the subject from tampered documents, confiscated legal files and other symbols of the political storm clouds that hover over both leaders back home. \nAfter days of ominous reports about his personal lawyer, Michael D. Cohen, and unflattering descriptions in a new book by James B. Comey, the F.B.I. director he ousted, Mr. Trump appeared to savor the prospect of discussing trade and the nuclear threat from North Korea with Mr. Abe, whom he described in Twitter as a \"truly fine gentleman.\" \nThe stakes are even higher for Mr. Abe, whose political survival is in doubt after two domestic scandals have sapped his approval ratings and raised questions about whether he will be forced to resign. \nMr. Abe has invested heavily in his relationship with Mr. Trump, whom he first visited at Trump Tower even before he was sworn in. Preserving that relationship, in the face of fresh challenges in trade and from North Korea, could affect Mr. Abe's standing in Japan. \nThe White House sought to put a good face on the meeting, describing Japan as a great ally of the United States and Mr. Abe as a friend of Mr. Trump. But officials acknowledged there would be differences over trade, with Mr. Trump pushing for a trade deal between the two countries and Mr. Abe stung by Mr. Trump's decision not to exempt Japan, like other American allies, from sweeping tariffs on steel exports. \n\"We have certain disagreements with respect to some of the trading issues,\" Larry Kudlow, Mr. Trump's chief economic adviser, told reporters before the meeting. \"We'll iron those out, hopefully.\" \nMr. Kudlow said he expected Mr. Abe to petition Mr. Trump to grant Japan an exemption, but declined to predict how he would respond. He also tamped down expectations about the United States rejoining the Trans-Pacific Partnership, the Asian trade pact, now anchored by Japan, which Mr. Trump pulled out of during his first week in office. \n\"We are in the pre-preliminary stages of any discussions,\" he said. \"It's more of a thought than a policy.\" \nHaving met six times — including once before at Mar-a-Lago — and spoken by phone 20 times, Mr. Trump and Mr. Abe were likely to talk about the issues dogging them at home, officials said. But American officials said they did not believe that would dominate their discussions. \n\"It's all part and parcel of the relationship,\" said Matthew Pottinger, the senior director for Asia at the National Security Council. \"Sometimes they talk about the respective politics in each other's countries. They enjoy talking about it.\"",
  "title": "",
  "title_page": null,
  "title_rss": null,
  "url": null
}
