{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Donald Trump is planning to meet with the North Korean leader in the coming months. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "0_LL",
  "text": "Central Intelligence Agency Director Mike Pompeo met with North Korean leader Kim Jong Un over Easter weekend, according to media reports Tuesday. \nPompeo reportedly made the secret visit to North Korea to prepare for direct talks between U.S. President Donald Trump and Kim, who plan to discuss Pyongyang's nuclear program. News of the meeting comes just days after the CIA chief told senators he was encouraged that such talks would be productive. \nTrump has nominated Pompeo to become the next U.S. secretary of state. \"I'm optimistic that the United States government can set the conditions for that appropriately,\" Pompeo told the Senate Foreign Relations Committee during his confirmation hearing last week, noting that such talks could achieve an outcome \"America and the world so desperately need.\" \nThe tension between the U.S. and North Korea has thawed somewhat in recent months after Pyongyang signaled its willingness to negotiate with the United States and South Korea. Envoys from the South traveled to Pyongyang in March with the aim of forging a dialogue with the U.S. \nThe White House has said the talks are supposed to take place in May or early June. \nTrump told reporters on Tuesday that five locations were being considered for the summit, but that none of them were in the United States, according to CNN. The president, sitting next to Japanese Prime Minister Shinzo Abe, said he believed \"there's a lot of goodwill\" going into the meeting. \n\"We'll see what happens, as I always say,\" Trump noted. \"Because ultimately, it's the end result that counts.\" \nKim has repeatedly expressed willingness to denuclearize the North, a longstanding condition U.S. diplomats have said must be on the table for any negotiations to begin. \nBut experts are skeptical that the country would easily give up its nuclear weapon program. \n\"It's a nice thing to say, but it can't happen outside of a comprehensive settlement that ensures the Kim family's rule in perpetuity,\" Jeffrey Lewis, the director of the East Asia nonproliferation program at the Middlebury Institute, wrote in The New York Times last month. \"Rather than agreeing to disarm, Mr. Kim is saying he is willing to engage in a process, headed toward an ambiguous goal.\" \nThe Times reported Tuesday that Kim was preparing to formally announce such plans during his upcoming meeting on April 27 with South Korean President Moon Jae-in. \nKim also met in secret with China's Xi Jinping last month in his first trip abroad since assuming power. The meeting came at the behest of Xi, and afterward, Kim said he hoped to \"develop friendship\" with the Chinese. \nThis story has been updated to note that Trump confirmed reports of the meeting in a tweet Wednesday morning.",
  "title": "CIA Director Mike Pompeo secretly met with North Korean leader Kim Jong Un. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}