{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "President Donald Trump says conversations between North and South Korea to end their decades-long war have his blessing. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "0_M",
  "text": "PALM BEACH, Fla. — President Trump began meetings with the leader of Japan on Tuesday by saying he supports talks by North and South Korea to formally end a state of war that has lasted more than six decades. \n\"They do have my blessing to discuss the end of the war,\" Trump said after welcoming Japanese Prime Minister Shinzo Abe to his Mar-a-Lago estate for talks that center on trade as well as efforts to end North Korea's nuclear weapons program. \nThe president also disclosed that, amid planning for a one-on-one meeting with North Korea leader Kim Jong Un, \"we have had direct talks at very high levels, extremely high levels, with North Korea.\" Aides said Trump himself has not spoken with Kim; The Washington Post reported that CIA director and secretary of State-designate Mike Pompeo made a top-secret visit to North Korea over Easter weekend to speak with Kim. \nWith Abe at his side, Trump repeated that he plans to meet with Kim — perhaps in early June — but raised the possibility the summit might be called off because of a lack of agreement over an agenda. \n\"It's possible things won't go well and we won't have the meetings, and we'll just continue to go on this very strong path we have taken,\" said Trump, who lobbied China and other countries to cut off economic assistance to North Korea until it gives up nuclear weapons. \nTrump said officials are reviewing \"five locations\" as possible meeting sites, but he did not name them. \nThe Trump-Abe summit began hours after reports that North and South Korea are negotiating a statement to formally end the war that began in 1950; the two nations ended that conflict with a truce in 1953, and have technically been at war in the decades since. \nTrump also took credit for improved relations, including North Korea's participation n this year's Winter Olympics in South Korea: \"Without us and without me in particular, I guess, they wouldn't be discussing anything and the Olympics would have been a failure.\" \nNorth Korea's nuclear weapons program is a prime topic of Trump's meetings with his Japanese counterpart. \nAbe arrived at Mar-a-Lago seeking an exemption to U.S. tariffs on steel and aluminum, and assurances that the president will take Japanese security into account when and if he meets with Kim. Abe is also losing political support at home over an investigation into questionable land sales. \n\"I am going to have an in-depth discussion with Donald,\" Abe said before their initial meeting. \nIn welcoming Abe to what called the \"the southern White House\" in Florida, Trump said he gets along well with the prime minister and, after the two-day summit, \"we're going to get along even better.\" \nJapanese officials are worried that Trump may use his meeting with Kim to strike a deal to destroy only inter-continental missiles that could reach the United States. North Korea also has shorter range missiles that threaten countries in the region, and Japan wants them destroyed as well. \nAbe is also looking for more U.S. support of his government's efforts to find and rescue Japanese kidnap victims believed to be held in North Korea. \nMatthew Pottinger, senior director for Asian affairs for Trump's National Security Council, said Trump would challenge \"the full range of threats that North Korea poses\" during any meeting with Kim. The goal, he said, is \"the permanent denuclearization of North Korea.\" \nTrade is another Japanese concern; Abe's government fears that Trump's \"America First\" policy will reduce trade between the two nations, or at least make it more costly. \nAfter Trump announced tariffs on steel and aluminum imports earlier this year, his administration granted exceptions to a number of allies — but not Japan. \nTrump expects Abe to ask for an exemption at the Mar-a-Lago summit, said Larry Kudlow, director of Trump's National Economic Council. He would not predict whether Trump would grant the request. \nJapan applauded news last week that Trump asked aides to look at the possibility of re-entering talks on the Trans-Pacific Partnership, or TPP, a massive trading bloc of countries that includes Japan. \nBut Trump later downplayed the directive, saying he would have the United States join TPP only if it becomes a \"substantially better\" deal for Americans. \n\"We already have bilateral deals with six of the eleven nations in TPP, and are working to make a deal with the biggest of those nations, Japan, who has hit us hard on trade for years!\" Trump said in a tweet. \nKudlow said the U.S. re-review of TPP negotiations is in the \"pre-preliminary stages,\" and \"I can't say what we'll do; it's way too early.\" \nJapan is worried it will be caught in the middle of a trade war between the United States and China; each has threatened the other with tariffs on their exports, actions that would raise prices and affecting trading arrangements around the globe. \nAbe also has personal worries; he and his government are under investigation over land sales at discounted prices to political supporters, and possible destruction of evidence. Demonstrators gathered in Tokyo last week to call for Abe's resignation, and a recent poll put the prime minister's approval rating at less than 30%. \nTrump may have sympathy for Abe's domestic troubles. His administration remains under investigation over possible campaign links to Russians who sought to influence the 2016 election. Special Counsel Robert Mueller is also investigating whether Trump sought to obstruct justice in the probe. \nKristi Govella, an assistant professor with the Asian Studies Program at the University of Hawaii at Manoa, said Abe arrived at Mar-a-Lago \"hoping to combat perceptions that Japan has been sidelined in recent weeks and reestablish his country as an important partner of the United States.\" \nThis is the third Trump-Abe summit, including a previous one at Mar-a-Lago in February of last year. Trump visited Tokyo as part of an Asia tour in November. Both of those summits featured rounds of golf for the leaders, and they may hit the links again on Wednesday. \n\"We're going to sneak out tomorrow and play a round of golf, if possible,\" Trump said. \nIn a paper previewing the visit, the Washington-based Center for Strategic & International Studies said that \"bonhomie on the golf course will generate good optics, but Abe wants to return home with concrete evidence that the relationship has stayed out of the rough. The stakes are high for Abe's foreign policy agenda and potentially his political future.\"",
  "title": "Mike Pompeo, Trump's secretary of State pick, made top-secret visit to North Korea, report says",
  "title_page": null,
  "title_rss": null,
  "url": null
}
