{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "0_R",
  "text": "The Washington Post reports the CIA director met with the North Korean leader over Easter Weekend; chief White House correspondent John Roberts reports from West Palm Beach, Florida. \nCIA Director Mike Pompeo met with North Korean dictator Kim Jong Un over Easter weekend in an effort to lay the groundwork for a summit between Kim and President Trump, Fox News has confirmed. \nPompeo's trip, which was first reported by The Washington Post, came to light hours after Trump told reporters that the U.S. and North Korea are holding direct talks at \"extremely high levels\" in preparation for what would be an extraordinary meeting following months of heated rhetoric over Pyongyang's nuclear weapons program. \nThough the White House did not initially comment on the reports, Trump acknowledged the meeting in a Wednesday morning tweet, saying it went well. \n\"Mike Pompeo met with Kim Jong Un in North Korea last week. Meeting went very smoothly and a good relationship was formed. Details of Summit are being worked out now. Denuclearization will be a great thing for World, but also for North Korea!\" he tweeted. \nMike Pompeo met with Kim Jong Un in North Korea last week. Meeting went very smoothly and a good relationship was formed. Details of Summit are being worked out now. Denuclearization will be a great thing for World, but also for North Korea! \nTrump, who welcomed Japanese Prime Minister Shinzo Abe to his Florida resort Tuesday, said five locations for the potential summit are under consideration. The president would not disclose the sites but said the U.S. was not among them. \nPresident Trump addresses the media as he met with Japanese Prime Minister Shinzo Abe at his Mar-a-Lago estate. \n\"We'll either have a very good meeting or we won't have a good meeting,\" Trump told reporters. \"And maybe we won't even have a meeting at all, depending on what's going in. But I think that there's a great chance to solve a world problem.\" \nThe president did not answer shouted questions about whether he has spoken with Kim. \nKim's offer for a summit was initially conveyed to Trump by South Korea last month, and the president shocked many when it was announced that he had accepted. U.S. officials have indicated over the past two weeks that North Korea's government has communicated directly with Washington that it is ready to discuss its nuclear weapons program. \nSeoul and Pyongyang have officially remained at war since the 1953 Korean Armistice Agreement; chief White House correspondent John Roberts reports from West Palm Beach, Florida. \nAbe, who has voiced fears that short- and medium-range missiles that pose a threat to Japan might not be part of the U.S. negotiations, praised Trump on Tuesday for his bravery in agreeing to meet with the North Korean dictator. \n\"I'd like to commend Donald's courage in his decision to have the upcoming summit meeting with the North Korean leader,\" Abe said. \nTrump also confirmed that North and South Korea are working to negotiate an end to hostilities before next week's meeting between Kim and South Korean President Moon Jae In. The meeting will be the third inter-Korean summit since the Koreas' 1945 division. \nNorth Korea has long sought a peace treaty with the U.S. to formally end the 1950-53 Korean War. But it is unusual for the North to seek to broach the issue directly with South Korea rather than with Washington. The armistice that ended the fighting was signed by the United Nations Command — the U.S.-led forces in the conflict — North Korea and China. South Korea was a member of the U.N. Command but was not a direct signatory. \nTrump said Tuesday that the two Koreas \"have my blessing to discuss the end of the war.\"",
  "title": "Report: Mike Pompeo met with Kim Jong Un",
  "title_page": null,
  "title_rss": null,
  "url": null
}
