{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "5_L",
  "text": "President Barack Obama and his wife, Michelle Obama, with Queen Elizabeth II and Prince Philip in London on a state visit to Britain in 2011. \nBut Mr. Trump most likely will not get the honors of a traditional state visit, a highly ceremonial and very British affair, when he arrives on July 13. \nHere is what he can expect. \nWhat will be missing? \nInvitations for state visits, extended by Queen Elizabeth II on the advice of the government, are rare, honorific and convey a strong relationship between Britain and the country of the visiting foreign leader. \nBut just how different in substance such visits are from working or official visits is less obvious. \nA state visit is a firmly structured event over four days, including talks, pageants, a banquet and a visit outside London. A working visit does not include the pomp, but still features most of the rest, in a more flexible way. (The schedule of a state visit would make it difficult to find time for a golfing stopover in Scotland, for example.) \n\"The distinction between a working visit and a state visit is increasingly lost, apart from the ceremonial aspects,\" Peter Westmacott, former British ambassador to the United States, said by phone on Friday. \nMr. Trump will most likely not miss out on much. Even if he doesn't get the full pageantry (riding through central London in a gilded carriage or dining at a state banquet in Buckingham Palace), he is expected to shake hands with Prime Minister Theresa May and to meet the queen. \nQueen Elizabeth II greetin President Nicolae Ceausescu of Romania at the start of his state visit, the first to be made by a Communist head of state, in 1978. \nWhich leaders got a state visit? \nMrs. May's invitation to Mr. Trump, in January last year, prompted memories of controversial figures who had been invited in the past and the way Britain wielded its fading world power through pomp and ceremony. \nThe queen has hosted more than 100 heads of state since she succeeded her father on the throne, in 1952. On the list are foreign royals like King Abdullah of Saudi Arabia, former dictators like Nicolae Ceausescu of Romania and presidents like Michael D. Higgins, the first Irish head of state to travel on a state visit to London. \n\"We got Nicolas Sarkozy to the U.K. for a state visit less than a year after he became president of France, and that was unusual,\" Mr. Westmacott said. \"It wasn't because the U.K. wanted anything in particular from him; it was rather that France is our closest, most important neighbor, and we would normally try and get a state visit for such an important figure into the diary as soon as possible.\" \n\"State visits are quite personal,\" he added, \"and it's often the case that the earlier you arrange one, the greater the impact it has.\" \nBut only two American presidents have been to Britain on a state visit: George W. Bush, in 2003; and Barack Obama, in 2011. As part of a triumphant tour of Europe in 1961, President John F. Kennedy traveled to London, but was not granted the pomp of a state visit. Mr. Kennedy and his wife, Jacqueline, had a private dinner with the queen. \n\"The reason why we don't often get a full-blown state visit by a president of the United States, I think, is that it's four days, and it's often hard for the leader of the free world to spend that much time away in a single country,\" Mr. Westmacott said. \nA protest in London last year against the proposed state visit to Britain of President Trump. \nSome Britons plan to protest in the streets. \nThe announcement of Mr. Trump's visit received mixed reactions from British politicians and the public. Britain's foreign secretary, Boris Johnson, used Mr. Trump's erratically capitalized tweet format to convey his excitement over welcoming the American president: \"Looking forward to seeing our closest ally and friend on the GREATest visit ever,\" he wrote on Twitter. \nNigel Evans, a Conservative member of Parliament, also welcomed the visit, calling it \"superb news\" that will strengthen the relationship between Britain and the United States. \nThe mayor of London, Sadiq Khan warned that the American president could face protests if he visited the capital. \nPoliticians and anti-Trump campaigners across Britain are mobilizing online to stage mass protests during Mr. Trump's planned visit. A Facebook event for the protest has already amassed more than 100,000 supporters. \n\"When Donald Trump arrives on these shores, we and thousands of our supporters will very definitely be making our voices heard,\" Kate Allen, Amnesty International U.K.'s director, said in an interview with BBC Radio Kent. \nSome of Mr. Trump's critics have said that the president canceled a previous working visit planned for earlier this year because of his concerns over protests. At the time, Mr. Trump said he canceled the trip — originally planned for the opening of the new United States Embassy — because he considered the building's relocation a \"bad deal\" made under the Obama administration. \nPresident Trump and Prime Minister Theresa May of Britain at the White House in 2017. She was the first foreign leader to make an official visit after his inauguration. \nWhat's in it for Britain? \nMrs. May was the first foreign leader to visit the White House after Mr. Trump took office. For the British prime minister, relations with Washington are particularly important given that Britain is scheduled to leave the European Union next year. \nMrs. May hopes to strike a free-trade deal with the United States once it has quit Europe's tariff-free trading area. \nAside from commercial interests, Britons pride themselves on their \"special relationship\" with Washington, and British officials see their country as America's closest security and intelligence partner. \nBut having promoted the idea of a state visit for Mr. Trump, Mrs. May has put that idea on ice in the face of widespread public and political opposition. Online petitions against the visit received hundreds of thousands of signatures and prompted a lively debate in Parliament, in which Mr. Trump's character and his fitness as a state guest were discussed. \nMrs. May, meanwhile, has had to watch as the French president, Emmanuel Macron, has forged unexpectedly warm ties with Mr. Trump. \nSo Mr. Trump's visit to Britain provides an opportunity for Mrs. May to prove that she retains a healthy and close-working relationship with the president, despite recent tensions.",
  "title": "President Trump is coming to Britain. Here's what he can expect. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
