{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "The US President will 'definitely be coming to London'. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "5_LL",
  "text": "Donald Trump will visit London in July despite the threat of protests, the US ambassador to the UK has insisted. \nDespite the threat of widespread protests, the US ambassador Woody Johnson confirmed Trump would \"definitely be coming to London\". He told LBC radio on Friday: \"He's very thick-skinned. He knows what he wants to do and he speaks in a very clear and unusual way from most politicians. \nThe US President had been warned by London's mayor, Sadiq Khan, that he should expect to see demonstrators during his \"working visit\" to the UK on July 13. \nJohnson told radio host Nick Ferrari it would be \"all hands on deck\" as preparations are made for the visit. He said: \"He will definitely be coming to London.\" \nReports suggest Trump will meet the Queen during the visit. \nDowning Street confirmed on Thursday that Theresa May would hold bi-lateral talks with Trump and that further details will be \"set out in due course\". \nTrump's visit will fall short of the full-blown \"state visit\", which sparked outrage when it was suggested last year. \nAs long-threatened mass demonstrations began to be organised and politicians stated they would join in, London mayor Khan tweeted: \"If he comes to London, President Trump will experience an open and diverse city that has always chosen unity over division and hope over fear. \n\"He will also no doubt see that Londoners hold their liberal values of freedom of speech very dear.\" \nThe announcement of Trump's trip comes after the president was offered a \"state visit\" to Britain after he was elected, which prompted a huge backlash and questions over whether it would actually happen. \nHis statements, particularly the pledge to ban Muslims from travelling to the US when he was running for election, prompted condemnation in Britain. \nTrump also stoked a war of words with Khan, calling the Mayor \"pathetic\". Khan later said Trump was behaving \"like a 12-year-old\". \nBut the announcement has also revealed how some senior British politicians have changed their attitudes towards Trump. \nBoris Johnson, who said in December 2015 \"the only reason I wouldn't go to some parts of New York is the real risk of meeting Donald Trump\", tweeted the news about the now-president's trip was \"fantastic\". \nBritish Ambassador to the US Sir Kim Darroch said he was \"delighted\" Trump would \"hold bilateral talks with Prime Minister May\" during his one-day visit. \nThe trip will be the billionaire tycoon's first visit to Britain since 2016, when he flew into his Scottish golf retreat a day after the EU referendum. \nWithin an hour of the announcement, a Facebook event dedicated to a protest had gained 28,000 attendees. \nCampaigners have previously said Trump would face the biggest rally \"ever seen\", should he come to the UK. \nA Number 10 spokesperson said: \"The President of the United States will visit the UK on 13 July. He will hold bilateral talks with the Prime Minister during his visit. Further details will be set out in due course.\" \nDowning Street had previously declined to comment on rumours Trump would make a summer visit to Britain. \nIn January, Trump cancelled a visit to London to open the new American embassy, saying he ditched the trip because the US had got a \"bad deal\" on the construction of the new building. \"Wanted me to cut ribbon-NO!\" he tweeted. \nHowever it was reported by Bloomberg news that Trump had told the Prime Minister, Theresa May, that he would not visit the UK unless she could guarantee he would not face protests. \nLeft-wing commentator Owen Jones, who has been vocal in his criticism of the US President, said he would be leading the protests. \nHe told Sky News: \"It's time to speak out against the bigotry, the anti-Muslim hatred, and misogyny this man represents. \n\"The majority of people in this country want a good relationship with the United States, but we abhor everything that Trump stands for.\" \nLast year, tens of thousands of demonstrators took to the streets in London, Glasgow, Birmingham and throughout the UK - waving banners and placards - in response to the 90-day travel ban issued by Trump to seven largely Muslim countries. \nAfter the Trump visit was confirmed on Thursday, Labour MP David Lammy asked: \"Anybody any good at making placards?\" \nJo Swinson, Liberal Democrat deputy leader and Foreign Affairs spokesperson said the \"scaled-down trip must not be met with scaled-down protests\". \nShe said: \"Protesting against a man with dangerous, misogynistic and racist views is our responsibility. It is  our opportunity to stand in solidarity with all the people he has abused and denigrated.\" \nKate Allen, director of Amnesty International UK, said \"thousands of our supporters\" will \"very definitely be making our voices heard\". \nShe added: \"In the 15 months of his presidency, we've seen a deeply disturbing human rights roll-back – including the discriminatory travel ban, his reckless announcement on Jerusalem, and harmful policies on refugees, women's rights and climate change. \n\"So his visit to Britain will be an important opportunity to underline the importance of free speech and the right to protest.\"",
  "title": "Donald Trump's UK visit on 13 July confirmed as mass protests planned",
  "title_page": null,
  "title_rss": null,
  "url": null
}
