{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "5_M",
  "text": "WASHINGTON — President Trump will travel to the United Kingdom on July 13 for a working visit with British Prime Minister Theresa May, ending a series of declined invitations, scheduling conflicts and missed opportunities to visit a close ally. \nThe prime minister's office confirmed that the two leaders would meet one-on-one, but did not elaborate on their expected agenda, saying only that \"further details would be set out in due course.\" \nThe announcement followed months of drama about the on-again, off-again visit, with Trump turning down opportunities for a formal state visit amid concerns over whether he would get a \"warm welcome.\" He also declined to attend the opening of a new U.S. Embassy in London, claiming the multi-billion-dollar building was a \"bad deal.\" \nTrump is unpopular in Britain, and London Mayor Sadiq Khan has emerged as an unlikely foil for the president, pushing back against Trump's anti-Muslim policies. \nTrump has even been banned from parts of London and there are likely to be large-scale protests. A petition signed by more than 1.8 million people last year urging the British government to cancel any state visit triggered a debate in Parliament. \n\"When Donald Trump arrives on these shores, we and thousands of our supporters will very definitely be making our voices heard,\" said Kate Allen, the U.K. director of Amnesty International, a London-headquartered humanitarian organization. \nDavid Lammy, a British politician from the opposition Labour Party, reacted on Twitter by asking whether anyone he knew was \"good at making placards,\" or signs, carried during demonstrations. \"Asking for a friend,\" Lammy added, tongue firmly in cheek. \nBecause Trump's visit will not be a state one, it means he is unlikely to meet Queen Elizabeth II, visit Buckingham Palace or take part in other official ceremonies. \nIn Washington, White House press secretary Sarah Huckabee Sanders made the announcement to children of White House correspondents at a briefing for \"Take Your Daughters and Sons to Work Day,\" noting that the royal family just had a baby boy who is fifth in line to the throne. The as yet unnamed prince was born on Monday. \nThe Trump family own a hotel and golf course near Aberdeen, Scotland. If Trump does decide to travel there while visiting the U.K. he would face off with residents of a small coastal community who for years have accused him of making grandiose claims and resorting to bullying and other unsavory tactics to get his way on his property. \nThe visit will follow a NATO Summit in Brussels on July 11-12, which Trump is also expected to attend.",
  "title": "Trump will visit UK in July, ending more than a year of suspense",
  "title_page": null,
  "title_rss": null,
  "url": null
}
