{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Trump, May reaffirm 'special relationship' in Davos",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "5_R",
  "text": "President Trump will travel to the United Kingdom in July, the White House confirmed Thursday, where he will meet with Prime Minister Theresa May for bilateral talks. \n\"The President of the United States will visit the UK on 13 July. He will hold bilateral talks with the Prime Minister during his visit,\" 10 Downing Street said in a statement. \"Further details will be set out in due course.\" \nWhite House Press Secretary Sarah Sanders confirmed the visit to reporters at the White House. While no agenda was given, it is likely that Brexit, Syria, tariffs and a U.S.-U.K. trade deal will be among the topics discussed by the two leaders during Trump's working visit. \nA state visit to the U.K. was proposed in January 2017 when May visited the White House, but the resulting controversy and threat of mass protests from left-wing activists appeared to put such a visit on ice. \nIn January this year, Trump nixed a February visit to the U.K. to open the U.S. Embassy, reportedly due to the cost of the building. \nTrump and May last met in Davos, Switzerland in January. During that visit, Trump dismissed concerns of strained ties between the two countries, just weeks after a controversy erupted over Trump's retweeting of videos by a far-right British group of alleged Muslim crimes. \n\"[May] and myself have had a really great relationship, although some people don't necessarily believe that,\" Trump said in Davos. But I can tell you it's true. I have a tremendous respect for the prime minister and the job she's doing. And I think the feeling is mutual from the standpoint of liking each other a lot.\" \n\"We are very much joined at the hip when it comes to the military. We have the same ideas, the same ideals,\" he said before turning to speak to May directly. \"There's nothing that would happen to you that we won't be there to fight for you.\nMay was similarly glowing in her praise of what she called a \"really special relationship between the U.K. and the United States.\" \nMay has repeatedly come under fire for her outreach to Trump. When the U.S., U.K. and France joined forces to bomb Syria this month, hard-left Labour Party leader Jeremy Corbyn accused May of bowing to \"the whims of a U.S. President.\"",
  "title": "Trump to visit United Kingdom in July, meet with PM Theresa May",
  "title_page": null,
  "title_rss": null,
  "url": null
}
