{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "5_RR",
  "text": "The President of the United States Donald Trump will visit the United Kingdom on the 13th of July, the British Ambassador to Washington revealed Thursday afternoon. \nThe visit, which is expected to be a so-called working visit rather than full state visit reciprocates the trip made by UK Prime Minister Theresa May to see President Trump shortly after his inauguration in 2017. \nIt was initially planned that President Trump's first visit to the UK would be a full state visit, with all the pomp and pageantry that entails, however the trip was postponed and finally apparently ditched when talk of a working visit became prominent instead. The invitation to the U.S. President for a state visit to the United Kingdom remains open. \nLondon Mayor Sadiq Khan has \"refus[ed] to apologise\" for his attacks on Mr. Trump, accusing the U.S. president of \"amplifying\" racism. \nIt has been claimed one of the reasons for the delay in the visit is the threat of protests against the President should he visit London. Foremost among those opposing President Trump's visit is London Mayor Sadiq Khan, a self-confessed \"big fan\" of Hillary Clinton, who has talked up the potential for protests on several occasions and added his own words against President Trump. \nBreitbart London reported in 2017 on Khan's remarks, when he said it it wouldn't be \"appropriate for our government to roll out the red carpet\" to President Trump, complaining his policies \"go[es] against everything we stand for.\" \nPraising London's \"great history\" of protest, Khan has said he had no doubt \"there will be some people who will want to express their views loudly and peacefully to the President\". \nAlthough when the visit by President Trump first appeared to have been called off Khan welcomed the news, he now seems to have moderated his tone somewhat. Khan remarked in January that: \"It appears that President Trump got the message from the many Londoners who love and admire America and Americans but find his policies and actions the polar opposite of our city's values of inclusion, diversity and tolerance. \n\"His visit next month would without doubt have been met by mass peaceful protests. This just reinforces what a mistake it was for Theresa May to rush and extend an invitation of a state visit in the first place.\" \nBy contrast to his previous promises of an unwelcoming London, today Mayor Khan took to Twitter to call the city \"open\", and apparently without irony in an age of advancing censorship said that Londoners treasured freedom of speech.",
  "title": "President Trump to visit United Kingdom in July",
  "title_page": null,
  "title_rss": null,
  "url": null
}
