{"authors": [], "date_download": null, "date_modify": null, "date_publish": " March 14, 2013 - UNITED STATES -", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "38_7ecbplus", "text": " The temblor struck at 2 : 09 a. m. and was centered in Geyserville, about 20 miles north of Santa Rosa, according to the U.S. Geological Survey.  USGS measurements indicated at least 20 smaller earthquakes followed throughout the morning.  The Santa Rosa Press Democrat reported the quake began only one mile below ground level, which is why it was felt across the region.  There were no immediate reports of damage, the newspaper said.  But it woke people up.  More than 60 people reported to USGS's \"Did you feel it?\" site, with reports ranging from San Francisco and Oakland to Lake and Yuba counties.  Others reported the shaking on Twitter.  Tectonic Summary - Maacama Fault  The Maacama Fault is mostly a right - lateral strike - slip fault that lies north of Santa Rosa and the immediate San Francisco Bay Area and extends as far north as Ukiah.  It connects to the Rodgers Creek Fault through a complex set of faults between Santa Rosa and Healdsburg, and is thought to be the northward continuation of the Hayward - Rodgers Creek Fault System.  The 2007 Working Group for California Earthquake Probability assigned a total slip rate on the Maacama Fault of approximately 9 mm / yr (1 / 3 inches / yr), based on the assumption that it continues the slip on the Hayward - Rodgers Creek Fault northward.  The central and northern sections of the fault have been observed to accommodate approximately 7 mm / yr (1 / 4 inch / year) of creep along it.  The Maacama Fault parallels and overlaps the Rodgers Creek Fault, in a geometry that is causing the ground between the faults to subside.  In Sonoma County north of Healdsburg, the Maacama Fault is largely obscured by massive landslides where it passes east of Alexander Valley.  The 2007 Working Group for California Earthquake Probability combined the Maacama and the Garberville Faults into single a 181 - km (110 mile) long fault and determined M7.5 as the maximum magnitude for this combined fault system.  There is very little known about the seismic history or earthquake cycle of the Maacama Fault, and as such recurrence intervals are uncertain.", "title": " A 4.6 - magnitude earthquake rattled Northern California overnight Thursday, shaking residents from San Francisco to north of Sacramento.", "title_page": null, "title_rss": null, "url": " http : / / www. powerfullinfo.com / 2012 - 2013 - 73 / california - weather - anomalies - disaster - precursors - 4 - 6 - quake - shakes - northern - calif /? PHPSESSID=5c80dd972566daa742ed50785e366046"}