{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Prime Minister Benjamin Netanyahu of Israel, left, and Secretary of State Mike Pompeo on Sunday in Tel Aviv. The prime minister briefed Mr. Pompeo about the details of his presentation during the visit. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "9_L",
  "text": "WASHINGTON — The Trump administration on Tuesday embraced Israel's claims that Iran entered a nuclear deal with the world's major powers under false pretenses, a stark divergence from its European allies, who said the disclosures broke little new ground and reinforced, rather than weakened, the case for the 2015 deal. \nThe administration echoed the claims made by Prime Minister Benjamin Netanyahu on Monday in a dramatic PowerPoint presentation, suggesting he had coordinated it with the White House to set the stage for President Trump's decision about whether to rip up the agreement negotiated by his predecessor, Barack Obama. \nMr. Trump has threatened to scrap the deal as soon as May 12, if Britain, France and Germany do not agree to wholesale changes. The White House cited Mr. Netanyahu's theatrical presentation — based on documents taken from an Iranian warehouse in a nighttime raid in January — as further proof of the agreement's flaws. \n\"The deal was made on a completely false pretense,\" the White House press secretary, Sarah Huckabee Sanders, said at her daily briefing. \"Iran lied on the front end. They were dishonest actors. So the deal that was made was made on things that weren't accurate, and we have a big problem with that.\" \nMs. Sanders said the White House had discussed the rollout of the new information with the Israelis in advance. A senior Israeli official said Yossi Cohen, the chief of Israel's intelligence agency, Mossad, first informed Mr. Trump of the operation in January during a visit to Washington. And Mr. Netanyahu briefed Secretary of State Mike Pompeo about the details in Tel Aviv on Sunday. \nAs United States intelligence agencies and outside experts pored over the 55,000 pages, and 183 compact discs of Iranian files, the starkly divergent reactions to Mr. Netanyahu's presentation on each side of the Atlantic suggested how the debate over the Iran deal was likely to play out should Mr. Trump decide to reimpose sanctions on Tehran. \nThe White House did not assert that the files demonstrated that Iran was in violation of the 2015 agreement. But Ms. Sanders argued that the disclosures shed new light on the scope of Iran's deceit — further undermining Mr. Obama's case for making the deal. \nIn a sign of the administration's tough line on Iran, Ms. Sanders brushed aside a potentially dangerous typo in its initial statement on Monday evening about the Israeli disclosures. The statement said, \"Iran has a robust, clandestine nuclear weapons program that it has tried and failed to hide from the world and from its own people.\" \nWhite House officials later said that was a clerical error and that it should have said \"Iran had a robust\" program. But Ms. Sanders said, \"We think the biggest mistake that was made was under the Obama administration by ever entering the deal in the first place.\" \nAnd Israel is not finished with its lobbying campaign. Officials there said they planned to share much of the data they had harvested from the secret archive with the International Atomic Energy Agency — including data on some previously unknown nuclear sites in Iran. \nIsrael's intention appears to be to force the organization, a United Nations agency, to demand that the Iranians allow inspections of those sites, even though some of them may have been closed or dismantled years ago. Since Iran considers many of these military sites, the Israelis, and some American officials, expect the Iranians to balk at the demand — inciting another crisis for the deal. \nBut there were no signs that Mr. Netanyahu's presentation on Monday swayed the three European leaders — President Emmanuel Macron of France, Chancellor Angela Merkel of Germany and Prime Minister Theresa May of Britain — all of who have lobbied Mr. Trump not to scuttle the deal. \n\"The Israeli prime minister's presentation on Iran's past research into nuclear weapons technology underlines the importance of keeping the Iran nuclear deal's constraints on Tehran's nuclear ambitions,\" the British foreign secretary, Boris Johnson, said in a statement. \"The Iran nuclear deal is not based on trust about Iran's intentions; rather it is based on tough verification.\" \nThe French foreign ministry said the inspection regime under the agreement \"is one of the most exhaustive and robust regimes in the history of nuclear nonproliferation.\" But it added, \"The new information presented by Israel could also confirm the need for longer-term assurances on the Iranian program, as the French president has suggested.\" \nAlthough Mr. Macron has urged Mr. Trump to stay in the deal, he has left open the possibility of an addendum or successor agreement restricting Iran's nuclear activities. Officials from the State Department and European governments have been negotiating for months but have failed to bridge gaps over how to address the deal's \"sunset clauses.\" \nOver the years of accusations and negotiations with Iran, the Bush and Obama administrations dismissed Tehran's insistence that the country's nuclear program was peaceful in nature. They both presented evidence of Iranian deceptions, including hidden facilities. And the International Atomic Energy Agency showed member states evidence of work on nuclear weapons designs as far back as 2008, some drawn from the same projects Mr. Netanyahu made public. \nIn a statement on Tuesday, the agency said it \"had no credible indications of activities in Iran relevant to the development of a nuclear explosive device after 2009.\" \nOther prominent figures argued that the legacy of Iranian deception outlined in the nuclear files reinforced the case for the deal. \nJohn Kerry, who as Mr. Obama's secretary of state negotiated the agreement, said on Twitter, \"It's worth remembering that the early 2000's — when his evidence comes from — was the period where the world had no visibility into Iran's program. More and more centrifuges were spinning each month and the world wasn't united like it is now.\" \nFormer and current intelligence officials who have closely monitored Iran's programs said nothing that Mr. Netanyahu made public indicated that Iran currently had an active program to manufacture a nuclear weapon. \n\"There is nothing that would change our 2007 assessment,\" said Norman T. Roule, who until last year was the intelligence community's Iran mission manager, and retired after decades of studying the country. \nThat assessment concluded that Iran suspended its nuclear program in early 2004, though it continued to build other facilities — like the giant underground enrichment center at Fordow — that Mr. Netanyahu showed images of in his presentation. Mr. Obama revealed the existence of that site early in his presidency, using it as a basis to push for sanctions. \nStill, if Iran refuses to allow inspections of sites identified by the stolen archive, it could well touch off an inspection crisis. The Iranians have said that military sites are off-limits to the inspectors. But the 2015 accord provides no exemption for such sites. \nIf there is a standoff, there are procedures built into the agreement to resolve the disputes. But the upshot of the Israeli strategy, in concert with the United States, appears to be to force the Iranians into the first violations. \"We recognize,\" one former Israeli official said, \"that we have to establish that the Iranians are trying to deceive now, not just 10 years ago.\" \nFew in Israel said they expected Mr. Netanyahu's presentation would do much to affect Mr. Trump's decision. Rather, several analysts said they expected the Israeli discovery to provide additional cover or supporting evidence with which Mr. Trump could justify his decision, as officials in Mr. Netanyahu's government are said to have concluded. \n\"We have to ask ourselves, 'Who was the audience of last night's presentation?'\" said Amos Yadlin, the former chief of military intelligence for the Israeli Defense Forces. \"Was it the Iranians, to tell them Israel has penetrated their secrets? Maybe it was Iranian public opinion, or the opposition? Or was Trump himself the target, because the prime minister felt the Europeans had convinced him not to walk away?\" \nDespite the skeptical reaction to Mr. Netanyahu's presentation in European capitals and at the International Atomic Energy Agency, it also underlined that in the end, the Israeli leader may have had an audience of one: Mr. Trump. \n\"It's a real opportunity for Netanyahu to achieve things he couldn't achieve in the Obama years,\" said Daniel B. Shapiro, a former American ambassador to Israel. \"The real question is where do we go from here.\"",
  "title": "Israel's claims on Iran divide Europe and U.S. on merits of nuclear deal. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
