{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "\"Iran's leaders repeatedly deny ever pursuing nuclear weapons,\" said Netanyahu. \"Tonight I'm here to tell you one thing: Iran lied.\"",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "9_LL",
  "text": "TEL AVIV (Reuters) - Israel presented on Monday what it said was evidence that Iran had continued gathering nuclear knowledge after signing a 2015 agreement with world powers to curb it, calling on Washington to jettison the agreement. \n\"Iran's leaders repeatedly deny ever pursuing nuclear weapons,\" Prime Minister Benjamin Netanyahu during a televised address carried by Israeli networks. \"Tonight I'm here to tell you one thing: Iran lied.\" \n\"First, Iran lied about never having a nuclear weapons program. 100,000 secret files prove it did. Second, even after the deal, Iran continued to preserve and expand its nuclear weapons knowledge for future use,\" Netanyahu said. \n\"Third, Iran lied again in 2015 when it didn't come clear to the IAEA as required by the nuclear deal.\" \nThe Israeli leader spoke in English and showed pictures and videos purporting to be of historic secret Iranian nuclear facilities, as well as Iranian documents and plans to develop atomic weapons. \n\"After signing the nuclear deal in 2015, Iran intensified its efforts to hide its secret files,\" he said. \"In 2017 Iran moved its nuclear weapons files to a highly secret location in Tehran.\" \nNetanyahu referred to a secret Iranian nuclear project, codenamed \"Amad\", which he said had been shelved in 2003, but he said work in the field had continued. \nU.S. President Donald Trump has long criticized the 2015 agreement, under which world powers lifted economic sanctions on Iran in return for curbs to its nuclear program. \nTrump has threatened to pull out of the agreement in the coming weeks unless it is renegotiated. Netanyahu said he expected Trump would do \"the right thing\" in reviewing the Iran deal. \nNetanyahu met in Tel Aviv on Sunday with new U.S. Secretary of State Mike Pompeo and both men talked tough about Iran. \n\"We remain deeply concerned about Iran's dangerous escalation of threats towards Israel and the region,\" said Pompeo. \nNetanyahu said: \"I think the greatest threat to the world and to our two countries, and to all countries, is the marriage of militant Islam with nuclear weapons, and specifically the attempt of Iran to acquire nuclear weapons.\" \nNetanyahu also discussed Iran by telephone with Trump over the weekend. \nIsrael has long opposed the agreement, while Washington's major European allies have urged the Trump administration not to abandon it and argue that Iran is abiding by its terms. \nThe head of Iran's Atomic Energy organization said on Monday that Iran has the technical capability to enrich uranium to a higher level than it could before the multinational deal was reached. \n\"Technically, we are fully prepared to enrich uranium higher than we used to produce before the deal was reached... I hope Trump comes to his senses and stays in the deal,\" Ali Akbar Salehi was quoted by Iranian state television as saying. \nIsrael is widely believed to be the only nuclear-armed state in the Middle East, though it neither confirms nor denies possessing atomic weapons.",
  "title": "Benjamin Netanyahu disparages Iran nuclear agreement. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
