{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Israel's prime minister says his government has obtained \"half a ton\" of secret Iranian documents proving the Tehran government once had a nuclear weapons program. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "9_M",
  "text": "Tens of thousands of secret files and other evidence proves the 2015 nuclear deal is \"based on lies and Iranian deception\" and should be thrown out, Israeli Prime Minister Benjamin Netanyahu said Monday. \nNetanyahu, in an address televised across Israel, said Iran lied when it said it never sought to develop nuclear weapons, then cheated by failing to reveal all its weapons program information to an international watchdog group charged with monitoring the deal. \n\"Even after the deal was made, Iran continued to preserve and expand its nuclear know-how for use at a later date,\" Netanyahu said. \nPresident Trump has said he will announce within the next two weeks the fate of the deal. He has repeatedly blasted the pact, demanding that changes be made to tighten rules governing Iran. \nTrump, speaking at a White House news conference minutes after Netanyahu spoke, expressed solidarity with the Israeli leader. He also would not dismiss the possibility of negotiating a new deal — an option Iran has flatly rejected. \n\"In seven years that deal will have expired and Iran is free to go ahead and develop nuclear weapons. Seven years is tomorrow,\" Trump said. \"I am not saying what I am doing, (but) it's a horrible agreement.\" \nThe White House said in an official statement Monday that \"this information provides new and compelling details about Iran's efforts to develop missile-deliverable nuclear weapons.\" \n\"These facts are consistent with what the United States has long known: Iran has a robust, clandestine nuclear weapons program that it has tried and failed to hide from the world and from its own people,\" the statement said. \"The Iranian regime has shown it will use destructive weapons against its neighbors and others.  Iran must never have nuclear weapons.\" \nThe deal, struck between Iran and six world powers — the U.S., Britain, Russia, France, China and Germany — was negotiated by the Obama administration. The deal led to easing of a broad range of economic sanctions placed on the Shiite nation. \nNetanyahu, who bitterly opposed the deal, spoke in English, a clear sign he wanted to present his case to an international audience. He said \"half a ton\" of evidence proves Iran has not been faithful. He said the deal provides Iran with a clear path to building a nuclear arsenal in the future. He said Iran has always planned \"at the highest levels\" to continue to work on the program. \n\"This is a terrible deal,\" Netanyahu said. \"In a few days time, President Trump will make his decision. ... I am sure he will do the right thing, the right thing for the United States, the right thing for Israel and the right thing for peace in the world.\" \nIran's deputy foreign minister and senior nuclear negotiator, Abbas Araghchi, called Netanyahu's presentation \"childish and ridiculous,\" and said the purported evidence was \"fake and fabricated,\" the Associated Press reported. \nIran has denied ever seeking nuclear weapons. \nSecretary of State Mike Pompeo, who met with Netanyahu in Israel on Sunday, accused Iran of \"behaving worse\" since the deal. \nPompeo accused Iran of destabilizing the Middle East by supporting terrorist groups, ruthless Houthi rebels in Yemen and the brutal regime of Syrian President Bashar Assad. \n\"We remain deeply concerned about Iran's dangerous escalation of threats to Israel and the region — and Iran's ambition to dominate the Middle East,\" Pompeo said after meeting with Netanyahu in Tel Aviv. \"The United States is with Israel in this fight.\"",
  "title": "Netanyahu: Evidence proves Iran deal 'based on lies and Iranian deception'. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
