{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "9_R",
  "text": "Israel's ambassador to the United States said a public speech and slideshow by Prime Minister Benjamin Netanyahu unveiled facts about Iran's nuclear program that were worse than a \"smoking gun.\" \n\"He presented a smoking bomb,\" Ron Dermer told Bret Baier on \"Special Report.\" \nAs FoxNews.com reported: Israeli Prime Minister Benjamin Netanyahu revealed new \"dramatic\" intelligence Monday which he claimed shows Iran is \"brazenly lying\" about its nuclear weapons program and shows the country is not complying with the vaunted nuclear deal it signed in 2015. \nThe information was obtained within the past 10 days, Israeli officials told Fox News. Netanyahu said the \"half a ton\" of files were moved to a \"highly secret\" location in Tehran after the deal was signed, and contained materials spread over 55,000 pages and 55,000 files on 183 CD's. \nNetanyahu displayed what he said was \"an exact copy\" of the original materials, which are now in a \"very safe place\" and include incriminating documents, charts, presentations, blueprints, and photos. Speaking during a nationally televised address, Israel's prime minister said the material is filled with incriminating evidence showing the Iranian program, called \"Project Amad,\" was to develop a weapon. \nDermer said Netanyahu \"exposed the fangs of the Iranian wolf.\" \nHe said that U.S. intelligence agencies will back up Netanyahu's intel if asked. \nDermer also ripped Iranian diplomat Mohammad Javad Zarif, who said Trump is being \"impetuous\" and sabotaging the Iran nuclear deal. \nDermer said Iran is not being hurt in any way by the deal, pointing to an increase in the ability to sell oil and an influx of money from the agreement. \n\"This is the foremost sponsor of terrorism in the world, this deal did not block them from getting a bomb,\" he said. \nHe called the $1.7 billion sent to Iran a \"signing bonus\" of the nuclear deal and said Iran is in much better shape while the West is in more danger. \nDermer said President Donald Trump is \"right to call attention to the deal.\" The president faces a May 12 deadline to decide whether to re-ratify it.",
  "title": "Israeli Ambassador to US: Netanyahu's Iran Intel 'Presented a Smoking Bomb'. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
