{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "9_RR",
  "text": "U.S. intelligence reportedly confirmed that tens of thousands of files seized by Israel from Iran that, Israeli Prime Minister Benjamin Netanyahu said Monday, document Iran's covert nuclear weapons program are \"authentic.\" \nNetanyahu used a televised address Monday to revealed that Israel had obtained hundreds of thousands of Iranian files from a \"dilapidated\" compound where the regime had allegedly hid its nuclear weapons research archive. \nThe files, Netanyahu said, showed that Iran had lied to the world about its covert work on developing nuclear weapons, including designs for a nuclear bomb, research on nuclear warheads, and development of testing sites. \nJennifer Jacobs of Bloomberg News tweeted: \"Iran lied about never having a nuclear weapons program,\" Netanyahu said. Israel uncovered secret Iranian files. As for Trump, \"I'm sure he'll do the right thing, the right thing for the United States, the right thing for Israel, and the right thing for the peace of the world.\" \nNEW: US official confirms what Netanyahu said. Israel shared the Iranian files with the U.S. And the U.S. verified the material as authentic, I'm told. \nIt was unclear if U.S. intelligence had verified the substance of the allegations made by Netanyahu on the basis of the files. \nNetanyahu's presentation came just days before a highly-anticipated and self-imposed May 12 deadline for the Trump administration to withdraw from the Iran nuclear deal, and minutes before President Donald Trump addressed reporters in the Rose Garden alongside Nigerian President Muhammadu Buhari. \nIn response to a question by Jordan Fabian of The Hill, President Trump said that he had watched some of Netanyahu's presentation, and implied that he found it convincing, but would not yet announce his plans — though he said he was open to re-negotiating the deal. \nEarlier in the day, Iran's deputy foreign minister, Abbas Araghchi, reportedly said: \"The Iran nuclear deal is no longer sustainable for Iran in its present form, without regard to a US exit.\"",
  "title": "Report: U.S. confirmed Iran nuclear files seized by Israel as 'authentic'. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
