{"authors": [], "date_download": null, "date_modify": null, "date_publish": null, "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "42_1ecb", "text": " The Curve 8900 is the latest refresh of the popular Curve line, and it's the thinnest full-QWERTY BlackBerry ever. The smartphone also takes some design cues from the BlackBerry Bold, and it has a titanium-colored finish with chrome highlights. The handset should be able to multitask smoothly, as it's powered by a 512-MHz processor. Like other BlackBerry handsets, the Curve 8900 should have strong messaging capabilities. Users can get personal and corporate push e-mail from up to 10 accounts, and there's built-in instant messaging. Some users may be disappointed that the new Curve can not use T-Mobile's growing 3G network, but the EDGE connection is more than capable of sending and receiving e-mails on the go. There's also integrated Wi-Fi, and the Curve 8900 can be used for unlimited Wi-Fi calling with T-Mobile's HotSpot Calling service. \"With rich multimedia capabilities, exceptional mobile e-mail and messaging features, enhanced Web browsing, a premium phone, and easy access to social networking communities, including Facebook, Flickr, and MySpace.com, the BlackBerry Curve 8900 helps you make the most of a busy lifestyle that spans well beyond normal business hours, '' said Mark Guibert, VP of RIM's corporate marketing, in a statement. The handset will come with built-in GPS that can be used for location-based searches and navigation. The Bluetooth version 2.0 can be used to pair headsets, as well as for stereo Bluetooth headphones. It packs a 3.2-megapixel camera that also can be used to record video. RIM has been making strides with its multimedia capabilities, and the Curve 8900 is no exception. The handset will be able to play multiple types of audio, and video should look crisp with the display's 480-by-360 resolution. Users will not have to worry about running out of storage space, as the smartphone comes with a microSD slot that's expandable up to 16 GB. T-Mobile said the new Curve will be available in February, but the company did not give a price.", "title": " T-Mobile is bolstering its smartphone portfolio by picking up Research In Motion (NSDQ : RIMM)'s next-generation BlackBerry Curve.", "title_page": null, "title_rss": null, "url": null}