{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "1_L",
  "text": "WASHINGTON — President Trump spoke in intimate and candid terms to the former F.B.I. director James Comey about some of the most sensitive matters before the agency, including the salacious dossier detailing Mr. Trump's ties to Russia and the investigation into Michael T. Flynn, the president's first national security adviser, according to Mr. Comey's closely guarded memos. \nThe redacted and declassified memos — running 15 pages in total, and sent to Congress from the Justice Department on Thursday night — detail a series of phone calls and encounters between the two men in the months leading up to Mr. Comey's firing. They offer an extraordinary look at the private interactions among leaders at the highest levels of government. \nMr. Trump seized on the memos in a Twitter message posted late Thursday to repeat what has become a constant refrain, that there was \"NO COLLUSION and NO OBSTRUCTION.\" \nIn one previously undisclosed exchange, according to copies of the memos obtained by The New York Times, Mr. Trump told Mr. Comey that he had reservations about Mr. Flynn: \"The guy has serious judgment issues.\" \nMr. Trump shared an anecdote that shortly after the inauguration, a prominent foreign leader had called to congratulate him. Mr. Flynn told the president that he had scheduled a return call for the next Saturday — far too late in Mr. Trump's estimation. \nThe Times reported at the time that Mr. Trump was irritated at Mr. Flynn for delaying such a call with President Vladimir V. Putin of Russia. \nMr. Flynn was eventually fired for misleading Vice President Mike Pence and others about the details of a conversation with a Russian ambassador. Soon after, Mr. Comey was again at the White House for another meeting. This time, he wrote that Mr. Trump told him that Mr. Flynn \"hadn't done anything wrong\" in calling the Russians and asked him to wrap up his inquiry. \n\"I hope you can see your way clear to letting this go, to letting Flynn go,\" Mr. Trump said, according to the memo. \nMr. Flynn has since pleaded guilty to lying to the F.B.I. about those conversations and is cooperating with investigators for the special counsel who inherited the investigation from Mr. Comey. \nThat exchange and other broad outlines of the memos, which were first published by The Associated Press, have already been reported by The Times, and were relayed by Mr. Comey in testimony before the Senate and in his recent memoir, \"A Higher Loyalty.\" \nBut they are believed to be evidence in a possible obstruction of justice case against Mr. Trump being pursued by the special counsel, Robert S. Mueller III. \nThe memos are exacting in their specificity, including details about who was sitting where, the precise times that conversations began and their durations. In some cases, Mr. Comey shared his accounts with others immediately afterward. \nThese details add credibility to Mr. Comey's account of events. Mr. Trump has disputed some parts, including asking Mr. Comey to shut down an investigation into Mr. Flynn. \n\"What follows are notes I typed in the vehicle immediately upon exiting Trump Tower on 1/6/17,\" Mr. Comey writes at the beginning of his first memo, sent the next day to his deputy director, chief of staff and the F.B.I.'s chief counsel. \nSelect lawmakers have been allowed to view redacted versions of the memos at the Justice Department. But three House Republican committee chairmen requested last Friday that they be sent to Congress, and made clear this week that they were willing to issue a subpoena if the deputy attorney general, Rod J. Rosenstein, did not comply.\nThe Justice Department relented on Thursday and is expected to deliver unredacted versions of the memos via a secure transfer on Friday. \nIn a letter to lawmakers on Thursday, Stephen E. Boyd, an assistant attorney general, wrote, \"In light of the unusual events occurring since the previous limited disclosure, the department has consulted the relevant parties and concluded that the release of the memorandums to Congress at this time would not adversely impact any ongoing investigation or other confidentiality interests of the executive branch.\" \nThe three Republican chairmen — Representative Robert W. Goodlatte of the Judiciary Committee, Representative Devin Nunes of the Intelligence Committee and Representative Trey Gowdy of the Oversight Committee — issued a joint statement Thursday night taking direct aim at Mr. Comey's character and the import of the memos. The documents, they said, show Mr. Comey was \"blind with biases\" and demonstrated bad judgment. \nWhile Mr. Comey \"went to great lengths to set dining room scenes, discuss height requirements, describe the multiple times he felt complimented and myriad other extraneous facts, he never once mentioned the most relevant fact of all, which was whether he felt obstructed in his investigation,\" they wrote. \nDemocrats reached the opposite conclusion. Representative Elijah Cummings, the top Democrat on the Oversight Committee, argued that the documents were the effort of a prudent law enforcement official alarmed by the president's behavior. \nThe memos include other previously undisclosed conversations that shed light on the F.B.I.'s Russia investigation and Mr. Trump's views of it. \nIn a Feb. 8 meeting with Reince Priebus, then the White House chief of staff, for example, Mr. Comey writes that Mr. Priebus asked about the contents of the salacious dossier produced by a former British spy that lays out a vast conspiracy between the Trump campaign and Russia to sway the election. In the days before the inauguration, Mr. Comey briefed Mr. Trump about the document and its contents, including a supposed encounter between Mr. Trump and Russian prostitutes. \nPortions of that section of the memo were redacted, but in speaking with Mr. Priebus, Mr. Comey made clear that the bureau was taking the allegations seriously. \n\"I explained that the analysts from all three agencies agreed it was relevant and that portions of the material were corroborated by other intelligence,\" Mr. Comey wrote. He then defended his decision to share it with Mr. Trump, saying again that \"much of it was consistent with and corroborative of other intelligence.\" \nLater in the conversation, Mr. Priebus asked Mr. Comey if their discussion was private. When the director replied that it was, the White House chief of staff asked whether the F.B.I. had ever wiretapped Mr. Flynn. \nMr. Comey told Mr. Priebus that the question was inappropriate and should be directed through other channels. His response was redacted. \nMichael T. Flynn, right, the former national security adviser, with Mr. Trump in January 2017. In one memo, Mr. Comey said Mr. Trump had questioned Mr. Flynn's judgment. \nThe two men then proceed to the Oval Office, where Mr. Comey said Mr. Trump denied that he had consorted with Russian prostitutes, as the dossier claimed. \n\"The president said ‘the hookers thing' is nonsense, but that Putin had told him, ‘We have some of the most beautiful hookers in the world,'\" Mr. Comey wrote. He said Mr. Trump did not specify when the conversation with Mr. Putin took place. \nOther memos add new details to well-known exchanges. In the same meeting in which Mr. Trump asked Mr. Comey to end the Flynn investigation, the men bonded over leaks of sensitive government information. \n\"I said I was eager to find leakers and would like to nail one to the door as a message,\" Mr. Comey wrote. But, he explained, prosecuting journalists \"was tricky\" for legal reasons. \nMr. Trump told Mr. Comey to talk to \"Sessions,\" referring to Attorney General Jeff Sessions, \"and see what we can do about being more aggressive.\" \nMr. Trump asked Mr. Comey on two separate occasions whether his deputy, Andrew G. McCabe, \"had a problem with him\" and mentioned a large donation made to his wife's political campaign by an ally of Hillary Clinton. \nMr. Comey defended Mr. McCabe as a \"true pro\" and said Mr. Trump would come to agree. \nInstead, Mr. Trump would go on to lavish criticism on Mr. McCabe, arguing he was biased against him. \nMr. McCabe was fired by the F.B.I. in March for reportedly lying to investigators about his contacts with a reporter in an unrelated matter. Federal prosecutors are examining whether they have sufficient evidence to open a criminal investigation based on a report by the department's inspector general. \nAnd they show that Mr. Trump and top aides were eager to discuss with Mr. Comey the details of another consequential F.B.I. investigation: the inquiry into Mrs. Clinton's use of a private email server as secretary of state. Mr. Priebus told Mr. Comey that he believed the Clinton campaign had mishandled the investigation and pressed him for an explanation of why Mrs. Clinton had not been charged. \n\"At some point, I added that it also wasn't my fault that Huma Abedin forwarded emails to Anthony Weiner,\" Mr. Comey wrote, referring to a top Clinton aide and her husband.",
  "title": "",
  "title_page": null,
  "title_rss": null,
  "url": null
}
