{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "1_LL",
  "text": "\"He said he was grateful for the conversation, said more nice things about me and how he looks forward to working with me,\" Comey wrote of meeting with Trump. \nThe Department of Justice released copies of the so-called Comey memos to congressional leaders on Thursday. In the documents, the former FBI director detailed his early encounters with newly-minted President Donald Trump, including Trump's obsession with disproving allegations in the infamous Steele dossier and his demands for aides' loyalty. \nThe memos, which contain no notable information that Comey hasn't already discussed in congressional testimony or his new memoir, were leaked to a swath of news outlets late Thursday. Redacted copies of the seven documents can be seen below. \nThroughout the memos, the former FBI chief details Trump's lack of familiarity with established channels of communication between the White House and the Justice Department. In one instance, Comey describes Trump asking him to discuss then-national security adviser Michael Flynn in \"private,\" prompting Comey to reply that \"it was important that communications about any particular case go through that channel to protect us and to protect the WH from any accusations of improper influence.\" \nA memo from late January of last year, shortly after Trump's inauguration, also referenced the president's widely-reported demand for loyalty. \n\"He then returned to loyalty, saying 'I need loyalty.' I replied that he would always get honesty from me. He paused and said that's what he wants, 'honest loyalty.' I replied 'you will get that from me.' (It is possible we understood that phrase differently, but I chose to understand it as consistent with what I had said throughout the conversation: I will serve the president with loyalty to the office, the country, and the truth. I decided it would not be productive to push the subject further.)\" \nComey also notes that Trump frequently complimented Comey on his work at the FBI in the early days of his administration, noting that the president at times said \"he thought very highly of me\" and had \"heard I'm doing great.\" \nAt one point, Comey wrote that Trump said he had \"serious reservations\" about Flynn. \"In telling the story, the President pointed his [fingers] at his head and said 'the guy has serious judgment issues,'\" Comey wrote. \nMany statements in Comey's memo are similar to his remarks during the press tour for his recent book, A Higher Loyalty, including that Trump insisted Comey disprove allegations about Russian prostitutes in the Steele dossier. \n\"The President brought up the 'Golden Showers thing' and said it really bothered [him] if his wife had any doubt about it,\" Comey recounts in one memo, dated Feb. 8, 2017. \"The President said 'the hookers thing' is nonsense but that Putin had told him 'we have some of the most beautiful hookers in the world.'\" \nComey also recounted the moment Trump allegedly asked him to drop any investigation into Flynn. \nThe memos were released just days after House Judiciary Chairman Bob Goodlatte (R-Va.) threatened to subpoena the DOJ to obtain them. Deputy Attorney General Rod Rosenstein had asked for more time to \"evaluate the consequences\" of their release on Monday.",
  "title": "Here are the redacted copies of the Comey Memos",
  "title_page": null,
  "title_rss": null,
  "url": null
}
