{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Comey claims FBI does not leak in redacted memos. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "1_R",
  "text": "President Trump late Thursday tweeted that the newly released memos written by former FBI Director James Comey “show clearly” no collusion with Russia in 2016 and no obstruction into the investigation. \nThe memos, which were written by Comey about his interaction with Trump, prove that the fired FBI director never felt obstructed, GOP lawmakers said. Many Democrats claim that Trump tried to hold up the FBI’s investigation into alleged collusion leading up to the 2016 election. \n“James Comey Memos just out show clearly that there was NO COLLUSION and NO OBSTRUCTION. Also, he leaked classified information. WOW! Will the Witch Hunt continue?” Trump tweeted. \nThe memos also showed that eight days after he was sworn in as president, Trump told Comey during a one-on-one dinner at the White House that he \"needed loyalty and expected loyalty.\" \nComey wrote that he \"did not reply, or even nod or change my facial expression, which [Trump] noted because we came back to it later.\" At a later point, Comey wrote that Trump told him directly, \"I need loyalty.\" \n\"I replied that he would always get honesty from me,\" said Comey. \"[Trump] paused and said that's what he wants, 'honest loyalty.' I replied, 'you will get that from me.'\" \n\"It is possible we understood that phrase differently,\" Comey added as a parenthetical, \"but I chose to understand it as consistent with what I had said throughout the conversation: I will serve the President with loyalty to the office, the country, and the truth. I decided it would not be productive to push the subject further.\" \nMore than two months later, on March 30, Comey wrote that Trump had called him and pressed the FBI director to make public that the president was not under investigation over contacts between Russian officials and members of his campaign. \n\"I reminded [Trump] that I had told him we weren't investigating him and that I had told the Congressional leadership the same thing,\" Comey wrote. \"[Trump] said it would be great if that could get out and several times asked me to find a way to get that out.\" \nHouse Judiciary Committee Chairman Bob Goodlatte, R-Va.; House Oversight Committee Chairman Trey Gowdy, R-S.C.; and House Intelligence Committee Chairman Devin Nunes, R-Calif., said in a joint statement that Comey's memos \"show the President made clear he wanted allegations of collusion, coordination, and conspiracy between his campaign and Russia fully investigated. \n\"The memos also made clear the 'cloud' President Trump wanted lifted was not the Russian interference in the 2016 election cloud, rather it was the salacious, unsubstantiated allegations related to personal conduct leveled in the dossier\" compiled by ex-British spy Christopher Steele, they added. \nHouse Minority Leader Nancy Pelosi, D-Calif., disagreed, tweeting that the memos \"are further proof of [Trump's] contempt for the rule of law. \n\"His attempts to intimidate, circumvent the law & undermine integrity of law enforcement investigations demand immediate action to protect the Mueller investigation,\" she said. \nThe assurance from Comey that Trump was not being investigated seemed to have weighed on the president's mind as Michael Flynn was fired as national security adviser after misleading Vice President Mike Pence about contacts with the Russian envoy to the U.S. \nJames Comey's memos regarding interactions with President Trump are released to Congress; Harvard Law professor Alan Dershowitz and Fox News legal analyst Gregg Jarrett react on 'Hannity.' \nTrump told Comey during their March 30 conversation that \"if there was 'some satellite' (NOTE: I took this to mean some associate of his or his campaign) that did something, it would be good to find that out, but that he hadn't done anything,\" Comey recalled. \nComey said Trump restated at the end of their conversation that the president \"hoped I could find a way to get out that he wasn't being investigated.\" \n\"I told him I would see what we could do and that we would do the work well and as quickly as we could,\" Comey said he responded. \nGoodlatte, Gowdy and Nunes noted that Comey \"never wrote that he felt obstructed or threatened,\" adding that while Comey \"went to great lengths to set dining room scenes, discuss height requirements, describe the multiple times he felt complimented, and myriad other extraneous facts, he never once mentioned the most relevant fact of all, which was whether he felt obstructed in his investigation.\" \nTrump called Comey again on April 11 to ask \"if I did what he had asked last time -- getting out that he personally is not under investigation.\" Comey says he advised Trump to have White House Counsel Don McGahn call then-Acting Attorney General Dana Boente to request that such a statement be made. \nAfter Trump said he would do so, Comey said the president told him, \"I have been very loyal to you, very loyal, we had that thing, you know.\" \n\"I did not reply, or ask him what he meant by 'that thing,'\" wrote Comey, who added that as Trump ended the call, the president told him he was \"doing a great job and wished me well.\" \nDuring their Jan. 27 dinner in the Green Room, Comey wrote that Trump \"thought maybe he should ask me to investigate\" salacious allegations \"to prove [the dossier] was a lie.\" \nComey wrote that \"it was up to [Trump], but I wouldn't want to create a narrative that we were investigating him, because we are not and I worried such a thing would be misconstrued.\" \n\"My sense is that [the president] was focused on the personal piece [of the dossier],\" Comey told MSNBC Thursday night. \"He would bring it up to me repeatedly.\"",
  "title": "Trump tweets that Comey memos 'clearly' show no obstruction, collusion. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
