{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "1_RR",
  "text": "President Donald Trump commented on the public release of the memos by former FBI director James Comey, asserting that they proved that he leaked classified information. \n\"James Comey Memos just out and show clearly that there was NO COLLUSION and NO OBSTRUCTION,\" Trump wrote on Twitter. \"Also, he leaked classified information. WOW! Will the Witch Hunt continue?\" \nThe 15 pages of Comey's memos include details not included in the former FBI director's book and were released by Republican Congressional intelligence officials on Thursday night. \n\"Former Director Comey never wrote that he felt obstructed or threatened,\" read a joint statement from House Judiciary Chairman Bob Goodlatte, House Oversight Chairman Trey Gowdy, and House Intelligence Chairman Devin Nunes upon the declassified release of the memos. \"While former Director Comey went to great lengths to set dining room scenes, discuss height requirements, describe the multiple times he felt complimented, and myriad other extraneous facts, he never once mentioned the most relevant fact of all, which was whether he felt obstructed in his investigation.\" \nDespite the memos' declassification, some of the material was redacted, raising questions about whether Comey leaked classified information to a private citizen in the hopes of sparking a special prosecutor of the Russian investigation. \nThe Republican officials noted that Comey held Trump to a different standard, by writing detailed memos about his conversations with Trump, while failing to do the same for conversations with Democrats. \n\"Former Director Comey leaked at least one of these memos for the stated purpose of spurring the appointment of Special Counsel, yet he took no steps to spur the appointment of Special Counsel when he had significant concerns about the objectivity of the Department of Justice under Attorney General Loretta Lynch,\" the statement read.",
  "title": "Donald Trump: Comey memos show 'he leaked classified information'",
  "title_page": null,
  "title_rss": null,
  "url": null
}
