{"authors": [], "date_download": null, "date_modify": null, "date_publish": "", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "45_5ecbplus", "text": " An Oklahoma jury has found 27 year old Christopher Simpson guilty of first degree murder of his then pregnant 20 year old girlfriend Ka'loni Flynn and their 12 week unborn child.  The murder came after Flynn resisted Simpson's demands to have an abortion and his reluctance with having to 'deal with another child to support.'  In finding Christopher Simpson guilty the jury recommended that he be sent to maximum life in prison without parole.  His sentencing is scheduled for November 8.  Prosecutors allege that Simpson, who has at least one child from a past relationship, shot Flynn twice in the head because he did not want another baby to support.  A DNA expert testified that the 27 - year - old fathered the 12 - week - old fetus.  The murder is said to have taken place on April 9 at 3 am in Flynn's car which was parked at the time.  It wasn't until in late June that authorities arrested Christopher Simpson believing that he was the chief instigator of her death.  Told the deceased's father, Herbert Flynn Jr : 'I'm glad it's over.  I'm glad we got the verdict we got.  She deserved it.'  During closing arguments, Crawford County Deputy Prosecuting Attorney Jacob Howell showed a photograph of Flynn's body in the driver's seat of car, with bullet wounds to her temple and forehead.  Prosecutors went on to acknowledge that the case against Simpson was complicated and mostly circumstantial.  Told Howell : 'I hope we showed you this was investigated thoroughly, and that every possible suspect was investigated and excluded except one.'  Simpson's attorney, Warren Gotcher, argued that no witnesses could place Simpson at the crime scene and that his client was innocent.  Prosecutor Anthony Evans countered by telling that Simpson was trying to deflect blame because 'the defendant has the spotlight on him, and it's hot, and he needs to get it off him.  So what does he do?  He pushes it over here.  Desperate men do desperate things.'  According to a police affidavit, the couple had been dating for about three months when the 20 - year - old found out she was pregnant.  Purportedly Simpson became angry and expressed that he did not want to be a father again.  Pushed to get an abortion, Flynn declined telling Christopher Simpson that she did not believe in abortion.  Of course the better question may have been if either one of the couple believed in using contraceptives and if not why?  Herbert Flynn Jr told 5News after Simpson's arrest that on the night of his daughter's murder, she was planning to meet with her boyfriend to ask for help in applying for government assistance.  Around the time of the shooting, Simpson was late on child support payments for his 7 - year - old daughter, and according to a local sheriff, he had made statements to his friends that he did not want another child.  After Flynn's death, a witness told police that Simpson bragged to him that his girlfriend's killing will never be solved because it was 'too clean' and 'the perfect murder.'  The 20 - year - old woman, who aspired to be a nurse, allegedly told a friend a short time before the slaying that Simpson had threatened to end the pregnancy for her if she refused to abort the baby.", "title": " Christopher Simpson shoots pregnant girlfriend dead cause he didn't want another child to support.", "title_page": null, "title_rss": null, "url": " http : / / scallywagandvagabond.com / 2013 / 09 / christopher - simpson - shoots - pregnant - girlfriend - dead - cause - didnt - want - another - child - support /"}