{"authors": [], "date_download": null, "date_modify": null, "date_publish": " 4 August 2013 Last updated at 19 : 47 GMT", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "39_1ecbplus", "text": " Actor Peter Capaldi has been announced as the new star of BBC sci - fi series Doctor Who.  The 55 - year - old Glasgow - born star will be the 12th actor to play the Doctor, replacing out - going lead Matt Smith.  Capaldi is best known for his role as foul - mouthed spin - doctor Malcolm Tucker in the BBC series The Thick of It.  \"It's so wonderful not to keep this secret any longer, but it's been so fantastic,\" he said after the news was revealed on a live BBC One show.  The actor had been the bookmakers' favourite to take on the role, with betting on him becoming the next Doctor suspended on Friday.  It is not the first time Capaldi has appeared on the show - he played Roman merchant Caecilius in 2008 Doctor Who adventure The Fires of Pompeii.  At 55, he is the same age as William Hartnell when he was cast in the role as the first Doctor in 1963.  \"Being asked to play the Doctor is an amazing privilege.  Like the Doctor himself I find myself in a state of utter terror and delight.  I can't wait to get started,\" he said.  Secret audition  Steven Moffat, the show's lead writer and executive producer, said casting Capaldi as the Doctor was an \"incendiary combination\".  \"One of the most talented actors of his generation is about to play the best part on television.\"  Moffat said Capaldi had been cast after a secret audition at his house.  \"We made a home video of [Capaldi] being the doctor and I showed it around and everyone said 'yes, that's the Doctor'.  Moffat added the actor had \"briefly flicked through my mind\"the last time he was casting the role, but he did not think he was right for the part, however \"now that moment has arrived\".  Capaldi said he downloaded old Doctor Who scripts from the internet and practised the lines in front of a mirror to prepare for the audition.  He revealed he was filming a BBC adaptation of The Three Musketeers in Prague when he found out he got the part.  \"I had my phone on silent so I missed the call,\" he said.  \"It was my agent and I rang her up and she said 'hello Doctor' - I haven't stopped laughing since.\"  'Incredible incarnation'  Out - going Doctor Matt Smith welcomed Capaldi's casting, and pre - recorded a message for the new Time Lord.  \"I wish my successor all the best and say good luck and good on you for getting it, because I know he's both a huge fan of the show and a really nice guy,\" he said.  \"The casting made me ready excited and as a fan I think it's a canny choice.  If I had to pick someone, I'd pick him because I think he's great.  I'm excited because I know what's coming and he's going to have a blast.\"  Jenna Coleman, who stars as current Doctor Who companion Clara, said : \"I'm so excited Peter Capaldi is the man taking on the challenge of becoming the 12th Doctor.  \"With Steven's writing and his talent I know we'll be making an amazing show with an incredible incarnation of number 12.  I can't wait to start this new adventure.\"  Ben Stephenson, controller of BBC Drama Commissioning said Capaldi was \"an extraordinarily talented actor who can seemingly turn his hand to anything\".  \"We can't wait to premiere his unique take on the Doctor on Christmas Day and we are sure he's going to become one of the all - time classic Doctors.\"  Following the announcement, The Thick of It writer Armando Ianucci tweeted : \"There can't be a funnier, wiser, more exciting Time Lord than Peter Capaldi.  The universe is in great hands.\"  Capaldi will film his first scenes on the series this autumn.", "title": " Doctor Who : Peter Capaldi revealed as 12th Doctor.", "title_page": null, "title_rss": null, "url": " http : / / www. bbc. co. uk / news / entertainment - arts - 23570354"}