{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Published Sunday, Aug 4 2013, 19 : 30 BST", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "39_10ecbplus", "text": " Peter Capaldi is to be the new star of Doctor Who.  The Thick of It actor will play the 12th Doctor, replacing Matt Smith on BBC One's hit sci - fi drama.  Capaldi was unveiled on tonight's (August 4) special show Doctor Who Live : The Next Doctor on BBC One and gave his first interview since taking the role with host Zoe Ball.  He had been widely tipped to take the role for days, with bookmakers suspending betting yesterday after making him the odds - on favourite.  He will take over from Smith in this year's Christmas special ahead of his first full series as the Time Lord in 2014.  Jenna Coleman, who plays current companion Clara, will join Capaldi for the show's eighth series since returning to screens in 2005.  Capaldi - a long - time fan of the show - revealed that he discovered that he had been cast as the 12th Doctor while filming in Prague for the BBC's upcoming adaptation of The Three Musketeers.  In a statement, the 55 - year - old said : \"Being asked to play The Doctor is an amazing privilege.  Like the Doctor himself I find myself in a state of utter terror and delight.  I can't wait to get started.\"  Executive producer Steven Moffat added : \"It's an incendiary combination : one of the most talented actors of his generation is about to play the best part on television.  Peter Capaldi is in the TARDIS!\"  Jenna Coleman revealed that she is \"so excited\"to welcome Peter Capaldi as the 12th incarnation of the Doctor, adding : \"With Steven's writing and his talent I know we'll be making an amazing show with an incredible incarnation of number 12.  \"I can't wait to start this new adventure!\"  Ben Stephenson, controller of BBC Drama commissioning, said : \"We started thinking Peter Capaldi might be the right person to take on this iconic part a few months ago.  \"But it was only when he did a secret audition at Steven's house under the cover of darkness that we knew we had our man.  He's an extraordinarily talented actor who can seemingly turn his hand to anything.  \"We can't wait to premiere his unique take on the Doctor on Christmas Day and we are sure he's going to become one of the all - time classic Doctors.\"  Doctor Who returns to screens on November 23 for its 50th anniversary special starring Matt Smith, David Tennant and John Hurt.", "title": " Peter Capaldi to replace Matt Smith on 'Doctor Who'", "title_page": null, "title_rss": null, "url": " http : / / www. digitalspy. co. uk / tv / s7 / doctor - who / news / a503338 / peter - capaldi - to - replace - matt - smith - on - doctor - who. html"}