{"authors": [], "date_download": null, "date_modify": null, "date_publish": " 5 Aug 2013 10 : 37", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "39_2ecbplus", "text": " Showrunner, 51, adds that Malcolm Tucker will not cast a shadow over new Time Lord : \"You know when the Doctor is in the room\"  Doctor Who boss Steven Moffat has revealed that Peter Capaldi was the only name considered to take over from Matt Smith.  Speaking after last night's announcement of The Thick of It star as the Twelfth Doctor, Moffat also said that the 55 - year - old's lifelong love of Doctor Who had been an aspect when it came to casting him.  Asked whether the list of Time Lord contenders was a short one, Moffat said : \"Yes.  The list went 'Peter Capaldi'.  It was a very short list.\"  He added :\" [Capaldi came into consideration] a fair amount of time ago.  I happened to know he's a big fan.  \"There's something very seductive about an utterly brilliant, arresting looking leading man actor - one of the most talented actors in Britain - who you happen to know is a big fan of the show.  \"You start to think 'maybe we should so something about that'. \"  The 51 - year - old showrunner also insisted that Capaldi's most heralded and readily identifiable previous role - as sweary spin doctor Malcolm Tucker - would not overshadow his new position in charge of the TARDIS.  \"You know when the Doctor is in the room,\" said Moffat.  \"I've seen the Doctor not be in the room when you say those lines out loud.  \"And just to check we weren't mad we showed it to [BBC head of drama] Ben [Stephenson].  And we all just thought 'Yes, obviously that's it.  The Doctor's in the room'. \"  Producer Moffat, who is also a co - creator of Sherlock, is sure that fans will agree that Capaldi is the perfect choice.  \"When you watched him walk out in the room tonight, didn't you just think 'well, there he is'? \"he said.  \"Suddenly he's the Doctor.  Malcolm Tucker is knocked out of the way.  He's just suddenly this magnificent new man.\"  Last night's unveiling of Capaldi was watched by 6.1m people (a 29.8% share of the TV - watching audience), peaking at 6.9m.", "title": " Peter Capaldi was the only name considered to take over Doctor Who role from Matt Smith, says show boss Steven Moffat.", "title_page": null, "title_rss": null, "url": " http : / / www. mirror. co. uk / tv / tv - news / doctor - who - peter - capaldi - only - 2126126"}