{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Sunday 4 August 2013, 19 : 30", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "39_4ecbplus", "text": " Amid much hype and speculation, Peter Capaldi was unveiled as the next Doctor during a special live television event on BBC ONE tonight.  Widely regarded as one of the biggest roles in British television, Capaldi will be the Twelfth Doctor and takes over from Matt Smith who leaves the show at Christmas.  Peter Capaldi says : \"Being asked to play the Doctor is an amazing privilege.  Like the Doctor himself I find myself in a state of utter terror and delight.  I can't wait to get started.\"  Steven Moffat, lead writer and executive producer says : \"It's an incendiary combination : one of the most talented actors of his generation is about to play the best part on television.  Peter Capaldi is in the TARDIS!\"  Doctor Who companion, Jenna Coleman says : \"I'm so excited Peter Capaldi is the man taking on the challenge of becoming the Twelfth Doctor.  With Steven's writing and his talent I know we'll be making an amazing show with an incredible incarnation of number 12.  I can't wait to start this new adventure!\"  Charlotte Moore, Controller BBC One says : \"Peter Capaldi has all the genius and versatility needed to take on the mantel of the great Time Lord and make the role his own.  He'll bring his own particular wisdom, charisma and wit to the Twelfth Doctor and take the show into an exciting new era.\"  Ben Stephenson, Controller, BBC Drama Commissioning says : \"We started thinking Peter Capaldi might be the right person to take on this iconic part a few months ago.  But it was only when he did a secret audition at Steven's house under the cover of darkness that we knew we had our man.  He's an extraordinarily talented actor who can seemingly turn his hand to anything.  We can't wait to premiere his unique take on the Doctor on Christmas Day and we are sure he's going to become one of the all - time classic Doctors.\"  Doctor Who is produced by BBC Cymru Wales.", "title": " Peter Capaldi exclusively revealed to the nation as the Twelfth Doctor.", "title_page": null, "title_rss": null, "url": " http : / / www. bbc. co. uk / blogs / doctorwho / articles / Peter - Capaldi - exclusively - revealed - to - the - nation - as - the - Twelfth - Doctor"}