{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Sun., Aug. 4, 2013 11 : 29 AM PDT", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "39_6ecbplus", "text": " Meet your new Time Lord!  Doctor Who has finally selected its 12th doctor : Peter Capaldi is officially set to replace exiting star Matt Smith as the TARDIS leader, producer Steven Moffat announced on the live BBC special Doctor Who Live : The Next Doctor Sunday.  Well known for his work as Malcolm Tucker on The Thick Of It, Capaldi, 55, isn't a stranger to the longrunning BBC hit's fans : He appeared opposite David Tennant in The Fires of Pompeii in 2008 as Caecilius and had a major role on Torchwood : Children of Earth, the Doctor Who spinoff series.  \"Being asked to play the Doctor is an amazing privilege,\" Capaldi said.  \"Like the Doctor himself I find myself in a state of utter terror and delight.  It's so wonderful not to keep this secret any longer, but it's been so fantastic.\"  \"I just want to wish my successor all the best and say good luck and good on you for getting it,\" Smith said in a videotaped message.  \"I know he's a huge fan of the show and a really nice guy.  The casting of it made me really excited it.  I think it's a really canny choice.  Good luck, man.  It's going to be a thrill.\"  Oddly enough, Capaldi was recently seen in Brad Pitt's World War Z as a World Health Organization doctor, or W.H.O. doctor, for short.  The big reveal was arguably Britain's second most highly - anticipated announcement in recent history, following Prince George's arrival, with BBC even promoting the announcement that an announcement would be made.  \"The decision is made & the time has come to reveal who's taking over the TARDIS,\" BBCOne promoted on Twitter.  \"For the last of the Time Lords, the clock is striking twelve.\"  Smith had played the iconic role since 2010 and shocked fans when he announced his his departure from the series in June.  \"Doctor Who has been the most brilliant experience for me as an actor and a bloke, and that largely is down to the cast, crew and fans of the show.  I'm incredibly grateful to all the cast and crew who work tirelessly every day, to realise all the elements of the show and deliver Doctor Who to the audience,\" he wrote on BBC's Doctor Who website.  \"Many of them have become good friends and I'm incredibly proud of what we have achieved over the last four years.\"  The series' 50th anniversary special, which all air in November, is set to be Smith's last official outing as the Doctor, but it's been revealed that he will also make an appearance in the Christmas special.", "title": " Doctor Who Revealed : Peter Capaldi Cast as the 12th Time Lord!", "title_page": null, "title_rss": null, "url": " http : / / uk. eonline.com / news / 445612 / doctor - who - revealed - peter - capaldi - cast - as - the - 12th - time - lord"}