{"authors": [], "date_download": null, "date_modify": null, "date_publish": " August 4, 2013 2 : 29 PM ET  He joined the series, becoming the 11th Doctor, in 2010.", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "39_7ecbplus", "text": " After lots of speculation, Peter Capaldi has been named the new Doctor for Series 8 of \"Doctor Who.\"  He will take over for Matt Smith, the 12th Doctor, who is leaving during the 2013 Christmas Special.  The announcement was made Sunday (August 4), during \"Doctor Who Live : The Next Doctor,\" which aired on BBC and BBC America.  Capaldi, a Scottish actor, is best known for starring in the BBC series \"Thick of It,\" though he has a few movie credits to his name, as well.  He appeared in \"World War Z\"( ironically, in the role of W.H.O. Doctor) and has a part in the upcoming \"Maleficent,\" starring Angelina Jolie.  Capaldi has also appeared on \"Doctor Who\"before, guest starring in the Series 4 episode \"The Fires of Pompeii.\"  The live special, hosted by Zoe Ball, featured celebrity guests sharing their love for \"Doctor Who,\" including Peter Davison (5th Doctor).  The show also featured an interview with Smith, who endorsed the new Doctor.  \"If I had to pick someone, it would be [Capaldi].  I think he's great,\" he says.  \"I just want to wish my successor all the best.\"  It was first announced Smith would be leaving the show in June.  He was the third to take on the role since the series was relaunched in 2005, following in the footsteps of Christopher Eccleston (9th Doctor) and David Tennant (10th Doctor).  The new Doctor will be introduced as Smith leaves the role, regenerating in the 2013 Christmas special (airing December 25).  It will also serve as the show's 800th episode.  Smith was first introduced in the 2009 Christmas special, \"The End of Time.\"", "title": " 'Doctor Who' : Peter Capaldi announced as the new Doctor.", "title_page": null, "title_rss": null, "url": " http : / / blog. zap2it.com / frominsidethebox / 2013 / 08 / doctor - who - peter - capaldi - announced - as - the - new - doctor. html"}