{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Aug. 05, 2013 | 2 : 47 p. m.", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "39_9ecbplus", "text": " And as the world (or one obsessed subset thereof) watched, the name of the person to play the Twelfth Doctor - though not, of course, the name of the Doctor, which shall remain unspoken - was revealed.  Peter Capaldi, the bookmakers' choice by a wide margin, will take over for the retiring Matt Smith, the Doctor since 2010.  Smith's Doctor will regenerate into Capaldi's - same character, just a different body - this Christmas.  The new star of \"Doctor Who\"is best known to Americans, which is not to say well known, as the F - bombing spin doctor in Armando Iannucci's political comedies \"The Thick of It\"( BBC series) and \"In the Loop\"( film spinoff) and, reaching back through the foggy mists of time, for Bill Forsyth's gentle comedy of Scotland, \"Local Hero.\"  He is, at any rate, better known to us than were his immediate predecessors, Christopher Eccleston, David Tennant and Smith, when they assumed the role.  He has twice appeared in the Whoniverse, as a first - century businessman in \"The Fires of Pompeii\"and a tragic figure at the center of the spun - off \"Torchwood\"miniseries, \"Children of Earth.\"  He also appears in \"World War Z\"as a World Health Organization, or WHO, doctor.  You felt a little chill then, didn't you?  The announcement came Sunday, after months of public speculation and wish - listing, conspiratorial sifting of coincidence and readings of tea leaves, near the end of \"Doctor Who Live : The Next Doctor,\" a BBC special that aired here simultaneously on BBC America.  It is not to be confused with the big 50th anniversary special set for November.  With Fifth Doctor Peter Davison (the cricket - sweater Doctor) and elderly companion Bernard Cribbens as its main in - studio star power and a floating Tardis (police - box shaped time machine, for the uninitiated) introduced as a \"special guest,\" it was, global interest aside, a small - scale, essentially local, even provincial, event.  Because whatever else the new Doctor would turn out to be - and, if recent history was any guide he would turn out to be tall, thin, white, clean - shaven, not bald and unconventionally attractive (check, check, check, check, check and check) - it was going to be somebody British.  As does James Bond, \"Doctor Who\"posits a world in which the U.K. is still at the center of things.  It's where the aliens arrive, and the Earth is repeatedly saved.  Some had hoped for a black Doctor (Idris Elba was often named), or a female Doctor (Olivia Colman, perhaps), and as with other great and important offices, it does seem only right that it be open to anyone, regardless of gender or color.  Indeed, if it seemed just possible this time, it's hard to believe the next Doctor won't break one of those lines, or both.  That Capaldi is an award - winning actor of great reputation does not necessarily mean that it will be any easier for him to take control of the Tardis.  Every new Doctor represents a testing of the brand and a testing of the faithful ; there are viewers still mourning the loss of David Tennant (No. 10), and undoubtedly some who feel nothing's been as good since Tom Baker (No. 4) quit, back in 1981.  It is also, and not incidentally, a test of the show runner, Steven Moffat, who came in with Smith, following series - rebooter Russell T Davies.  Show runners are a thing we know about now ; we know whom to blame, and Moffat draws a fair share.  Still, first reactions seem on the whole approving, though some younger online commenters bemoaned Capaldi's age - 55, the age of William Hartnell when he created the role, back in 1963.  Fangirls who crushed on the younger Eccleston, Tennant and / or Smith wondered how they would adapt to a Doctor old enough to be their dad.  There is, of course, plenty of precedent for gray - haired swashbucklers (your Gandalf, actually called Gray, your Obi - wan Kenobi, your very vibrant Third Doctor, John Pertwee).  And Moffat can always create companions for raw youth appeal, as was the original custom.  (Hartnell's Doctor traveled with a granddaughter.)  Certainly, Capaldi represents a change from Matt Smith - thought by some to be too young for the part when he took over, ironically - but he also offers a range of new tonal possibilities, some of which are also old possibilities.  Moffat may be more of a \"Who\"classicist than Davies, who brought sex, romance and a will - they - won't - they element to the series.  It may be time for the return of a more fatherly Doctor.  If you look back across the whole life of the series, Capaldi seems very much in the tradition - a likely, almost obvious choice.  He has the authority, the madness, the sweetness.  At the same time, we don't know how Moffat plans to write him.  The doctor is as constant as the stars and as changeable as the wind ; he is a warrior clown, comical and stern, a thousand - year - old child, a tenderhearted soul who loves humanity and yet is renowned across the universe as the scourge of worlds.  (Typically, these are worlds that deserve a scourge.)  There is a lot of room to play in there.  Fans - especially British fans, whose allegiance spans decades and generations, speak of \"my Doctor\"as if every citizen needs to have a favorite - do have strong ideas about what the Doctor should be.  But variety is in his nature, and in choosing to take this ride, we agree to accept the authenticity of the latest anointed choice - a choice no more in our hands, after all, than it is in the Doctor's.  He is always surprised by who he next finds himself to be.  For most viewers the Doctor shapes himself to the actor, even as the actor shapes the part.  You want to honor the tradition, naturally, and you can't afford to alienate your audience.  Still, fear of change is a poor basis for creative decision - the point, Moffat told Hero Complex recently, was to bring the world around : 'You want people to go, 'No, that would never work!' .. .  And they always get wrenched out of their comfort zone, and then they find the Doctor again.  And there's such a range of what the Doctor can be.\"  I'm excited.", "title": " Peter Capaldi as 'Doctor Who' : A return to distinguished tradition?", "title_page": null, "title_rss": null, "url": " http : / / herocomplex. latimes.com / tv / peter - capaldi - as - doctor - who - a - return - to - distinguished - tradition /"}