{"authors": [], "date_download": null, "date_modify": null, "date_publish": null, "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "36_5ecb", "text": " Winston Blackmore, 52, and James Oler, 44, were arrested by RCMP on Tuesday, Attorney General Wally Oppal said at a news conference Wednesday. Oler is the bishop of the Fundamentalist Church of Jesus Christ of Latter Day Saints, while Blackmore is the former FLDS bishop who was ousted in 2002 after a power struggle with the sect's prophet Warren Jeffs. The two men were to appear in court Wednesday after an \"intensive '' seven-month investigation, Oppal said. \"Mr. Blackmore it is alleged that he has committed polygamy with approximately 20 people, '' Oppal said. \"And as far as Oler is concerned it is alleged that he has committed polygamy with two women. '' Blackmore has been charged with \"practising polygamy '' on May 1, 2005 and Oler has been charged with the same crime on Nov. 1, 2004, according to provincial court files. \"I am pleased a prosecution will be proceeding, as it will provide legal clarity as to the constitutionality of section 293 of the Criminal Code (concerning polygamy), '' Oppal said in a statement. News of the charges was welcomed by Audrey Vance, co-chair of Altering Destiny Through Education, which is based in Creston, B.C., not far from Bountiful. Vance has lobbied for charges against Bountiful residents. \"We all know this is a cult and we have to do something to address this because in Canada women do have equal rights, '' she said in an interview Wednesday. Blackmore, who has had 26 wives and more than 100 children, is outspoken in his belief that the Charter of Rights and Freedoms protects his religious practice of polygamy - a tenet that was set out by Mormonism's founder Joseph Smith, but was denounced by the mainstream church in 1890. At a polygamy summit in 2006, Blackmore admitted that he had had \"several '' very young \"wives '' including one who was under 16. He repeated that when he was interviewed by CNN's Larry King. Blackmore lost his role as the Bountiful bishop after his disagreement with Jeffs, the church's prophet who has been convicted of being an accomplice to the rape of a minor in Utah and is currently in jail in Arizona facing similar charges there. Jeffs and other senior FLDS members have also been charged in Texas with offences related to the so-called \"spiritual marriages '' to under-aged girls. Blackmore now leads a breakaway group that lives in the southeastern corner of B.C. and is the head of the Mormon Hills School Society, which runs a government-funded, independent school. Over the years, Blackmore amassed a multi-million-dollar business empire that included a post-and-pole company, logging operations and a large farm. Little is known about Oler, a mechanic. He has never spoken to the media and there are few photos of him. However, people within the community have confirmed that Oler has at least three wives, several of whom were in their teens when they were assigned to him in placement marriages by Jeffs.", "title": " Two leaders in the polygamous community of Bountiful, B.C., have been charged with practising polygamy under the Criminal Code.", "title_page": null, "title_rss": null, "url": null}