{"authors": [], "date_download": null, "date_modify": null, "date_publish": null, "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "36_8ecb", "text": " Two leaders of polygamous groups with ties to Utah have been arrested in Canada, charged with practicing polygamy. One of the wives of former Fundamentalist LDS Church leader Winston Blackmore confirmed his arrest Wednesday. \"It's for polygamy, '' she said, declining to give her name but telling the Deseret News she was one of Blackmore's wives. She also said FLDS bishop Jim Oler was also arrested. The criminal charges were filed Tuesday in Creston, British Columbia. In Canada, polygamy is illegal. The Royal Canadian Mounted Police said they began their investigation in 2005 and revisited it earlier this year after a special prosecutor recommended charges. The prosecutor recommended polygamy and sexual exploitation charges but British Columbia attorney general Wally Oppal opted to only pursue polygamy charges, noting that Blackmore has 20 wives and Oler has two. \"The defendants should raise any constitutional issues, '' Oppal said, in response to questions about polygamists' religious freedoms claims. Oppal denied that the prosecution was political, despite the former attorney general for British Columbia and several special prosecutors declining to pursue charges against anyone in the fundamentalist enclave of Bountiful. Both Blackmore and Oler were to be released from RCMP custody late Wednesday pending a future court appearance. They were ordered by a judge to surrender their passports, check in with RCMP authorities, not leave British Columbia and perform no \"celestial marriages, '' said RCMP Sgt. Tim Shields. A spokesman for the FLDS Church did not immediately return a call seeking comment. News of the charges stunned many. \"I 'm shocked. I really am, '' said Mary Batchelor, the director of the Utah-based pro-polygamy group Principle Voices. \"I 'm amazed they are actually doing that. '' Batchelor said she had been in contact with some of Blackmore's wives, whom she said were understandably upset. Blackmore was a bishop in the Utah-based FLDS Church until he was excommunicated in 2002. The fundamentalists who live in Bountiful, British Columbia, split with some following Blackmore and others remaining in the FLDS Church led by Warren Jeffs. Oler was a bishop in Bountiful, the FLDS enclave there. The attorney general of British Columbia has been probing the polygamous communities on allegations of sex abuse, human trafficking and forced marriages. Several special prosecutors were appointed to give opinions on prosecuting polygamy laws in Canada. In an e-mail to the Deseret News in 2006, Blackmore acknowledged being the subject of a Canadian police inquiry. \"Since we are not hiding we are not hard to find, '' he wrote. \"It is hard to think that Canada, the home of free lovers and legalized same-sex marriages, not to mention legal wife-swapping clubs, could waste their time on people who live like we do. ''", "title": " Polygamous leaders arrested in Canada, ordered to surrender passports.", "title_page": null, "title_rss": null, "url": null}