{"authors": [], "date_download": null, "date_modify": null, "date_publish": null, "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "37_1ecb", "text": " The quake struck off the coast at 7:48 a.m. local time, 75 kilometers (50 miles) west of the region's main city of Manokwari, the U.S. Geological Survey said in an alert. There were no immediate reports of damage or casualties and no tsunami alert was issued. A United Nations assessment team was dispatched to the province after two quakes, measuring 7.6 and 7.4, struck west of Manokwari Jan. 4. At least five people were killed, 250 others injured and more than 800 homes destroyed by those temblors, according to the UN. About 14,000 people fled their homes at the weekend after a local tsunami warning was issued, the UN said on its Web site. The Indonesian government has transported relief supplies, including food, medicine, tarpaulins, generators and water purification equipment to the affected areas. Two three-story hotels in Manokwari, a city of 160,000 people, collapsed in the Jan. 4 quakes and buildings were also damaged in the town of Sorong, according to the World Health Organization. Manokwari's Rendai Airport was also temporarily closed on security and safety concerns, the WHO said. Indonesia lies in a zone where the Indo-Australian, Eurasian, Philippine and Pacific plates meet and occasionally shift, causing earthquakes and sometimes generating tsunamis. There have been hundreds of earthquakes in Indonesia since a 9.1 temblor in 2004 caused a tsunami that swept across the Indian Ocean, devastating coastal communities and leaving more than 220,000 people dead in Indonesia, Sri Lanka, India, Thailand and other countries.", "title": " Indonesia's West Papua province was hit by a magnitude 6.1 earthquake today, the latest powerful tremor to shake the region where five people were killed and hundreds injured at the weekend when buildings were destroyed.", "title_page": null, "title_rss": null, "url": null}