{"authors": [], "date_download": null, "date_modify": null, "date_publish": null, "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "37_2ecb", "text": " The 6.1-magnitude quake was the latest in a series of dozens of powerful tremors to have hit the region since 7.6 and 7.5 magnitude quakes that struck off the provincial capital Manokwari on Sunday. Wednesday's shallow quake hit at 7 : 48 am (2248 GMT Tuesday) just off the coast, some 75 kilometres (50 miles) west of Manokwari. Officials had been put on alert to deal with more devastation to the area -- where thousands of people have been living in tents since Sunday's quakes -- but no damage or injuries had been reported, provincial disaster chief Rahimin Kacong was quoted by AFP as saying. The quake was accompanied by smaller quakes with a magnitude over 5.0 off Kupang in East Nusa Tenggara Province and Ternate in North Maluku province, Indonesia's seismological agency said. Around 14,000 people flooded into camps on high ground in the aftermath of Sunday's quakes fearing deadly waves after authorities issued and then withdrew a tsunami alert. Many refugees have returned home but some remain too fearful to go back Kacong said. \"We already told people to return to their houses following the meteorological office report saying that the frequency of aftershocks has reduced, '' he said. Hundreds of government and private buildings have been damaged by the Sunday quakes, as well as seven bridges, two of which have collapsed. The tremors have re-awakened bitter memories of similar deadly quakes that hit Manokwari in 2002, as well as the Asian tsunami that killed 168,000 people in Indonesia's Aceh province and Nias island in 2004.", "title": " A strong earthquake rattled Indonesia's West Papua province Wednesday just days after a powerful quake levelled buildings and killed one person, the United States Geological Survey said.", "title_page": null, "title_rss": null, "url": null}