{"authors": [], "date_download": null, "date_modify": null, "date_publish": null, "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "37_4ecb", "text": " A young girl was killed and dozens of others were seriously injured in the quakes, which also sent small tsunamis into Japan's southeastern coast. Panicked residents fled to higher ground as the first earthquake measuring 7.6 magnitude struck on Sunday about 135 kilometers from the main city of Manokwari, according to the US Geological Survey. Power supplies were cut and commercial flights were cancelled after cracks appeared on the runway of the city's airport. Hengky Tewu, a hospital director, said a 10-year-old girl was killed at home when a wall collapsed and crushed her head. At least 50 people were hospitalised for broken bones and head wounds while 300 others were given outpatient treatment, Henri Sembiring a local health official, said. One of the tremors with a 7.3 magnitude was felt 1,300 kilometers away in northern Australia, but no damage was reported. Indonesia's National Disaster Coordination Agency said about 135 homes and other buildings were badly damaged or toppled in the quakes. Residents in Manokwari - a jumble of low-lying brick and cement structures home to 167,000 people - remained wary of aftershocks, with many staying outdoors in case fresh tremors caused more buildings to collapse. The Indonesian health ministry and World Vision Indonesia, a relief agency, have said they will be sending in aid teams and emergency kits including canned food, blankets and basic medical supplies. Papua, located about 2,955 kilometers east of the country's capital, Jakarta, is among the nation's least developed areas. In December 2004, a massive undersea quake off the western Indonesian province of Aceh triggered a giant tsunami that left at least 230,000 people dead and missing in a dozen countries facing the Indian Ocean. Indonesia straddles a chain of fault lines and volcanoes known as the Pacific \"ring of fire '' and is prone to seismic activity.", "title": " A series of powerful earthquakes has shaken Indonesia's remote eastern province of Papua, briefly triggering fears of a tsunami, officials have said.", "title_page": null, "title_rss": null, "url": null}