{"authors": [], "date_download": null, "date_modify": null, "date_publish": null, "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "37_5ecb", "text": " Head of the agency Captain Manrosan, who goes with a single name like many Indonesian, told Xinhua by phone from Manokwari of Papua's main city that eight people had suffered from serious injury and 261 other got minor injury. Manrosan said that the 7.7 magnitude quake damaged 42 government office buildings, 2 roads, 14 hotels, over 1,600 houses, 40 religious building including churches and mosques, 8 bridges, and 4 school buildings. \"Up to the midday Monday, the latest data of the fatality is only one person, '' he said, ruling out speculation about the rumor of several deaths. The Manokwari Hospital said that most of those seriously wounded now were treated at an emergency unit at the hospital. \"Most of them have broken bones, caused by the smashed of the debris of the buildings, '' Doctor Sokal Pirg of the unit told Xinhua by phone from the hospital. Evacuees still lived in tents and relatives' houses which were at higher grounds and far from sea for fear of possible tsunami, said Manrosan. The quake has totally stop electricity supply at the city, but now some of them have resumed, said Manrosan. The quake, with epicenter was about 85 miles (135 kilometers) from Manokwari and occurred at a depth of 22 miles (35 kilometers), is followed by tremors, triggering fears among the displaced persons to return homes. \"We are still scared of further strong quakes, '' said Nora Nursita, a resident at Manokwari, over phone. Aids for the victims have been delivered from the local administration and Jakarta, said Manrosan. Up to Monday, tremors keep shaking Papua, particularly Manokwari city which is home by over 170,000 people. Indonesian have recently launched an early tsunami warning system across the country to prevent a repeat of the 2004's massive death caused by tsunami. The catastrophe four years ago devastated Indian Ocean community and killed more than 230,000 people, over 170,000 of them in Aceh at northern tip of Sumatra Island of Indonesia. Indonesia, with over 230 million population and 17,000 islands, sits at a vulnerable zone so called \"the Pacific Ring of Fire '' where two continental plates, stretching from the Western Hemisphere through Japan and Southeast Asia, meet that cause frequent volcanic movements.", "title": " The powerful quakes in Papua in easternmost of Indonesia on Sunday have led over 14,000 people taking shelters in tents, destroyed hundreds of buildings, killed one person and injured dozens others, local disaster management agency said on Monday.", "title_page": null, "title_rss": null, "url": null}