{"authors": [], "date_download": null, "date_modify": null, "date_publish": " MONDAY, JUNE 11TH, 2012 AT 10 : 49 AM  That amounts to 5, 184, 000 pixels and 220 ppi, 4 times the current pixel count in the existing MacBook Pros.", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "40_8ecbplus", "text": " Apple has unveiled the next generation of MacBook Pro at the WWDC Keynote in San Francisco.  The 15. 4″ MacBook Pro refresh will be remarkably thin, at 0. 71″ and at 4. 46 pounds, it will be the thinnest and lightest MacBook Pro ever.  The display is where the MacBook Pro refresh truly shines, with a Retina display at a whopping 2, 880 by 1, 800 pixels.  Apple touts it as the world's highest - resolution notebook display.  All stock Mac applications have been updated to support the Retina display on the new MacBook Pro, as well as several other popular applications including Aperture, Final Cut Pro, and Diablo III.  Updates for Adobe's suite of programs and AutoCAD should be coming soon as well.  The new MacBook Pro will feature Intel's 3rd - Generation Core (Ivy Bridge) processor up to an i7 2. 7 GHz quad - core, up to 768GB of internal flash storage, and up to 16GB of RAM.  Kepler GT 650M graphics will also be included on all models of the new MacBook Pro, which should offer a superb gaming experience.  The new MacBook Pro will feature 7 hours of battery life, with up to 30 days of standby time.  Completing the feature set are an SD reader, HDMI and USB 3. 0, MagSafe 2, Thunderbolt, USB 3. 0, headphone jack, Black Magik 5K Camera, FireWire 800, and GigaPort Ethernet Thunderbolt adapters.  The new MacBook Pro will start at $2, 199 for the 2. 3 GHz quad - core i7 model with 256GB flash storage, and go up from there.  Oh, and the best part?  The new MacBook Pro starts shipping TODAY.  Go ahead and start throwing your credit cards at the screen, folks.", "title": " Apple intros new MacBook Pro, blurs line between tablet, computer.", "title_page": null, "title_rss": null, "url": " http : / / www. intomobile.com / 2012 / 06 / 11 / apple - intros - new - macbook - pro - blurs - line - between - tablet - computer /"}