{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "7_L",
  "text": "WASHINGTON — The Trump administration said on Monday that it would delay a decision to impose steel and aluminum tariffs on the European Union, Canada and Mexico for another 30 days, giving key allies a reprieve as the White House tries to extract concessions from trading partners who have resisted those demands. \nThe extension reflects concerns by the Trump administration of a swift retaliation on American products by European Union nations, and will also give the Trump administration more breathing room to work on a separate trade battle with China. \nThe 25 percent tariffs on steel and 10 percent on aluminum were set to go into effect on Tuesday and had set off a global scramble by nations trying to secure permanent exemptions. The administration, which granted temporary exemptions to a handful of countries in March, said it had reached initial agreements with Argentina, Australia and Brazil that would allow them to avoid the tariffs, at least for now. Details of those agreements will be finalized in the next 30 days, the White House said. \nPresident Trump's decision puts off a move that could have enraged key American allies at a delicate moment, as the United States heads toward tricky negotiations with North Korea and is considering abandoning the Iran nuclear deal over the objections of European Union leaders. Despite the president's tough stance on trade, many of his advisers are leery of initiating trade clashes that could destabilize stock markets and put other political goals at risk, like updating the North American Free Trade Agreement. The White House is also dispatching a delegation of top officials to Beijing this week to try to soothe tensions in its trade battle there. \nThe Trump administration had been trying to pressure Europe, Canada, Mexico and other nations to renegotiate trading terms in America's favor, including limiting the flow of foreign metals into the United States, saying that it would grant exclusions to the tariffs for countries that agreed to meet its demands. But while the threat of tariffs had helped finalize a continuing deal with South Korea, there has been little indication that other nations will bend. \nThe reprieve will come as a relief to major American allies that were bracing for damage to their economy from lower sales of metals into the United States. But it could fuel criticism that Mr. Trump is more bark than bite and increase the pressure on the White House to squeeze concessions from other nations. \nIn recent weeks, American negotiators have pressed allies to restrain their own metal shipments to the United States voluntarily in exchange for having the tariffs lifted. \n\"In all of these negotiations, the administration is focused on quotas that will restrain imports, prevent transshipment and protect the national security,\" the White House said in its statement Monday evening. \nSteel pipes at a factory in China. Countries such as China that don't have exemptions will face a 25 percent tariff on steel imports to the United States. \nBut officials have also embarked on unrelated trade discussions. Commerce Secretary Wilbur Ross, who has been charged with negotiating with the European Union, had been pushing for the bloc to reduce its tariffs on imported cars and lower its trade surplus with the United States. \nForeign allies and companies that source steel and aluminum from abroad were left in suspense about how the tariffs deadline would play out until late Monday and were fretting about the uncertainty created by the situation. \nSo far, European officials have held firm to their insistence that the trade measures violate international trading law. The temporary extension is unlikely to satisfy the European Union, whose leaders have said they do not want to negotiate under threat and have demanded a permanent and unconditional exemption from the tariffs. \nIf the tariffs do go into effect after the 30-day reprieve, Europe has promised swift retaliation. It has drawn up a lengthy list of American products it would penalize in return, including orange juice, cranberries, motorcycles and bluejeans. It has also asked to join a dispute China brought at the World Trade Organization against the steel and aluminum tariffs. \n\"The U.S. decision prolongs market uncertainty, which is already affecting business decisions,\" the European Union said in a statement on Tuesday. \"The E.U. should be fully and permanently exempted from these measures, as they cannot be justified on the grounds of national security.\" \nIn a statement, the British government said the move was \"positive,\" while the Australian government said that it \"will ensure our trade relationship continues to grow in a fair and reciprocal manner.\" \nAn extension of the tariff deadline was more widely expected for Canada and Mexico, which are still in negotiations with the United States over Nafta. Although differences of opinion remain, officials from the countries insist they are making quick progress toward a goal of concluding their talks by the end of May. \nCanada and Mexico have said that putting tariffs in place in the middle of these discussions could upend delicate negotiations. On Monday, Prime Minister Justin Trudeau of Canada said he was \"optimistic\" that his country would secure an exemption, arguing that the Trump administration understood that tariffs on Canada would hurt jobs on both sides of the shared border. \nThe administration has also been in talks with Japan, the largest American ally to be left off the initial list of countries that were granted a temporary exemption from the tariffs — in part because of the country's trade patterns, including a large surplus with the United States, but also because the Trump administration hoped to urge the country into one-on-one trade talks. \nBut Prime Minister Shinzo Abe of Japan dashed those plans after visiting the president at his Mar-a-Lago resort in mid-April. Mr. Abe insisted that talks take the form of the United States rejoining the Trans-Pacific Partnership, a multicountry trade deal Mr. Trump withdrew from. Mr. Trump derided the deal, writing on Twitter that it had \"too many contingencies.\" \nThe monthlong reprieve prolongs the state of uncertainty hanging over the global economy, making it difficult for businesses to plan and discouraging them from investing in new factories or hiring more workers. \nThat unpredictability has plagued even steel and aluminum companies that support the measure. Todd Leebow, the president and chief executive of Majestic Steel USA, which buys and sells American-made steel, said the tariffs were already helping to revive the American industry. Still, he noted that his customers did not know where they would be able to purchase metals from, and where prices might head. \n\"From an industry perspective, the challenge that we have is it creates uncertainty,\" Mr. Leebow said. \nBut some said the measures are helping accomplish one of the administration's major goals: combating an overcapacity of metals from China. The European Union and Canada, among others, have introduced steeper measures in recent months to crack down on cheap flows of steel into their markets, and to stop China from shipping steel through their countries to the United States. \n\"There's some evidence that the approach is working,\" said Scott Paul, the president of the Alliance for American Manufacturing, which supports the metal restrictions. He said that temporary exemptions did not worry him, but that they should not be left in place indefinitely or unconditionally. \nOther nations affected by the tariffs have not been so optimistic. \nIn Europe, the tariffs have driven down steel prices, as countries that did not receive exemptions, like Russia, Turkey and India, redirect their shipments from the United States. \nThe flood of imports has hit the European steel industry just as it is bouncing back from a crisis that began five years ago and was caused by steel sold at dumping prices by Chinese producers. \n\"They are worried that another wave of imports could throw the industry back into crisis mode,\" Martin Theuringer, the managing director of the German Steel Federation, an industry group, said of European steel makers. ",
  "title": "White House delays tariffs on E.U., Canada and Mexico for 30 Days",
  "title_page": null,
  "title_rss": null,
  "url": null
}
