{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "The tariffs have increased frictions with U.S. trading partners worldwide and have prompted several challenges before the World Trade Organization. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "7_LL",
  "text": "WASHINGTON, April 30 (Reuters) - President Donald Trump has postponed the imposition of steel and aluminum tariffs on Canada, the European Union and Mexico until June 1, and has reached agreements for permanent exemptions for Argentina, Australia and Brazil, the White House said on Monday. \nThe decisions came just hours before temporary exemptions from the tariffs on these countries were set to expire at 12:01 a.m. on Tuesday. \nIn a statement, the White House said the details of the deals with Brazil, Argentina and Australia would be finalized shortly, and it did not disclose terms. \n\"The administration is also extending negotiations with Canada, Mexico, and the European Union for a final 30 days. In all of these negotiations, the administration is focused on quotas that will restrain imports, prevent transshipment, and protect the national security,\" the White House added. \nA source familiar with the decision said there would be no further extensions beyond June 1 to stave off tariffs. \nPresident Donald Trump has postponed the imposition of steel and aluminum tariffs on Canada, the European Union. \nPresident Donald Trump has postponed the imposition of steel and aluminum tariffs on Canada, the European Union and Mexico until June 1. The decisions came just hours before temporary exemptions from the tariffs on these countries were set to expire at 12:01 a.m. \nTrump on March 23 imposed a 25 percent tariff on steel imports and a 10 percent tariff on aluminum, but granted temporary exemptions to Canada, Mexico, Brazil, the EU, Australia and Argentina. Trump has also granted a permanent exemption on steel tariffs to South Korea as part of a revision of a free trade pact that he sharply criticized. \nTrump has invoked a 1962 trade law to erect protections for U.S. steel and aluminum producers on national security grounds, amid a worldwide glut of both metals that is largely blamed on excess production in China. \nThe tariffs, which have increased frictions with U.S. trading partners worldwide and have prompted several challenges before the World Trade Organization, are aimed at allowing the two U.S. metals industries to increase their capacity utilization rates above 80 percent for the first time in years. \nTrump administration officials have said that in lieu of tariffs, steel- and aluminum-exporting countries would have to agree to quotas designed to achieve similar protections for U.S. producers. \nAustralia's Prime Minister Malcolm Turnbull and the country's Trade Minister Steven Ciobo welcomed the tariff exemption, and said the country would continue to work with Washington to prevent dumping. \n\"The exemption reflects the fair and reciprocal trade relationship Australia shares with the United States and underpins the unbreakable friendship between our two great nations,\" they said in a statement. \nAustralia's sole steel producer Bluescope, which supplies locally made steel to its own factories in the United States, said it was pleased with the exemption. \n\"Now it's time to refocus, and get back to business,\" Managing Director Mark Vassella said in a statement. \nSouth Korea earned its permanent exemption from steel tariffs by agreeing to quotas that will cut its steel shipments by about 30 percent from 2017 levels. Seoul is still subject to U.S. aluminum tariffs. \nMost Asian markets were closed for a holiday on Tuesday but on the London Metal Exchange, aluminum and steel-linked materials eased on prospects supply could be cheaper to come by. \nThe White House said the agreements reflect administration efforts \"to reach fair outcomes with allies to protect our national security and address global challenges to the steel and aluminum industries.\" \nTodd Leebow, president of Majestic Steel USA, a Cleveland-based distributor of domestic steel products, said American steelmakers needed certainty that import protections won't be eroded. \n\"We're hopeful this extension moves us toward the most productive path for our domestic steel industry - the tariffs President Trump announced earlier this year and a quota system to limit the amount of imports flooding our country,\" Leebow said in a statement. \nThe metals tariffs have caused some divisions within Trump's Republican Party, with steel- and aluminum-consuming industries warning higher prices would hurt their competitiveness. \nHouse Ways and Means Committee Chairman Kevin Brady, a pro-trade Republican from Texas, said he would work to ensure the tariffs \"are narrow and targeted to protect our workers and job creators here at home.\" \nBut Canada, Mexico and the European Union have all insisted they will not accept quotas to gain permanent exemptions from the U.S. tariffs. \nThe European Commission said the extension of the temporary exemption prolonged market uncertainty, which was already affecting business decisions. \n\"The EU should be fully and permanently exempted from these measures, as they cannot be justified on the grounds of national security,\" it said in a statement. \nA British government spokeswoman in Washington said the extension for the EU was \"positive,\" but the UK steel and aluminum industries needed safeguarding. \n\"We remain concerned about the impact of these tariffs on global trade and will continue to work with the EU on a multilateral solution to the global problem of overcapacity, as well as to manage the impact on domestic markets.\" \nNegotiations over U.S. steel and aluminum tariff exemptions for Canada and Mexico have also become intertwined with intensified talks to reach an agreement to update the North American Free Trade Agreement. \nCanada is the largest steel exporter to the United States, and its industry is highly integrated with that of its southern neighbor, with raw materials and finished steel crisscrossing the Great Lakes region. \nAny move by the United States to impose tariffs on Canadian steel and aluminum would be a \"very bad idea\" guaranteed to disrupt trade between the two countries, Canadian Prime Minister Justin Trudeau said on Monday. \nIf the EU is subject to tariffs on the 6.4 billion euros ($7.7 billion) of the metals it exports annually to the United States, it has said it will set its own duties on 2.8 billion euros of U.S. exports of products ranging from makeup to motorcycles.",
  "title": "Trump postpones steel, aluminum tariffs until June",
  "title_page": null,
  "title_rss": null,
  "url": null
}
