{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Japan and China agree that a trade war will have serious consequences for the world economy, Japanese Foreign Minister Taro Kono said after a high-level economic dialogue between the world's third and second-largest economies. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "7_M",
  "text": "WASHINGTON — President Trump delayed steep steel and aluminum tariffs for U.S. allies on Monday, putting off a showdown that European leaders warned could escalate into a trade war. \nThe decision, which came hours before a self-imposed deadline, means the European Union, Canada and Mexico will be able to export steel to the United States through June 1 without paying the 25% tariff the administration imposed earlier this year. \nOfficials also announced agreements in principle with Argentina, Australia and Brazil to allow those countries to avoid tariffs for longer. \nTrump announced a 25% tariff on steel and a 10% tariff on aluminum in early March, but offered temporary exemptions to the Europe Union, Canada, Mexico and a number of other allies. Those initial exemptions were set to expire Tuesday. \nThe tariffs are already in effect for other countries, including China and Russia. \nThe tariffs were a central issue in separate meetings Trump held last week with French President Emmanuel Macron and German Chancellor Angela Merkel at the White House. Merkel threatened that European nations would retaliate if the U.S. tariffs take effect, placing their own barriers on American products. \nTrump officials initially said there would be no exemptions, sparking an outcry from Europe and also some Republicans on Capitol Hill concerned that the retaliatory measures would hurt home state industries. European officials had suggested imposing duties on U.S.-made motorcycles, orange juice and bourbon. \nIn a statement Monday, the White House described the 30-day delay as the \"final\" extension for the European Union, Canada and Mexico. \nThe Trump administration has relied on a 1962 law that allows countries to impose trade restrictions for national security purposes. But the president has also justified the tariffs by pointing out “shuttered plants and mills,” and the decades-long slide of manufacturing. \nThe U.S. imported 34.6 million metric tons of steel last year, a 15 percent increase from 2016, according to the U.S. Department of Commerce. Canada is the largest exporter of steel to the U.S., followed by Brazil, South Korea and Mexico. \nOfficials said Monday that the administration reached a final agreement with South Korea on steel. That deal, the outlines of which were previously announced, requires South Korea to limit exports to the U.S. in exchange for an exemption from tariffs. \nCanada and Mexico are negotiating a new trade deal with the U.S. after Trump vowed to walk way from the 1994 North American Free Trade Agreement, calling it \"the single worst trade deal\" the U.S. had ever approved. Metal tariffs for those two countries will likely be tied to that broader negotiation. ",
  "title": "Trump extends exemptions on steel, aluminum tariffs",
  "title_page": null,
  "title_rss": null,
  "url": null
}
