{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "President Trump postpones imposing tariffs on EU and allies",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "7_R",
  "text": "Less than four hours before the midnight deadline, the White House announced it would delay a decision about whether to impose steel and aluminum tariffs on the European Union, Canada and Mexico. \nThe Trump administration announced Monday that it would wait another 30 days before deciding whether to impose tariffs on steel and aluminum imports from the European Union, Canada and Mexico -- temporarily avoiding a potential trade war wth the 28-member bloc ahead of crucial trade talks with China this week. \nThe White House also said it had reached an agreement with South Korea on steel imports following discussions on a revised trade agreement, the outlines of which were previously announced by U.S. and South Korean officials. The administration also announced that it had reached agreements in principle with Argentina, Australia and Brazil on steel and aluminum that will be finalized shortly. \n\"In all of these negotiations,\" the White House statement said, \"the Administration is focused on quotas that will restrain imports, prevent transshipment, and protect the national security.\" \nPresident Trump was considering whether to permanently exempt the EU and Mexico, Canada, Australia, Argentina and Brazil from steel and aluminum tariffs that his administration imposed last month. The White House provided temporary exemptions in March and had until the end of Monday to decide whether to extend them. \nThe EU has said if it loses its exemption it will retaliate with its own tariffs on U.S. goods imported to Europe. \nThe confrontation stems from the president's decision in March to slap tariffs of 25 percent on imported steel and 10 percent on imported aluminum. Trump justified the action by saying it was needed to protect American metal producers from unfair competition and bolster national security. But the announcement, which followed an intense internal White House debate, triggered harsh criticism from Democrats and some Republicans and roiled financial markets. \nAt the time, Trump excluded the European Union, Mexico, Canada, Australia, Argentina and Brazil from the tariffs. \nThat meant the steel tariff covered just 30 percent of all imports, according to Oxford Economics. If all the exemptions were ended, it would have deepened the impact of the tariffs on American companies that use steel and potentially affect financial markets. Stock prices fell nearly 2 percent when the tariffs were announced. \nTwo people familiar with the process said the Trump administration had been considering whether to provide a short-term extension of the exemptions to allow for more time to review the countries' efforts to secure permanent exemptions. \nOne of the officials said the U.S. trade representative has been overseeing the process for all of the countries except for the European Union, whose tariffs are being evaluated by the Commerce Department. \nThe officials spoke on condition of anonymity to describe internal deliberations. \nThe EU and others had been asked to spell out what limits they could accept on the amount of steel they export to the United States, how they would address the issue of excess production of steel and aluminum and how they would support the U.S. before international bodies like the World Trade Organization. Security relationships with the U.S. have also been part of the criteria. \nSouth Korea agreed to limit its exports to the United States as part of broader discussions involved in updating its bilateral trade agreement with the U.S. and was granted a permanent exemption. \nChina, Japan and Russia haven't received exemptions from the duties. That will likely reduce steel shipments from those countries over time. Commerce Secretary Wilbur Ross said late Friday that quotas on imports from Europe and other countries are necessary so imports from those countries don't simply replace Chinese imports. The goal of the tariffs is to reduce total steel imports and boost U.S. production, Ross said. \n\"If you let everybody back out of the tariff, and you let them out of any kind of quota, how would you ever reduce the imports here?\" Ross asked at a conference of business journalists. Ross is set to discuss the issue Monday with EU Trade Commissioner Cecilia Malmstrom. \nGermany, the EU's largest steel exporter to the U.S., accounted for about 5 percent of U.S. steel imports last year. South Korea made up the largest share, shipping about 13 percent of U.S. imports, according to an American Iron and Steel Institute analysis of government data. \nThe EU has compiled a list of retaliatory tariffs worth about $3.5 billion it will impose if its steel and aluminum isn't exempted. \nEuropean leaders have resisted the idea of a quota. German Chancellor Angela Merkel said in a statement Sunday that she discussed the issue with French President Emmanuel Macron and British Prime Minister Theresa May after returning from a White House visit Friday. \nThe three European leaders \"agreed that the U.S. ought not to take any trade measures against the European Union,\" which is \"resolved to defend its interests within the multilateral trade framework,\" Merkel's statement said. \nIn her meeting with Trump, Merkel said, she saw little progress in obtaining permanent exemptions. \"The decision lies with the president,\" she said Friday. \nIn a separate trade battle with China, the United States has threatened to impose tariffs on $150 billion of Chinese goods in retaliation for what it argues are Beijing's unfair trade practices and its requirement that U.S. companies turn over technology in exchange for access to its market. The White House also wants China to agree to reduce its $375 billion goods trade surplus with the U.S. \nChina has said it would subject $50 billion of U.S. goods to tariffs if the U.S. taxes its products. Trump has announced that an administration delegation led by Treasury Secretary Steven Mnuchin, U.S. Trade Representative Robert Lighthizer and trade adviser Peter Navarro will visit Beijing for negotiations on Thursday and Friday this week. \nIn addition to Mnuchin, Lighthizer, Ross and Navarro, the group will include economic adviser Larry Kudlow, U.S. Ambassador to China Terry Branstad and Everett Eissenstat, deputy assistant to the president for International Economic Affairs. \nWe're going to have very frank discussions,\" Mnuchin in an interview broadcast Monday on Fox Business. \nMost analysts, however, think it's unlikely the talks will reach permanent agreements and will more likely mark the start of longer-term negotiations.",
  "title": "White House delays tariffs on EU, Canada, Mexico ahead of tense China talks",
  "title_page": null,
  "title_rss": null,
  "url": null
}
