{"authors": [], "date_download": null, "date_modify": null, "date_publish": null, "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "40_10ecb", "text": " Apple's senior vice president of Worldwide Product Marketing, Philip Schiller, delivered the address and detailed the major revisions to the 17 '' MacBook Pro. First off, the 17 '' MacBook Pro will be, as Apple puts it, \"the world's thinnest and lightest 17-inch notebook, '' coming in at less than an inch thick (0.98 '' to be precise) and with an overall weight of 6.6 pounds. Like it's smaller siblings that were given a facelift back in October, the new 17 '' MacBook Pro will utilize an aluminum unibody design that brings the behemoth notebook into the new, \"greener '' future. The new 17 '' MacBook Pro achieves EPEAT Gold status that identifies the device as an environmentally responsible solution. As part of its EPEAT Gold status, the new 17 '' model is reportedly free of many of the harmful toxins found in comparable notebooks that have adverse effects on the environment during disposal. As part of the new MacBook family, the 17 '' MacBook Pro incorporates an arsenic and mercury-free glass LED-backlit display. But beyond the environmental improvements, the biggest news regarding the latest MacBook Pro is its revolutionary battery system. Through the use of advanced chemistry, intelligent monitoring, adaptive charging technology, and a multi-cell design that Apple claims achieves three times the industry standard in battery life. The new battery system will deliver eight hours on a single charge and can be recharged up to 1,000 times in a single lifespan. On the performance side, the 17 '' MacBook Pro has similar performance specs to previous MacBook Pro models. The processor, memory, and drive specs on the new model are as follows: The new model incorporates all of the usual MacBook Pro luxuries, such as built-in iSight, three USB ports, mini-display port output, a FireWire 800 port, and ExpressCard/34 support. Similar to the other MacBook models, the trackpad has been updated to incorporate Apple's new multi-touch gestures and buttonless design. The new 17 '' MacBook Pro will come in one default configuration with a MSRP of $ 2,799, however, users will be able to upgrade their notebook with Apple's built-to-order program. Optional upgrades include a 8GBs of DDR3 memory, a 320GB hard drive, a 128GB or 256GB solid state drive, and various display output alternatives. If the glass LED-backlit display causes too much glare for you, Apple also offers an anti-glare display on the 17 '' MacBook Pro for $ 50 extra. The new 17 '' MacBook Pro will be shipping at the end of this month.", "title": " While Apple's final keynote address at the annual MacWorld convention in San Francisco did n't contain the iPhone-related announcements many had hoped for, we were given all of the details on Apple's latest revamp to their largest and most powerful MacBook Pro.", "title_page": null, "title_rss": null, "url": null}