{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "Members of the migrant caravan at the border wall in Tijuana on Sunday.",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "6_L",
  "text": "TIJUANA, Mexico — A long, grueling journey gave way to what could be a long, uncertain asylum process Sunday as a caravan of immigrants finally reached the border between the United States and Mexico, setting up a dramatic moment and a test of President Trump's anti-immigrant politics. \nMore than 150 migrants, part of a caravan that once numbered about 1,200 and headed north in March from Mexico's border with Guatemala, were prepared to seek asylum from United States immigration officials. \nBut in what was likely to be one of many curves on the road, the migrants were told Sunday afternoon that the immigration officials could not process their claims, and they would have to spend the night on the Mexican side of the border. \nIt was only the latest twist in an immigration drama that has played out in relative obscurity in recent years. Usually during the Easter season, immigrants have headed north together as a form of protection against the kidnappers, muggers and rapists who stalk the migrant trail, and to draw attention to their plight. But this year it has become a volatile flash point in the immigration debate ignited by Mr. Trump. \nFor the migrants, the moment was a fraught, deeply personal one. \nMario Quintanillo, 30, and Cecilia Sarai Carillo, 23, who are from El Salvador, were among four couples who wed at the beach in Tijuana on Sunday morning, in the company of their 2-year-old daughter, Daryeline Ariana. \nWhere Does Trump's Border Wall Stand Today? \nAfter more than a year in office, President Trump has been unable to deliver on his promise of a wall on the border with Mexico. \nThey planned to apply for asylum at the American border, but knew there was a good chance that they would be split up during the process — possibly for months. \n \"But I'm going with the feeling that it's going to be worth the effort,\" said Mr. Quintanillo. He said his family were fleeing a gang that had attacked him and killed a close relative. \"In the name of God, everything is possible,\" he said. \nOverlaying the personal struggles was a dense tangle of politics and policy — the ill will between Mr. Trump and Mexico that began the day he announced his candidacy; the acrimony between Mr. Trump and Gov. Jerry Brown of California over immigration; the politics of sanctuary cities; and the political logjam in Congress over funding Mr. Trump's proposed border wall. \nIt all plays out in the context of Mr. Trump's goal of making immigration a galvanizing issue in the midterm elections with Republicans worried about losing control of the House and perhaps the Senate. \nHeather Cronk, co-director of Showing Up for Racial Justice, one of several American advocacy groups that have been helping the caravan and its participants, traveled to Tijuana to support the migrants in the final stretch. \nFamilies from the caravan waiting for a meal. \n\"For us, this is all about who we are as a country,\" she said. She added: \"This is an existential moment. This is a spiritual moment. I want it to be true that when we say, ‘Liberty and justice for all,' we mean it.\" \nIt is a debate Mr. Trump apparently relishes. \nWith the migrants on the doorstep of the United States, Mr. Trump, in a tweet last week, ratcheted up his rhetoric, vowing \"not to let these large Caravans of people into our Country.\" \nMr. Trump repeatedly came back to immigration issues at a rally in Michigan on Saturday night, saying at one point: \"If we don't get border security, we'll close down the country,\" apparently referring to a government shutdown when a funding deadline is reached in September. \nOther administration officials have also been vocal. \nAttorney General Jeff Sessions called the caravan \"a deliberate attempt to undermine our laws and overwhelm our system.\" \nJoined by supporters and dozens of members of the news media, the migrants gathered in a park on the Pacific Ocean about 10 a.m. local time and then later on a pedestrian plaza in front of a community center in downtown Tijuana. Scores of supporters, some of whom had walked from as far as Los Angeles, rallied Sunday morning just north of the fence separating the United States from Mexico on the American side of the oceanfront park. \nWhat was supposed to be the final act of the caravan began about 3:30 p.m., when more than 150 of the participants, accompanied by relatives, supporters and the press, marched several blocks to a border crossing in Tijuana called El Chaparral. As they walked, they chanted and waved Honduran flags. \nTo qualify for asylum, applicants must prove they have been persecuted or fear persecution based on their race, religion, nationality, political beliefs or membership in a particular group. \nPeople who request protection at a United States entry point must be referred to an asylum officer for a screening, known as a credible-fear interview. If the officer finds that an applicant has a chance of proving fear of persecution, the person must then present his or her case before a judge. More than three quarters of applicants pass that initial review. \n\"We're only sending people who we think will pass the credible-fear interview,\" said Nicole Ramos, a volunteer immigration lawyer helping the caravan. \nBut Customs and Border Protection, whose officers are stationed at ports of entry, announced late Sunday that it had exhausted its capacity to handle people traveling without documents. \nA young boy from Honduras standing near the border wall. \nStill, caravan organizers escorted some 50 participants along the long, elevated pedestrian walkway at El Chaparral that leads from Tijuana to the entrance to the United States in San Diego. At the gate leading into the American immigration checkpoint, American border authorities reaffirmed that they would not be able to process any more asylum-seekers on Sunday. \nAlex Mensing, project coordinator for Pueblo Sin Fronteras, a transnational group that organized the caravan, told reporters gathered at El Chaparral that the migrants would remain at the gate, overnight if necessary, until border officials once again had the capacity to process them. \n\"We wish that the United States government were capable of accepting more than a few hundred asylum seekers at any given time, since we can certainly pick up more than a 1,000 people in an ICE raid on any given day,\" he said, referring to Immigration and Customs Enforcement, an arm of the Homeland Security Department. \nMeanwhile, the rest of the asylum seekers, their relatives and supporters laid out blankets on a plaza outside the entrance to El Chaparral and prepared for a long, chilly night. \nWhen they get a chance to make their case, migrant families that request asylum at the port of entry are likely to be placed on buses to Texas, where they will remain in detention centers for mothers and children. Adult men are likely to be detained in any number of facilities across the country that hold undocumented immigrants. \nIt is in these facilities that the migrants would be screened by United States immigration officials over the next several days. If they pass the credible-fear interview, the migrants will be allowed to make their case for asylum before an immigration judge, a process that unfolds over several months or longer. \nMigrants, typically fitted with ankle monitors, often are allowed to travel to the interior of the country, where they stay with relatives or friends while their cases run their course. \nMr. Trump, however, has denounced that practice because some migrants have skipped their court hearings; he dismissed it as \"catch and release.\" In recent months, migrant advocates say, the Trump administration has kept many migrants seeking asylum in detention. \nFor all the high political stakes, the human stakes for the individual migrants planning to seek asylum Sunday were at least as high. \nByron Claros, a Salvadoran immigrant, joined the caravan with his 18-year-old brother, Luis Alexander Rodriguez, and their stepfather, Andres Rodríguez. \nMr. Claros and Mr. Rodriguez planned to petition for asylum Sunday afternoon; their stepfather, after consultation with volunteer lawyers in Tijuana, decided that his case for sanctuary was not strong enough and that he would remain behind in Mexico. \n\"The hour I've waited for my entire life has finally arrived,\" Mr. Claros said early Sunday afternoon as he, hundreds of migrants, scores of their supporters, reporters and cameramen gathered in and in front of a community center and cafe in the downtown district of Tijuana, blocks from the border crossing. \nMr. Rodriguez said he was nervous, \"because the United States can support our rights but can also deny us our rights.\" \nStill, he said, there was only one way to push: north. \n\"We've fought too much to get here,\" he said. \"And we're here.",
  "title": "Migrant caravan of asylum seekers reaches U.S. border",
  "title_page": null,
  "title_rss": null,
  "url": null
}
