{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "The White House mobilized the National Guard, threatened prosecution and likened the asylum-seekers to a national security threat. They're coming anyway.",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "6_LL",
  "text": "SAN DIEGO ― President Donald Trump whipped himself into a fury earlier this month after learning that a caravan of hundreds of Central Americans was traveling through Mexico, planning to seek asylum in the United States. Shortly after learning about it, he mobilized the National Guard. He railed against what he viewed as a \"crisis\" at the border, despite the fact that illegal entries have plummeted to their lowest level since 1971. The secretary of homeland security issued a statement likening the caravan's organizers to \"smugglers\" and the attorney general threatened to prosecute them. \nBut hundreds of participants in the caravan made their way to the U.S.-Mexico border on Sunday anyway. And despite Trump's fulminations against them, it's unclear whether his administration has any practical way to stop them from crossing in the coming days. \nThe caravan's organizers, immigrant rights activists and legal observers marched toward International Friendship Park, which straddles the U.S.-Mexico border, as the caravan's participants marched from Tijuana to San Diego on Sunday morning. \nOn the U.S. side of the border, a group of about 100 people chanted, \"No borders! No wall! Sanctuary for all!\" as they marched along the beach toward the port of entry. Roughly 200 of their counterparts in Mexico gathered in front of the metal fencing that divides the two countries, with more than a dozen people hoisting themselves atop the barrier. \n\"We have to push back against this administration,\" demonstrator Laiken Jordahl, a borderlands campaigner for the nonprofit Center for Biological Diversity, told HuffPost. \"Its culture of hate, bigotry and fear cannot be accepted. The administration doesn't even talk to us, we had to come out and march.\" \nAnother demonstrator, Roberto Saravia from Los Angeles, said: \"This goes back further than the Trump administration. I find it ridiculous that any time there is an issue in the U.S., immigrants get scapegoated, they get mistreated, they get criminalized just for existing. This border is just a divide that shouldn't be here and I want to see it gone ― it shouldn't divide us.\" \nBy Sunday afternoon, a group of about 150 of the caravan's members had begun crossing into the U.S., along with legal advisers, organizers said. \nBut U.S. Customs and Border Protection warned it would limit the number of asylum-seekers making claims at the San Ysidro port of entry. \"Depending upon port circumstances at the time of arrival, those individuals may need to wait in Mexico as CBP officers work to process those already within our facilities,\" CBP Commissioner Kevin McAleenan said in a statement. \nThe 150 migrants, many of whom were children, spent the night sleeping on the ground outside, waiting to present their claims to U.S. immigration officials. By Monday morning, they had yet to speak to immigration officials and remained on the Mexican side of the border, organizers said. \n\"They're using the excuse of capacity to keep people from coming,\" said Nicole Ramos, an attorney with the nonprofit group Al Otro Lado, who has provided legal services to the migrants traveling with the caravan. \"The people that are waiting outside are children, infants, a disabled woman who relies on her mother to take care of all her needs, trans women ― these are the most vulnerable asylum seekers. What the U.S. is doing is creating a humanitarian crisis that doesn't need to be created.\" \nThe Trump administration is hoping that it won't have to let the migrants into the U.S. at all. And his administration's threats appear to be dissuading some. Between 150 and 200 Central American migrants plan to present asylum claims in the coming days, organizers said, while roughly another 150 have yet to decide whether to cross. \nBut for all the noise and slow-walking of the asylum seekers' claims, it remains to be seen whether the White House's actions do anything to push away those who do make asylum claims. \nTrump's ire at the caravan stems from larger concerns he's expressed since he first started running for president three years ago. He wants the U.S. to stop releasing unauthorized immigrants caught at the border with notices to appear in immigration court instead of uniformly detaining or deporting them — a practice he and his supporters disparagingly call \"catch and release.\" Attorney General Jeff Sessions is one of his most enthusiastic partners in that project. \nUnfortunately for them, ending the practice is not currently possible under U.S. law. When space in detention centers runs out, there's simply no place to put people who can't be quickly deported. Many immigrants from Mexico can be deported quickly. But many of the people crossing the border these days are Central American children and families, who aren't as easy to deport — and generally can't be detained for long. Unaccompanied children must be released to the Office of Refugee Resettlement, and the mothers cannot usually be locked up with their kids for longer than three weeks due to a federal court order. Migrants have a right to apply for asylum, whether or not they get detained in the process. And immigrants who get picked up within the interior of the country often qualify for bond hearings. \nA group of several dozen immigrant rights activists and legal observers march toward the U.S.-Mexico border in San Diego on April 29. They're there to witness the arrival of a caravan of Central American migrants who plan to request asylum in defiance of repeated threats from Trump administration officials. \nNone of this matters to the Trump administration, whose actions and statements have likened the arrival of a few hundred Central Americans seeking asylum to a national security crisis. In an attempt to deter them, Trump mobilized the National Guard to help patrol the four Southwest border states, despite the fact that its presence will be purely ornamental — the National Guard can't make immigration arrests, and the caravan's members plan to travel through legal ports of entry. \nHomeland Security Secretary Kirstjen Nielsen chipped in with a similarly aggressive but toothless statement last Wednesday, saying the department was \"monitoring\" the caravan's movements. She encouraged asylum-seekers to stay in Mexico. \n\"Let me be clear,\" Nielsen's statement read. \"We will enforce the immigration laws as set forth by Congress. If you enter our country illegally, you have broken the law and will be referred for prosecution. If you make a false immigration claim, you have broken the law and will be referred for prosecution. If you assist or coach an individual in making a false immigration claim, you have broken the law and will be referred for prosecution.\" \nNielsen's repeated statements targeting the caravan met with criticism from Rep. Bennie Thompson (D-Miss.), the ranking member of the House Committee on Homeland Security. \n\"It's overkill,\" Thompson told HuffPost. \"You would have expected [Trump] to have been briefed by intelligence officials exactly who was headed this way. … We know who they are. We know where they are. And we even know why they're coming. So to try to elevate this into some heightened sense of threat, it just didn't measure up.\" \nSessions had his own response to the caravan, issuing a statement Monday saying he'd \"directed our U.S. Attorneys at the border to take whatever immediate action to ensure that we have sufficient prosecutors available.\" \nIt's unclear what practical consequences any of these threats will have. The people whom Nielsen accuses of \"coaching\" the caravan's members are lawyers and immigrant rights advocates counseling migrants about the process for claiming asylum. And crossing through a legal port of entry to ask for asylum, as the caravan's members plan to do, doesn't expose them to prosecution, as Sessions contends. \n\"It's typical anti-immigrant fear-mongering,\" said Alex Mensing, a project coordinator for the caravan's main organizing group, Pueblos Sin Fronteras. \"The right-wing media and the administration have been trying really hard to make it look like there are no legitimate asylum-seekers, and that's just not true. And it's not for them to decide anyway.\"",
  "title": "Migrant caravan arrives at U.S. border, despite Trump's threats",
  "title_page": null,
  "title_rss": null,
  "url": null
}
