{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "6_M",
  "text": "The Arizona Republic's Daniel Gonzalez reports on supporters of the migrant caravan who have gathered at the border fence Sunday, April 29, 2018. \nAfter traveling 2,500 miles through Mexico, about 200 migrants from Central America prepared to walk together as a group Sunday and present themselves to U.S. border officers at the San Ysidro port of entry near San Diego. \n\"Yes, I'm nervous,\" said 18-year-old Karina Gomez from Nicaragua who traveled in the migrant caravan with her 44-year-old mother, Emilia Palacio. \"I'm nervous because I don't know if we will be separated and even more what will happen next.\" \nHer feelings captured the anxiety that was palpable among the migrants who traveled to the United States in a caravan that President Trump has made clear are not welcome, first by deploying National Guard troops to the southern border and then dispatching teams of immigration judges, prosecutors and credible-fear officers to process asylum claims quickly, a move immigrant advocates say is aimed at deporting migrants with tenuous cases as quickly as possible. \nOn Sunday morning, before heading for the port, the migrants took buses from shelters in the center of Tijuana to the spot where the border fence reaches the Pacific Ocean.There they were greeted by several hundred supporters who chanted and cheered in an hour long rally in solidarity with the migrant caravan. \n\"The hard part starts now,\" said Irineo Mujica, one of the main organizers of Pueblo Sin Fronteras, the transnational group that organized the caravan, which was intended to offer protection to migrants by traveling safer as group and also call attention to the poverty, gang violence and political turmoil in Central America driving families to flee. \nOn a cement platform overlooking the beach and the border fence beyond, four young couples exchanged vows in a hasty marriage ceremony. \nThe couples, several with young children, traveled together but had never been officially married. \nBut presenting themselves as married couples, they hoped to reduce the chances of being separated while being processed inside the U.S. and perhaps increase their chances of being released while they pursued their asylum claims, said Emma Lozano, a Christian pastor from Chicago who performed the ceremony. \nSupporters of #migrant #caravan from both sides of the border have converged at fence between #Tijuana and #San Diego. \nAbout 80 U.S. families have also offered to sponsor migrants seeking asylum, said Heather Cronk, co-director of Showing Up For Racial Justice, a group that supports racial-justice issues. \nHaving an American sponsor might improve migrants chances of being released from detention while pursuing asylum in the U.S., she said. \nCentral American migrants and supporters of the migrant caravan from both sides of the border have converged at the fence between Tijuana and San Diego near Friendship Park in Tijuana, on April 29, 2018. These migrants will decide whether to present themselves to U.S Border officers at the San Ysidro port of entry and apply for asylum. \n'Undocumented, unafraid' \nOn the other side of the border, in San Diego, about 100 people marched along the beach from Border Field State Park to the border. Over the crashing of waves on the shore, they banged drums and chanted phrases like, \"undocumented, unafraid!\" \nMany of them had spent the past week walking from Los Angeles to San Diego as part of the March Without Borders. The more than 100-mile walk was intended to reflect support for the caravan. \nAlong the way, the participants had watched videos of the migrants walking through Mexico and chanting; they called out the same refrains as they marched through Southern California. They traversed conservative sections of Orange County. One participant said people threw eggs at the group. \n\"It was intense,\" said Marcia Suarez, 23, an Argentine immigrant who lives in New York City. But, she said, \"the caravan went through much worse and they kept going.\" \nAnother march participant, 23-year-old Monica Torres, teared up when she finally reached Friendship Park Sunday morning and could see the migrants and their supporters through the tall fence. \nThis time, the two groups were divided by the fence, but sang the same chants. \n\"To be honest, its a bit surreal,\" said Torres, who is protected by Deferred Action for Childhood Arrivals, the program created via executive action by President Barack Obama that Trump has been trying to end. She said it was the first time she had been to the border since she'd crossed from Mexico into the U.S. 15 years ago. \nShe defended the migrants' right to seek asylum in the United States. Homeland Security Secretary Kirstjen Nielsen has encouraged the migrants to seek shelter in the first safe country they enter, including Mexico. \n\"Mexico is not a country to seek asylum,\" Torres said. \"We migrated from there. Mexico is not an option.\" \nCentral American migrants and supporters of the migrant caravan from both sides of the border have converged at the fence between Tijuana and San Diego near Friendship Park in Tijuana, on April 29, 2018. These migrants will decide whether to present themselves to U.S Border officers at the San Ysidro port of entry and apply for asylum. \nHurdles to asylum\nRubilio Mendez, 34, a migrant from Guatemala who traveled with the caravan, said he has no family in the U.S. and was unaware of the program matching migrants with American sponsors. \nMigrants who don't pass credible-fear interviews, the first hurdle to applying for asylum, risk being quickly deported. \nRubilio Mendez said he fled Guatemala after gangs threaten to kill him, leaving behind his wife and five daughters. \nIf deported back to Guatemala by the U.S, he said he would not stay. \n\"I can't go back to Guatemala,\" he said. \"I will be killed.\" \nCentral American migrants and supporters of the migrant caravan from the U.S. side looking south into Mexico on April 29, 2018. \nIn Friendship Park, Olimpia Blanco, a 23-year-old immigrant from Mexico who lives in Los Angeles, carried a sign reading, \"queer and trans solidarity.\" \nThe message was intended as a show of support for the Central American transgender women seeking asylum. \nBlanco said she was happy to see rainbow signs on the Mexican side of the border and a multi-colored kite whipping around in the sky read, \"refugees welcome here.\" She hoped the symbolism would be comforting to the gay and transgender migrants seeking safety. \n\"It's a universal sign of, 'OK, there's someone here that's thinking of me, too,'\" she said. \nMarely Ramirez of Coronado walked with the group, waving a huge Honduran flag. Many of the migrants in the caravan are fleeing violence and political instability in that country. \nRamirez is from Mexico, but she said she identifies with the struggles of those seeking opportunities in the U.S. \n\"I am an immigrant and I know the struggles of anyone who is coming from south of that border, trying to have a better life,\" she said. \nThe San Diego event was peaceful. There didn't appear to be any anti-immigrant protesters present.",
  "title": "Migrant caravan: Rallies, weddings before migrants enter the United States to seek asylum",
  "title_page": null,
  "title_rss": null,
  "url": null
}
