{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "6_R",
  "text": "Asylum-seekers in a \"caravan\" from Central America are poised on Sunday to test the Trump administration's tough immigration rhetoric as they begun turning themselves in to border inspectors at San Diego's busy San Ysidro border crossing. \nAccording to the Associated Press, U.S. immigration lawyers are telling caravan participants who traveled through Mexico to the border with San Diego that they face possible separation from their children and lengthy detentions. \nMigrants walk to the place where they will be meeting with immigration lawyers, seeking to enter the United States from Tijuana, Mexico, Friday, April 27, 2018.  \nImmigrants making a walk to the place where they'll have a chance to consult with lawyers. \n\"We are the bearers of horrible news,\" Los Angeles lawyer Nora Phillips told the AP during a break from legal workshops for the migrants at three Tijuana, Mexico, locations where about 20 lawyers gave free information and advice. \"That's what good attorneys are for.\" \nPresident Donald Trump and members of his Cabinet have been tracking the caravan, calling it a threat to the U.S. since it started March 25 in the Mexican city of Tapachula, near the Guatemala border. They have promised a stern, swift response. And the president has been critical of the caravan's steady approach to the U.S. And he has tweeted about it in strong, critical language. \n\"Mexico has the absolute power not to let these large “Caravans” of people enter their country. They must stop them at their Northern Border, which they can do because their border laws work, not allow them to pass through into our country, which has no effective border laws,\" he tweeted earlier this month. \nIn a statement Saturday, Chief Patrol Agent Rodney Scott said there had been several attempted illegal entries by people associated with the caravan. \nOver the past 24-hours several groups of people associated with the Central American Caravan have illegally entered the United States without immigration documents by climbing over the dilapidated scrap metal border fence on either side of the San Ysidro Port of Entry,\" he said.  \"In several of these incidents, children as young as 4-years-old, and in one case a pregnant female, were detected entering the United States illegally through a dark, treacherous canyon that is notorious for human and drug smuggling. As a father myself, I find it unconscionable that anyone would expose a child to these dangerous conditions, especially when there is a legitimate Port of Entry within a few miles of these dangerous canyons.\" \nHe also urged those contemplating illegal entry to \"think before you act. If anyone has encouraged you to illegally enter the United States, or make any false statements to U.S. government officials, they are giving you bad advice and they are placing you and your family at risk. We are a very welcoming country but just like your own house, we expect everyone to enter through our front door, and answer questions honestly.\" \nFor their part, the AP reported, many of the immigrants appear ready to confront the U.S. response and potential hardships head-on. \nKenia Elizabeth Avila, 35, appeared shaken after the volunteer attorneys told her Friday that temperatures may be cold in temporary holding cells and that she could be separated from her three children, ages 10, 9 and 4. \nBut she said in an interview with the wire service that returning to her native El Salvador would be worse. She fled for reasons she declined to discuss. \n\"If they're going to separate us for a few days, that's better than getting myself killed in my country,\" she said. \nLawyers who went to Tijuana denied any coaching of the roughly 400 people in the caravan who recently arrived in the Mexican city, camping out in shelters near some of the city's seedier bars and bordellos. \nSome migrants received counseling to assess the merits of their cases, and groups of the migrants with their children playing nearby were told how asylum works. \nAsylum-seekers are typically held up to three days at the border and then turned over to Immigration and Customs Enforcement. If they pass an initial screening, they may be detained or fitted with ankle monitors and released. \nNearly 80 percent of asylum-seekers passed the initial screening from October through December, the latest numbers available, the AP said, but few are likely to eventually win asylum. \nJose Cazares, 31, said he faced death threats in Honduras because a gang member suspected of killing the mother of his children learned one of Cazares' sons reported the matter to the authorities. \n\"One can always make up for lost time with a child, but if they kill him, you can't,\" he said to the AP outside a tent in a migrant shelter near the border barriers.",
  "title": "Asylum-seeking immigrant 'caravan' poised to test Trump administration",
  "title_page": null,
  "title_rss": null,
  "url": null
}
