{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "6_RR",
  "text": "April 29 (UPI) — A caravan of hundreds of migrants is expected to reach the border between the United States and Mexico on Sunday, with many in search of asylum. \nMembers of the caravan gathered at Friendship Park in Tijuana, where some will have to remain as they wait to be processed by U.S. authorities at the San Ysidro Port of Entry, according to U.S. Customs and Border Protection. \n\"Depending on port circumstances at the time of arrival, individuals may need to wait in Mexico as CBP officers work to process those already within our facilities,\" said Pete Flores, director of field operations for CBP in San Diego. \nThe effort was organized by Pueblos Sin Fronteras, translated from Spanish as People Without Borders, which is not the same group as the Washington-based non-profit that provides computer classes to international residents of the District of Columbia. \nUpon reaching the border, migrants are expected to turn themselves in peacefully at the port of entry and ask for asylum. \n\"People who have a legitimate fear of persecution under US law have a right to present their case,\" said Rep. Zoe Lofgren, top Democrat on the House subcommittee on immigration. \"That's not a violation of immigration law. That's a part of immigration law.\" \nThe group marching toward the border Sunday is expected to be the largest to approach border officials and demonstrators arrived at both sides of the border fence Sunday in support of the caravan. \nCBP Chief Patrol Agent Rodney S. Scott said several groups of people associated with the caravan illegally entered the United States by climbing over a metal fence. \n\"We are a very welcoming country but just like your own house, we expect everyone to enter through our front door, and answer questions honestly,\" Scott said. \nSimilar migrant groups have made their way toward the border within the past few years but this group has faced vocal opposition from President Donald Trump, whose administration warned of arrests as about 130 immigrants arrived at the border Wednesday. \n\"This is not ideal for us to have this many people, this much publicity,\" leader of the Pueblo Sin Fronteras caravan Irineo Mujica said. \nMujica added \"it's been really really good that we are able to see what is the problem,\" highlighting the violence that prompted members of the caravan to seek asylum.",
  "title": "Members of migrant caravan prepare to reach U.S.-Mexico border",
  "title_page": null,
  "title_rss": null,
  "url": null
}
