{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Nov. 12, 2007  Dial - in number : +1 877 268 9324.  Conference ID : 24256919.", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "44_2ecbplus", "text": " HP today announced that it has signed a definitive agreement to acquire EYP Mission Critical Facilities Inc. (EYP MCF), a consulting company specializing in strategic technology planning, design and operations support for large - scale data centers.  By acquiring EYP MCF, HP will be better able to help customers to transform their data centers, optimize energy efficiency and position them for future business growth.  Financial terms of the transaction were not disclosed.  Headquartered in New York, EYP MCF has approximately 350 employees with 13 offices in the United States and the U.K.  The firm provides mission - critical services to enterprises around the world in business sectors including financial services, telecommunications, technology, broadcast, manufacturing and healthcare, as well as numerous federal, state and county government agencies.  From data centers and command and control centers, to trading floors and supercomputing sites, EYP MCF has designed hundreds of technology - intensive, high - performance facilities where monitoring, operational and energy efficiencies are top - priority business requirements.  EYP MCF ’ s capabilities – particularly its expertise in energy - efficient operations – complement HP ’ s extensive Data Center Services and cost - saving power and cooling solutions, such as Dynamic Smart Cooling.  “ The data center is the foundation of IT for enterprises, an essential building block for driving business growth and adapting to changing business objectives, ” said John McCain, senior vice president and general manager, HP Services.  “ Acquiring EYP Mission Critical Facilities boosts HP ’ s ability to help customers transform their data centers and build dynamic computing environments from the ground up. ”  Peter Gross, chief executive officer of EYP MCF, said, “ Worldwide data center requirements are rapidly growing, with significant year - over - year increases in power consumption, which is fueling demand for energy - efficient power and cooling strategies.  HP and EYP Mission Critical Facilities will drive innovation by integrating IT infrastructure into the planning and design of the data center, enabling the customer ’ s whole organization to be more energy efficient and adaptive. ”  The transaction is subject to certain closing conditions and is expected to be completed within HP ’ s first fiscal quarter.  Media teleconference  HP will hold a media teleconference to discuss the announcement at 7 : 15 - 7 : 45 a. m. PT today.  A replay of the call will be available later in the day.  About EYP Mission Critical Facilities, Inc.  EYP Mission Critical Facilities, Inc. (www. eypmcf.com) is a consulting firm whose unique approach to achieving clients ’ energy - efficient operational continuity is based upon the integration of strategic technology planning, innovative design and on - site support.  Through developing proprietary products and processes, authoring technical white papers, and presenting at international conferences, EYP MCF is recognized as a worldwide thought leader in the mission - critical industry.  About HP  HP focuses on simplifying technology experiences for all of its customers – from individual consumers to the largest businesses.  With a portfolio that spans printing, personal computing, software, services and IT infrastructure, HP is among the world ’ s largest IT companies, with revenue totaling $100.5 billion for the four fiscal quarters ended July 31, 2007.  More information about HP (NYSE : HPQ) is available at http : / / www. hp.com.", "title": " HP to Expand Data Center Services with Acquisition of Global Consulting Company EYP Mission Critical Facilities.", "title_page": null, "title_rss": null, "url": " http : / / www. hp.com / hpinfo / newsroom / press / 2007 / 071112xa. html"}