{"authors": [], "date_download": null, "date_modify": null, "date_publish": " The Q10 features :  3.1″ SuperAMOLED display, 720×720 resolution at 330ppi  Blackberry 10 OS  2GB RAM  1080p video recording", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "42_3ecbplus", "text": " BlackBerry fans take note as T - Mobile has confirmed the availability of the QWERTY - based Q10.  Business customers will get first crack with registration beginning April 29th, with consumer availability coming sometime afterwards.  T - Mobile says \"additional details, including availability and pricing, will be shared at a later date.\"  Word has it that the April 29th registration for business customers will turn into a late May launch, but we're happy with confirmation that BlackBerry fans have another choice in the future.  Dual - core 1.5GHz processor  35 - key physical QWERTY keyboard  16GB internal memory  8 megapixel rear facing camera  2 megapixel front - facing camera  LTE, HSPA+ connectivity  NFC  Statement :  T - Mobile USA continues to add to its growing 4G LTE smartphone portfolio with the BlackBerry® Q10.  The BlackBerry Q10 combines BlackBerry's classic QWERTY keyboard and a touch screen with the power of the BlackBerry® 10 platform that delivers all the speed and connectivity customers demand to help them keep moving.  T - Mobile customers can take advantage of the BlackBerry Q10 smartphone's premium hardware, advanced communications and multimedia features on a blazing - fast nationwide 4G network.  \"With the powerful combination of BlackBerry's new BlackBerry 10 platform, the company's long - standing security features and BlackBerry's best QWERTY keyboard, the BlackBerry Q10 will be another great smartphone option for our business customers,\" said Drew Kelton, executive vice president of business markets at T - Mobile.  Beginning April 29th, business customers interested in the BlackBerry Q10 from T - Mobile can register athttp : / / business. t - mobile.com / blackberry - q10.  Additional details, including availability and pricing, will be shared at a later date.", "title": " T - Mobile Confirms QWERTY - Based BlackBerry Q10 Availability.", "title_page": null, "title_rss": null, "url": " http : / / www. tmonews.com / 2013 / 04 / t - mobile - confirms - qwerty - based - blackberry - q10 - availability /"}