{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "President Trump and Melania Trump, the first lady, welcomed President Emmanuel Macron of France and his wife, Brigitte, to the White House on Tuesday. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "4_L",
  "text": "WASHINGTON — President Trump signaled on Tuesday that he was open to a new arrangement with European allies that would preserve the Iran nuclear agreement by expanding and extending its terms to constrain Tehran's development of missiles and other destabilizing activities in the Middle East. \nHosting President Emmanuel Macron of France at the White House, Mr. Trump again assailed the agreement made by the Obama administration as \"insane\" and \"ridiculous,\" but said he could agree to \"a new deal\" negotiated by American and European officials if it was strong enough. He made no commitment, however, leaving it unclear whether he will pull out of the agreement by a May 12 deadline he has set to either \"fix\" the Iran agreement or walk away from it. \nAt the same time, Mr. Trump signaled more optimism about brokering a nuclear accord with North Korea as he prepares for a summit meeting with its leader, Kim Jong-un, in May or early June. Dispensing with harsh criticism of the past, Mr. Trump even praised Mr. Kim in strikingly positive terms, calling the head of one of the world's most authoritarian governments \"very open and very honorable.\" \nThe discussion with Mr. Macron illustrated how the separate nuclear standoffs with Iran and North Korea have increasingly intersected, with far-reaching consequences for American foreign policy in the Middle East, Asia and Europe. Mr. Trump's decision next month to keep or dump the Iran nuclear agreement will inevitably influence the anticipated talks with North Korea just days or weeks later as Mr. Kim weighs whether he can reach a deal with the American president. \nMr. Macron came to Washington as the emissary from European allies anxious to persuade Mr. Trump to preserve the Iran agreement while American and European negotiators seek to create side deals intended to further restrain Tehran. Iran presumably would not be part of these agreements, but they would outline standards for its behavior that, if violated, would prompt the West to reimpose sanctions. \nPeople gathered for the arrival ceremony for Mr. Macron on the South Lawn of the White House. \nMr. Trump, who likes to leave his options open and make his decisions at the last moment, was coy about whether he would go through with his threat to tear up the Iran agreement by the deadline he set for next month. Aides said he hoped to push back against Mr. Macron's entreaties strongly enough that the Europeans would understand that they needed to accept tougher limits on Tehran. \n \"Nobody knows what I'm going to do on the 12th, although Mr. President, you have a pretty good idea,\" he said in an appearance with Mr. Macron, who winked at him in silent reply. \"But we'll see. But we'll see also if I do what some people expect, whether or not it will be possible to do a new deal with solid foundations. Because this is a deal with decayed foundations. It's a bad deal. It's a bad structure. It's falling down. It should have never, ever been made.\" \nAs Iran warned on Tuesday that it might resume its nuclear activities if the United States does pull out, Mr. Trump threatened it with unspecified retaliation. \"You can mark it down,\" he said. \"If they restart their nuclear program, they will have bigger problems than they have ever had before.\" \nAs for North Korea, Mr. Trump held out hope for an enduring deal that has eluded his three most recent predecessors. \"We're having very, very good discussions,\" he said. \"Kim Jong-un, he really has been very open and I think very honorable from everything we're seeing.\" \nThe president has previously denounced Mr. Kim as a \"madman,\" nicknamed him \"Little Rocket Man,\" derided him as \"short and fat\" and threatened to rain down \"fire and fury\" if he threatened the United States. \nMr. Trump praised his warm relationship with Mr. Macron on Tuesday. \nMr. Trump's praise for the North Korean leader rankled critics, who quickly pointed out that the country has one of the most repressive systems in the world. An American college student died shortly after being released from North Korean custody and three other Americans are still being held. Mr. Kim has been accused of ordering the killing of family members, including the assassination of a half brother poisoned last year with VX nerve agent in Malaysia. \nAs he held out the prospect of forging an agreement with Mr. Kim, Mr. Trump repeated his vow to walk away from the talks if they did not prove fruitful. \"Unlike past administrations, I will leave the table,\" he said. \"But I think we have a chance of doing something very special with respect to North Korea. Good for them, good for us, good for everybody.\" \nMr. Trump would not elaborate on what he meant by \"very honorable\" when asked by a reporter, but he instead repeated his hopes for a deal while denying that he had given up anything before the meeting. \"We have made no concessions despite some of the media saying that I've made concessions,\" he said. \"I haven't even discussed a concession, other than the fact that meeting is a great thing.\" \nIn his talks with Mr. Trump, Mr. Macron emphasized that, while imperfect, the Iran nuclear deal known as the Joint Comprehensive Plan of Action, or J.C.P.O.A., should not be tossed aside but instead become one pillar of a broader agreement focused on four pillars.\nThe first would curb Iran's nuclear program through 2025 or beyond, as the 2015 agreement made by President Barack Obama does, while the second would extend those limits. The third pillar would prevent Iran from developing ballistic missiles and the fourth would discourage it from interfering in neighboring countries. \nFor the first official state visit of his presidency, Mr. Trump hosted a traditional arrival ceremony on the South Lawn. \n\"I've never been as critical of the J.C.P.O.A. as President Trump has, because I believe we can add to it,\" Mr. Macron said. \"But not knowing the decision President Trump will take, I would like us to work on a deal to build on what has already been accomplished on the J.C.P.O.A., which is beyond the current activities, the ballistic activities and the regional influence.\"\nMr. Macron said the goal would be to \"contain Iran in the region,\" an argument that seemed to resonate with Mr. Trump, who said one goal would be to block Iran from gaining access to the Mediterranean Sea through Syria. While the two announced no agreement, Mr. Macron said he sensed a \"convergence of views\" that they could build on. \nIran's security chief warned on Tuesday that his country would consider leaving the Nuclear Nonproliferation Treaty, if Mr. Trump pulls out from the 2015 agreement. The official, Ali Shamkhani, said signatories to the nonproliferation treaty have the right to leave it if they \"feel their national interests are not intertwined\" with the accord. \"This is one possibility for the Islamic Republic,\" he said during a news conference. \nFor their part, Israeli officials moved to shape Mr. Trump's thinking as well. Avigdor Liberman, the Israeli defense minister, said he planned to leave for the United States on Tuesday night so that he could meet with Defense Secretary Jim Mattis and John R. Bolton, the president's new national security adviser and a longtime opponent of the Iran nuclear agreement. The meetings, he said on Twitter, were to discuss \"Iran's expansion in the Middle East and Syria.\" \nThe comments came on a day of pomp and ceremony, as Mr. Trump rolled out the red carpet for Mr. Macron and praised their close relationship. The two embraced warmly and kissed each other on the cheek. In one odd moment in the Oval Office, Mr. Trump even brushed what he said was dandruff off Mr. Macron's jacket. \"We have to make him perfect,\" Mr. Trump said, adding, \"He is perfect.\" \nFor the first official state visit of his presidency, Mr. Trump hosted a traditional arrival ceremony on the South Lawn, complete with military bands, color guards, a fife-and-drum corps and a 21-gun salute. In the evening, he hosted an opulent state dinner, his first since taking office, featuring rack of lamb and jambalaya with nectarine tart for dessert. \n\"The wonderful friendship we have developed over the last year is a testament to the enduring friendship that binds our two nations,\" Mr. Trump said during the morning ceremony. \"Your visit, Mr. President, comes at a critical time for our alliance.\"",
  "title": "Trump signals openness to a ‘new deal' to constrain Iran",
  "title_page": null,
  "title_rss": null,
  "url": null
}
