{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "It looks like Trump took his fellow Republicans’ attacks on Obama’s Iran deal literally instead of seriously. ",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "4_LL",
  "text": "French President Emmanuel Macron tried to persuade U.S. President Donald Trump to remain in the Iran nuclear agreement during his White House visit this week. \nWASHINGTON ― As Republicans in 2016 hammered then-President Barack Obama’s nuclear agreement with Iran, their party’s foreign policy leaders and even many of the GOP candidates themselves understood that the deal, while not ideal, was worth keeping. \nSomebody, it seems, forgot to give candidate Donald Trump the memo. \nTwo years later and still bashing the agreement, Trump is now on track to effectively end it next month ― with an unintended possible consequence of triggering a resumption of the Iranian nuclear program. \n\"The Iran deal is a terrible deal. We paid $150 billion. We gave $1.8 billion in cash. That’s actual cash, barrels of cash. It’s insane. It’s ridiculous. It should have never been made,\" Trump said earlier this week ― once again repeating his false and misleading claims from the campaign trail. \n\"I strongly doubt he understands or is even aware of the most straightforward parts of the agreement,\" said Richard Nephew, a top State Department official in charge of Iran sanctions during the period the agreement was being negotiated. \nThe 2015 deal Obama’s State Department reached with Iran forced that nation to dismantle its nuclear enrichment program for at least a decade in return for the suspension of some economic sanctions. The deal’s other signatories include France, the United Kingdom and Germany, as well as the European Union, Russia and China. \nBut for Republicans running for president in 2015 and early 2016, the correct position on the Iran deal was simple: oppose it, the more vociferously, the better. \nThe deal was achieved by Obama. The Republican primary voting base hated Obama. Anything Obama did, therefore, was by definition bad and had to be undone quickly. \nI strongly doubt [Trump] understands or is even aware of the most straightforward parts of the agreement. \nRichard Nephew, former State Department official. \nBut even as GOP presidential candidates lambasted the deal, Republican foreign policy leaders on Capitol Hill understood that an international agreement that put the Iranian nuclear program on hold through at least 2025 was better than no deal at all. They passed a law that allowed Obama to go forward with the agreement while also providing political cover to Republicans who believed they needed it. \n\"The GOP votes in 2015, especially in the Senate, were relatively safe ones because it allowed a lot of anti-Obama, anti-Iran and pro-Israel posturing without actually owning the consequences of the deal collapsing, including a very real prospect of another major war in the Middle East,\" said Colin Kahl, former Vice President Joe Biden’s national security adviser. \nAmong the established GOP presidential candidates in the field, though, there was little chance of the deal collapsing. \nFlorida Sen. Marco Rubio, former Florida Gov. Jeb Bush, Ohio Gov. John Kasich, even Texas Sen. Ted Cruz ― they and others, had they won the presidency, almost certainly would have stayed in the agreement, said Rick Tyler, a Republican political consultant who worked for Cruz. \n\"They probably would have looked at it and thought: What’s best for the country?\" he said. \"I don’t know anybody who would have ripped up the deal.\" \nThat, of course, was not the public position of the candidates in the summer of 2015 and through the primary season the following winter and spring. \nAnd if Trump was woefully ill-informed about the Iran deal then, his views did not emerge from a vacuum. Rather, they tracked congressional Republicans’ attacks on the agreement, which were then amplified by candidates seeking the GOP nomination, which were then further escalated by Fox News hosts and others in the right-wing media ecosystem. \n\"Our president has betrayed Israel,\" Rubio said at a March 5, 2016 rally in Florida. \"On my first day in office, I’m going to cancel the Iran deal,\" he said two days later. \n\"If a guy is threatening to cut your throat, don’t buy him a knife,\" South Carolina Sen. Lindsey Graham said at a Feb. 10, 2016 town hall. \"This Iran deal is the worst deal.\" \nCruz promised literal violence to the agreement itself. \"Day one, I will rip to shreds the Iran deal,\" he repeated at a North Carolina rally on March 7, 2016. \nFormer Arkansas Gov. Mike Huckabee went even further, essentially accusing Obama of enabling the eventual genocide of Israelis. \"It is so naive that he would trust the Iranians. By doing so he will take the Israelis and march them to the door of the oven,\" he said on July 26, 2015. \nRight-wing media, meanwhile, described the agreement as literally giving Iran nuclear weapons as well as billions of dollars of U.S. taxpayer cash. \nIn fact, the agreement has forced Iran to give up most of its nuclear material as well as dismantle the machinery it could use to manufacture more. The $1.7 billion the United States gave to Iran was money it held in U.S. banks at the time of the 1979 revolution, plus accrued interest, which had been frozen there by U.S. sanctions for the next three and a half decades. \nWhether Trump understood that during the campaign, or even if he understands it now, is not clear. Trump famously bragged at one point that he did not study issues like NATO, even as he went on to describe his strong opinions about NATO. In August 2015, Trump told NBC News that he learned military policy from \"the shows\" ― television news and interview programs. \nOne Republican adviser close to the White House said on condition of anonymity that Trump has made no effort since taking office to inform himself ― not on the Iran deal or policy issues generally. \"He doesn’t know,\" the adviser said. \"And he doesn’t care.\" \nTrump’s former top foreign policy advisers unanimously supported staying in the Iran deal. But administration shakeups in the past two months have brought interventionists like John Bolton and Mike Pompeo aboard. \nThe Iran deal is just one instance where Trump’s not knowing or caring about policy has put his administration in a bind. \nOn the campaign trail, he repeatedly promised he would repeal Obamacare and replace it with a plan that would both offer everyone better coverage and cost far less ― an absurd claim on its face. Only after he was in office did he acknowledge that the task perhaps wasn’t that simple. \"Nobody knew that health care could be so complicated,\" he said in February 2017. \nTrump’s promise to rip up the Iran agreement actually began causing heartburn even earlier, within days of his taking office. \nAfter Iran tested a long-range missile ― something not covered by the agreement ― then-national security adviser Michael Flynn went before the White House press corps to deliver a bellicose response. But just hours later, top National Security Council staff in a briefing with those same reporters acknowledged that Iran was still complying with the agreement and said that the United States would continue to comply as well. \nUnder the lran deal legislation passed by Congress, Trump must certify every 90 days whether Iran is in compliance to prevent the reapplication of U.S. sanctions. Trump did this twice since taking office but made it clear he was unhappy about not being able to fulfill his campaign promise. Last October, he refused to certify that Iran was in compliance, bringing about the new, May 12 deadline about whether to re-impose sanctions. \nDuring his first year in office, Trump’s top foreign policy advisers unanimously supported staying in the Iran deal. But in the past two months, Trump has fired national security adviser H.R. McMaster and Secretary of State Rex Tillerson, leaving Defense Secretary Jim Mattis as the sole major voice for keeping the deal. \nTrump’s new national security adviser, John Bolton, has been best known in recent years for broadcasting his pro-interventionist views on Iran and other countries in his Fox News appearances. And newly confirmed Secretary of State Mike Pompeo, as a Kansas congressman in December 2015, told a Westminster Institute audience that the only real solution in Iran was \"the abolition of the current regime.\" \nGiven that shift in the Trump administration’s policy-making lineup and Iran’s threat to resume its nuclear program should the United States re-impose sanctions, a top priority of both French President Emmanuel Macron and German Chancellor Angela Merkel in their White House visits this week has been to persuade Trump to remain in the agreement. \nDuring his visit earlier this week, Macron tried to appeal to Trump’s fondness for largeness, selling the idea that the deal could be made bigger and better by adding on agreements that dealt with missile technology and Iran’s role in funding regional conflicts. Merkel is to repeat that message Friday, according to Western European diplomats. \nWhether their words have any effect remains to be seen. Trump has already ignored U.S. allies on tariffs and the Paris climate agreement because he believes those issues are important to his loyal supporters, even as his popularity has plummeted among everybody else, according to those close to him. \nIronically, it is precisely that cult-like loyalty that could give Trump a path to preserving the deal without losing any support, said Tyler, the former campaign aide to Cruz. \n\"The Iran deal used to be important to the ideologically based Republican Party, which no longer exists,\" Tyler said. \"Trump’s supporters are not paying attention to policy in any deep way. It’s basically: ‘Whatever Trump says goes, and that’s fine with us.’\"",
  "title": "Trump hates the Iran deal and may kill it – even if he still doesn’t understand it",
  "title_page": null,
  "title_rss": null,
  "url": null
}
