{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "4_M",
  "text": "WASHINGTON — President Trump vowed Tuesday to look for common ground with his French counterpart in dealing with Iran but made no commitment to stick with the nuclear agreement he described as \"insane\" and \"ridiculous.\" \nReceiving French President Emmanuel Macron for a state visit at the White House, Trump repeated his criticism of the agreement to freeze Iran's nuclear program, saying it doesn't address Tehran's missile program or its attempts to foment unrest in the region. \nAnd Trump issued an explicit warning to Iran as the world waits to see whether his administration pulls out of the agreement next month. \n“If they restart their nuclear program, they will have bigger problems than they have ever had before,\" Trump said during a meeting with Macron in the Oval Office. \"You can mark it down.\" \nStill, he said, the U.S. and France were \"beginning to understand each other\" on the  need to contain Iran. \nMacron and other European leaders have encouraged Trump to remain in the agreement. Macron told reporters Tuesday he wants to work on a \"new deal\" with Iran that would build on the current agreement but also address Trump's concerns. \nMacron described discussions at the White House as \"very frank.\" \n\"It's not a mystery we did not have the same starting positions or stances, and neither you nor I have a habit of changing our stances or going with the wind,\" Macron told Trump during a press conference in the East Room. \nThe two leaders also said that containing Iran was the key to lasting peace in Syria. Trump has previously said he wants to bring U.S. troops home from Syria quickly but Macron has urged a longer timeline. The president on Tuesday reiterated his desire for a speedy withdrawal but also injected nuance into his answer. \n\"As far as Syria is concerned, I would love to get out. I would love to bring our brave warriors back home,\" Trump said. \"Emmanuel and myself have discussed that we don't want to give Iran open season to the Mediterranean (Sea).\" \nTrump said he wanted to bring troops home \"relatively soon\" but said \"we want to leave a strong and lasting footprint.\" \nThroughout a heavily scripted series of meetings and ceremonial encounters, Trump and Macron showed off their close relationship through words and body language. Trump held Macron's hands, showered him with compliments and even brushed what he said was a piece of dandruff off of Macron's suit. \n\"I like him a lot,\" Trump said sheepishly after getting a kiss on the cheek from Macron. \nBut even as they touted what Trump called \"a very special relationship,\" Macron repeatedly hinted at the issues dividing the two countries: the Iran nuclear deal, the environment and trade. \n\"It is together that we will be able to act effectively for our planet,\" Macron said in remarks at an opening ceremony. \"I'm not just referring to climate, but also to the oceans, to biodiversity, and to all forms of pollutions. On this issue, we do not always agree as to the solutions, but in the end, such is the case in any family and in any friendship.\" \nMacron's welcoming remarks were notably more specific than Trump's, which focused on the long 241-year friendship between the two countries — and his personal friendship with Macron, who has emerged as Trump's most trusted European ally over the past year. \nMore: President Trump after picking something off Macron's suit: 'We have to make him perfect'. \n\"The wonderful friendship we have developed over the past year is a testimony to the historic friendship between our two nations,\" Trump said. \nTrump and Macron met amid the protocol-laden pomp of a formal state visit, the first of Trump's presidency. Following Trump's visit to Paris for Bastille Day ceremonies last year, it's the second one-on-one summit between the two leaders, not counting four other meetings at other summits. \nDespite the close relationship the two leaders have cultivated, Macron's visit underscored deep policy differences between Paris and Washington. Chief among those is the Iran nuclear agreement, which Trump has referred to as \"the worst deal ever negotiated.\" \nTrump made upending the Iran deal, which was negotiated by President Obama, a centerpiece of his presidential campaign. He did little to soften that position Tuesday. \n\"It's insane. It's ridiculous. It should have never been made,\" Trump said of the deal in the Oval Office as Macron sat at his side. \n\"But we will be talking about it.\"  \nTrump must decide next month whether to restore economic sanctions on Iran, effectively withdrawing from the multi-nation deal. The issue certain to come up again when German Chancellor Angela Merkel visits the White House later this week. \nAfter meeting with Macron, Trump said the two had more substantive talks on Iran than any other issue.  \nMacron said he wants to pursue a new deal with Iran that would build on the existing agreement while also limiting Tehran's ballistic missile program and its influence in the Middle East. \nTrump appeared to be skeptical of such an agreement. \n\"We'll see,\" he said, \"whether or not it will be possible to do a new deal with solid foundations.\" \nTrade also featured prominently on Macron's agenda. The French president has openly criticized Trump's protectionist moves in recent weeks and wants Washington to exempt European Union.",
  "title": "Trump, Emmanuel Macron seek common ground on Iran deal that Trump calls 'insane'. ",
  "title_page": null,
  "title_rss": null,
  "url": null
}
