{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "4_R",
  "text": "President Trump warned Iran's leaders Tuesday that if Iran \"threatens\" the U.S. \"they will pay a price like no country has ever paid.\" \nHe also stood by his criticism of the Obama-era nuclear pact as visiting French President Emmanuel Macron lobbied him to preserve it. \nIn a joint-press conference at the White House Tuesday afternoon, Trump doubled-down on comments he made earlier in the day, issuing a warning to Iran. \n\"If Iran threatens us in any way, they will pay a price like no country has ever paid,\" Trump said, noting that when the Obama administration made the Iran deal in 2015, they \"should have made a deal that covered Yemen, Syria and other parts of the Middle East where Iran is involved.\" \nMeanwhile, Macron said that he was unclear what Trump would decide in terms of the deal. He must announce a decision whether to re-certify on May 12. \n\"[I hope] we can combine our common views and differences. [I have] always said we should not tear apart JCPOA and have nothing else—that would not be a good solution,\" Macron said. \"It's not about tearing apart the agreement, but about building something new that will cover all concerns.\" \nEarlier Tuesday, Trump held an Oval Office meeting with Macron where they discussed several important foreign policy issues – including the Iran Nuclear deal. \n\"People know my view. It is a terrible deal that should have never been made,\" Trump said during the meeting. \"Iran seems to be behind everything where there is a problem. You look at what's happening, in any—virtually any place in the Middle East, and Iran is behind it.\" \nTrump delayed the decision to re-certify the 2015 Iran nuclear agreement, which lifts economic sanctions on Iran in exchange for winding down their nuclear program. The president is expected to make a decision on the future of the Obama-era program on May 12. \nEarly Tuesday, Iranian President Hassan Rouhani warned the U.S. there would be \"grave\" consequences if the U.S. withdraws from the nuclear agreement between Tehran and world powers, noting that Iran would \"strongly resist\" any plans for the U.S. to withdraw. \nBut when asked what the U.S. strategy would be should Iran restart their nuclear program, Trump warned that it \"won't be so easy to restart.\" \n\"If they restart their nuclear program, they're going to have big problems—bigger than they've ever had before,\" Trump said Tuesday. \nTrump and first lady Melania Trump welcomed Macron and his wife to the White House Tuesday morning in their first formal state visit, ahead of a day of foreign policy discussions for the U.S. and France. \nMacron, along with his wife Brigitte Macron, was greeted by the Trumps, Vice President Pence, Cabinet officials, lawmakers and nearly 500 U.S. service members from all five military branches. \n\"Melania and I were honored to visit your country last summer, and now are thrilled to host you and Brigitte here in America,\" Trump said at the White House upon Macron's arrival. \"The wonderful friendship we've developed is a testament to an enduring friendship that binds our two nations.\" \nTrump added that \"it is truly fitting that we are holding our first official state visit with the leader of America's oldest ally, the proud nation of France.\" \nTrump and Macron met in a more casual setting on Monday, featuring a helicopter tour of Washington and a visit to Mount Vernon. But Tuesday is slated for serious policy discussions, following French and British support as the U.S. launched airstrikes into Syria in the wake of a deadly chemical attack this month. \n\"Your visit comes at a critical time for alliance,\" Trump said Tuesday on the White House lawn. \"The United States, France and the United Kingdom took decisive action in response to the Syrian regime's use of chemical weapons.\" \nTrump said he wanted to \"personally thank\" Macron, the French military and the people for their \"partnership.\" Trump also said \"now is the time for strength.\" \n\"So let us be strong and united, let us honor our past and face our future with confidence and pride,\" Trump said. \"And let the U.S. and France stand forever in solidarity for the noble causes of liberty and peace.\" \nMacron gave remarks following the president's, which were delivered in French with an English translation. \n\"Thank you for honoring this visit, the first of your presidency, which bears witness to the strength that unites our two countries,\" Macron said, adding that America \"represents endless possibilities\" for France. \n\"It is together that we shall build a new form of prosperity for all peoples, free and fair trade, and the protection of all classes,\" Macron said, adding that \"together we will be able to act effectively for our planet.\" \nTrump withdrew the U.S. from the Paris Climate Accord last year, but Macron noted he was \"not just referring to climate.\" \n\"On this issue, we don't always agree, but in the end, such is the case in any family or friendship,\" Macron said. \"It is together that we can resist the rise of aggressive nationalisms that divide our history and world. Together, we will build new strong multilateralism that defends democracy in the fate of ill winds.\" \nMacron touted the relationship between the U.S. and France under the Trump administration as having \"constantly grown more solid.\"",
  "title": "Trump warns Iran on nuclear program as Macron aims to preserve pact",
  "title_page": null,
  "title_rss": null,
  "url": null
}
