{
  "authors": [],
  "date_download": null,
  "date_modify": null,
  "date_publish": null,
  "description": "",
  "filename": null,
  "image_url": null,
  "language": "en",
  "localpath": null,
  "source_domain": "4_RR",
  "text": "Iranian President Hassan Rouhani warns Saudi Arabia that it will achieve nothing by threatening the might of Iran, as a war of words between the regional heavyweights intensifies. \nPresident Donald Trump did not restrain giving his opinion about the \"terrible\" Iran nuclear deal on Tuesday during a meeting with French President Emmanuel Macron, warning Iran against restarting its nuclear program. \n\"You'll find out about that. It won't be so easy for them to restart. They're not going to be restarting anything. They restart it, they're going to have big problems, bigger than they've ever had before,\" Trump said during his meeting with Macron at the White House. \nThe Iranians warned that if the United States withdrew from the deal, they would restart their efforts to develop nuclear weapons. \nTrump repeated that the deal reached under the Obama administration was a \"terrible deal.\" \n\"It's insane. It's ridiculous,\" Trump said when asked by reporters about the deal. \"It should never have been made, but we will be talking about it.\" \nMacron said the Iran deal was an important part of stabilizing the region, pointing out that it was important to contain Iranian influence. \nTrump agreed that Iran was a problem. \n\"It just seems that no matter where you go, especially in the Middle East, Iran is behind it. Wherever there's trouble — Yemen, Syria, no matter where you have it — Iran is behind it,\" he said. \nHe added that, \"unfortunately,\" Russia was also getting more involved in the region. \nTrump ridiculed former Secretary of State John Kerry for not addressing other important issues in the Iran deal at the time of the agreement. \n\"The Iran deal is a disaster,\" he said, pointing out that Iran was continuing to test ballistic missiles and fund terrorism in the Middle East.",
  "title": "Donald Trump warns Iran against restarting nuclear program: 'They restart it, they're going to have big problems'",
  "title_page": null,
  "title_rss": null,
  "url": null
}
