{"authors": [], "date_download": null, "date_modify": null, "date_publish": " July 03, 2013 6 : 22AM", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "37_10ecbplus", "text": " AN EARTHQUAKE killed six children and left 14 others trapped when a mosque collapsed during a Koran reading session in Indonesia's Aceh province, bringing the confirmed death toll from the disaster to 11.  The strong 6.1-magnitude quake left hundreds more injured as it rocked a region that was devastated by the quake - triggered tsunami of 2004.  The earthquake reduced houses in parts of Aceh to rubble, set off several landslides and badly damaged roads.  Rescuers were struggling to find the children still trapped after the mosque collapse in Blang Mancung village, Central Aceh district.  \"Our search and rescue teams are struggling to evacuate an estimated 14 children still trapped under the rubble, '' said Subhan Sahara, the head of the local disaster management agency.  \"I hope they can be found alive but the chances are very slim, '' he added, explaining they were reading the Koran together when the quake struck.  The quake, which hit at a shallow depth of just 10 kilometres, injured more than 200 people and damaged more than 300 houses in Aceh, said national disaster agency spokesman Sutopo Purwo Nugroho.  As police and military personnel struggled to reach affected areas late Tuesday, there were two aftershocks of more than 5.0 magnitude.  In a village in Bener Meriah district, one man was killed when a landslide engulfed a coffee plantation, said disaster agency official Fauzi.  \"A man was working at a coffee plantation with his wife when a landslide caused by the quake struck.  His body was found under a pile of earth soon afterwards, '' he said, adding that his wife and another woman were missing at the site.  Another four people died in hospitals in the district from injuries sustained in the quake, he said.  One of the fatalities was a child who died when a wall collapsed, said Ema Suryani, a doctor at a health clinic in Lampahan city in the district.  \"We have received around 50 people with injuries sustained when the walls of their houses collapsed, '' added the doctor.  \"There are around 30 people seriously injured, some with head injuries.  The rest have only light injuries like minor cuts and grazes. ''  Injured people had been transported from several affected villages in two trucks, she said.  People ran outside in Banda Aceh as the quake shook houses, and in Medan city to the south of the province on Sumatra island.  \"The quake was felt strongly for around 15 seconds, from Bener Meriah to Banda Aceh.  People panicked and rushed out of their homes, '' said national disaster agency spokesman Nugroho.  Aceh, on the northern tip of Sumatra, is regularly hit by quakes.  In 2004 a massive tremor sparked a tsunami that killed 170, 000 people in the province and tens of thousands more in countries around the Indian Ocean.  In April last year an 8.6-magnitude quake struck 431 kilometres off Banda Aceh, prompting an Indian Ocean - wide tsunami alert.  Five people died and seven were injured in Aceh in the quake and following aftershocks.  In September 2009 a major earthquake near Padang city on Sumatra killed more than 1000 people.  Indonesia sits on the Pacific \"Ring of Fire'' where tectonic plates collide, causing frequent seismic and volcanic activity.", "title": " 6.1-magnitude quake strikes Indonesia's Aceh province in region hit by 2004 tsunami.", "title_page": null, "title_rss": null, "url": " http : / / www. news.com. au / world - news / magnitude - quake - strikes - indonesias - aceh - province - in - region - hit - by - 2004 - tsunami / story - fndir2ev - 1226673361487"}