{"authors": [], "date_download": null, "date_modify": null, "date_publish": " Updated : July 02, 2013 15 : 50 IST", "description": "", "filename": null, "image_url": null, "language": "en", "localpath": null, "source_domain": "37_4ecbplus", "text": " A 6.1-magnitude earthquake which hit the Indonesian province of Aceh on Tuesday killed a child, injured dozens and destroyed buildings, sparking panic in a region devastated by the quake - triggered tsunami of 2004.  The quake struck inland at 0737 GMT at a depth of just 10 kilometres (6. 2 miles) in the mountainous Bener Meriah district in the heart of Aceh, the US Geological Survey said.  Houses collapsed in the district, some 320 kilometres (200 miles) from the provincial capital Banda Aceh.  \"A child died when a wall collapsed,\" Ema Suryani, a doctor at a health clinic in Lampahan city, told AFP.  \"We have received around 50 people with injuries suffered when the walls of their houses collapsed,\" added the doctor.  \"There are around 30 people seriously injured, some with head injuries.  The rest have only light injuries like minor cuts and grazes.\"  Injured people had been transported from several affected villages in two trucks, she said.  People ran outside in panic in Banda Aceh as the quake shook houses, and in Medan city to the south of Aceh province on Sumatra island.  \"The quake was felt strongly for around 15 seconds, from Bener Meriah to Banda Aceh.  People panicked and rushed out of their homes,\" national disaster agency spokesman Sutopo Purwo Nugroho said.  Aceh, on the northern tip of Sumatra, is regularly hit by quakes.  In 2004 a massive tremor sparked a tsunami that killed 170, 000 people in the province and tens of thousands more in countries around the Indian Ocean.  In April last year an 8.6-magnitude quake struck 431 kilometres off Banda Aceh, prompting an Indian Ocean - wide tsunami alert.  Five people died and seven were injured in Aceh in the quake and following aftershocks.  In September 2009, a major earthquake near Padang city on Sumatra killed more than 1, 000 people.  Indonesia sits on the Pacific \"Ring of Fire\"where tectonic plates collide, causing frequent seismic and volcanic activity.", "title": " Dozens injured, child dead as 6.1-magnitude earthquake hits Indonesia's Aceh.", "title_page": null, "title_rss": null, "url": " http : / / www. ndtv.com / article / world / dozens - injured - child - dead - as - 6 - 1 - magnitude - earthquake - hits - indonesia - s - aceh - 386911"}